init.org
#+TITLE: Xiaojie's Emacs Init File Written in Org-Mode
:PREAMBLE:
#+AUTHOR: Xiaojie Feng
#+EMAIL: fengxiaojie1997@gmail.com
#+DATE: 2016-2019
#+LANGUAGE: en
#+OPTIONS:   H:3 num:3 toc:3 \n:nil @:t ::t |:t ^:nil -:t f:t *:t <:nil
#+OPTIONS:   TeX:t LaTeX:nil skip:nil d:nil todo:t pri:nil tags:not-in-toc
#+OPTIONS:   author:t creator:t timestamp:t email:t
#+HTML_HEAD: <link rel="stylesheet" href="./assets/page.css" type="text/css">
#+HTML_HEAD: <link class="s-css-s--style" rel="stylesheet"           title="Default"               href="./assets/themes/default.css">
#+HTML_HEAD: <link class="s-css-s--style" rel="stylesheet alternate" title="Default high contrast" href="./assets/themes/default-high-contrast.css">
#+HTML_HEAD: <link class="s-css-s--style" rel="stylesheet alternate" title="Solarized dark xterm"  href="./assets/themes/solarized-dark-xterm.css">
#+HTML_HEAD: <link class="s-css-s--style" rel="stylesheet alternate" title="Black on white"        href="./assets/themes/black-on-white.css">
#+HTML_HEAD: <script src="./assets/js/simple-css-switch.js"></script>
#+HTML_HEAD: <body lang="en" onload="simpleCssSwitch()">
#+HTML_HEAD: <div id="s-css-s--menu"></div>
:END:

* About
** My Emacs Init File
   
This is my Emacs configuration file. Inspired by [[http://pages.sachachua.com/.emacs.d/Sacha.html][Sacha]] and [[http://doc.norang.ca/org-mode.html][Bernt]], l written it
using [[https://orgmode.org/worg/org-contrib/babel/intro.html][Org-babel]] in literate style, to make it easy to explain.

#+BEGIN_SRC org
  Author: Xiaojie Feng
  Keywords: emacs, dotfile, config

     ___ _ __ ___   __ _  ___ ___
    / _ \ '_ ` _ \ / _` |/ __/ __|
   |  __/ | | | | | (_| | (__\__ \
  (_)___|_| |_| |_|\__,_|\___|___/
#+END_SRC
