init.org
** What I Want to Say

If you are not familiar with the Emacs basic usage, I highly recommend you to
read some sophisticated Emacs users' Emacs guide, such as [[http://tuhdo.github.io/emacs-tutor.html][Tuhdo's Emacs Mini
Manual (PART 1) - THE BASICS]] and [[http://ergoemacs.org/emacs/emacs.html][Xah Lee's Practical Emacs Tutorial]], instead of
[[https://www.gnu.org/software/emacs/manual/html_node/emacs/][the official Emacs Manual]]. The official manual is too long to read for Emacs
newbies.

You can always use my init file as long as you master the basic usage of Emacs,
even though my configuration contains something a little advanced to Emacs (and
Emacs Lisp) beginners. As I think, the init file was well organized in
structural and code blocks (=setq=, =defun=, package configuration etc.) were
written together with plenty explanation about why and how to use, thanks to
the [[https://en.wikipedia.org/wiki/Literate_programming][Literate programming paradigm]] introduced by Donald Knuth.

** How to Use This Document

This document is available as an org file which you can load in Emacs and
tangle with =M-x org-babel-tangle (C-c C-v C-t)= which will create
=org-mode.el= in the same directory as the =org-mode.org= file. This will
extract all of the elisp examples in this document into a file you can include
in your =$HOME/.emacs.d/init.el= file.

If you're new to [[https://www.gnu.org/software/emacs/manual/html_node/eintr/index.html][Emacs Lisp]], you probably don't want to copy and paste large
chunks of this code. Instead, copy small parts of it (always making sure to
copy a complete set of parentheses) into your =*scratch*= buffer or some other
buffer in =emacs-lisp-mode=. Use =M-x eval-buffer= to evaluate the code and see
if you like the way that Emacs behaves.

If you're viewing the Org file, you can open source code blocks (those are the
ones in begin_src) in a separate buffer by moving your point inside them and
typing C-c ' (=M-x org-edit-special=). This opens another buffer in
=emacs-lisp-mode=, so you can use =M-x eval-buffer= to load the changes.

* Personal Information

Emacs will normally pick this up automatically, but this way I can be sure the
right information is always present.

*Note: You should modify this with your personal info.*

#+BEGIN_SRC emacs-lisp :tangle yes
  (setq user-full-name "Xiaojie Feng"
        user-mail-address "fengxiaojie1997@gmail.com")
#+END_SRC
* Bootstraping
** Load Multiple Emacs Files
*** My Directory Location

Conventionally, additional per-user Emacs-specific files are placed in
=.emacs.d= directory in the =HOME= directory. The variable
=user-emacs-directory= holds that.

Structure the =.emacs.d= directory by putting some sub-directories in it.
Following functions make it easy to get the location (whole path) of these
sub-directories (and files):

#+BEGIN_SRC emacs-lisp :tangle yes
  (defun user-emacs-subdirectory (d) (expand-file-name d user-emacs-directory))
  (defun user-emacs-file (f) (expand-file-name f user-emacs-directory))
#+END_SRC

But, in practice, I didn't use them.

*** Directory Structure

In case this is the first time running this on a computer, we need to make sure
the following directories have been created.

#+BEGIN_SRC emacs-lisp :tangle yes
  (defconst user-emacs-savefile-dir
    (expand-file-name "savefile" user-emacs-directory)
    "This folder stores all the history and cache files")
  (defconst user-emacs-backup-dir
    (expand-file-name "backup" user-emacs-directory)
    "This folder stores all the backup~ files")
  (defconst user-emacs-autosave-dir
    (expand-file-name "autosave" user-emacs-directory)
    "This folder stores all the #autosave# files")

  (unless (file-exists-p user-emacs-savefile-dir)
    (make-directory user-emacs-savefile-dir))
  (unless (file-exists-p user-emacs-backup-dir)
    (make-directory user-emacs-backup-dir))
  (unless (file-exists-p user-emacs-autosave-dir)
    (make-directory user-emacs-autosave-dir))
#+END_SRC
*** Customization

While I would rather program my configurations, sometimes the Emacs
menu system is "good enough", but I want it in its own file:

#+BEGIN_SRC emacs-lisp :tangle yes
  (setq custom-file (expand-file-name "custom.el" user-emacs-directory))
  (when (file-exists-p custom-file)
    (load custom-file))
#+END_SRC
*** Setting up the Load Path

Extra packages not available via the package manager go in my personal stash at
=$HOME/.emacs.d/elisp=. As long as they're in a directory in my =load-path=,
Emacs can find them.

#+BEGIN_SRC emacs-lisp :tangle yes
  (add-to-list 'load-path (expand-file-name "elisp" user-emacs-directory))
#+END_SRC
** Package Management
