init.html
<div id="outline-container-orgf87c615" class="outline-3">
<h3 id="orgf87c615"><span class="section-number-3">1.4</span> What I Want to Say</h3>
<div class="outline-text-3" id="text-1-4">
<p>
If you are not familiar with the Emacs basic usage, I highly recommend you to
read some sophisticated Emacs users' Emacs guide, such as <a href="http://tuhdo.github.io/emacs-tutor.html">Tuhdo's Emacs Mini
Manual (PART 1) - THE BASICS</a> and <a href="http://ergoemacs.org/emacs/emacs.html">Xah Lee's Practical Emacs Tutorial</a>, instead of
<a href="https://www.gnu.org/software/emacs/manual/html_node/emacs/">the official Emacs Manual</a>. The official manual is too long to read for Emacs
newbies.
</p>

<p>
You can always use my init file as long as you master the basic usage of Emacs,
even though my configuration contains something a little advanced to Emacs (and
Emacs Lisp) beginners. As I think, the init file was well organized in
structural and code blocks (<code>setq</code>, <code>defun</code>, package configuration etc.) were
written together with plenty explanation about why and how to use, thanks to
the <a href="https://en.wikipedia.org/wiki/Literate_programming">Literate programming paradigm</a> introduced by Donald Knuth.
</p>
</div>
</div>

<div id="outline-container-org2bba385" class="outline-3">
<h3 id="org2bba385"><span class="section-number-3">1.5</span> How to Use This Document</h3>
<div class="outline-text-3" id="text-1-5">
<p>
This document is available as an org file which you can load in Emacs and
tangle with <code>M-x org-babel-tangle (C-c C-v C-t)</code> which will create
<code>org-mode.el</code> in the same directory as the <code>org-mode.org</code> file. This will
extract all of the elisp examples in this document into a file you can include
in your <code>$HOME/.emacs.d/init.el</code> file.
</p>

<p>
If you're new to <a href="https://www.gnu.org/software/emacs/manual/html_node/eintr/index.html">Emacs Lisp</a>, you probably don't want to copy and paste large
chunks of this code. Instead, copy small parts of it (always making sure to
copy a complete set of parentheses) into your <code>*scratch*</code> buffer or some other
buffer in <code>emacs-lisp-mode</code>. Use <code>M-x eval-buffer</code> to evaluate the code and see
if you like the way that Emacs behaves.
</p>

<p>
If you're viewing the Org file, you can open source code blocks (those are the
ones in begin_src) in a separate buffer by moving your point inside them and
typing C-c ' (<code>M-x org-edit-special</code>). This opens another buffer in
<code>emacs-lisp-mode</code>, so you can use <code>M-x eval-buffer</code> to load the changes.
</p>
</div>
</div>
</div>

<div id="outline-container-orgd5215fe" class="outline-2">
<h2 id="orgd5215fe"><span class="section-number-2">2</span> Personal Information</h2>
<div class="outline-text-2" id="text-2">
<p>
Emacs will normally pick this up automatically, but this way I can be sure the
right information is always present.
</p>

<p>
<b>Note: You should modify this with your personal info.</b>
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #78c5d6;">(</span><span style="color: #F0DFAF; font-weight: bold;">setq</span> user-full-name <span style="color: #CC9393;">"Xiaojie Feng"</span>
      user-mail-address <span style="color: #CC9393;">"fengxiaojie1997@gmail.com"</span><span style="color: #78c5d6;">)</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-orgb9513ad" class="outline-2">
<h2 id="orgb9513ad"><span class="section-number-2">3</span> Bootstraping</h2>
<div class="outline-text-2" id="text-3">
</div>
<div id="outline-container-orga0d3e90" class="outline-3">
<h3 id="orga0d3e90"><span class="section-number-3">3.1</span> Load Multiple Emacs Files</h3>
<div class="outline-text-3" id="text-3-1">
</div>
<div id="outline-container-org3d15ef9" class="outline-4">
<h4 id="org3d15ef9"><span class="section-number-4">3.1.1</span> My Directory Location</h4>
<div class="outline-text-4" id="text-3-1-1">
<p>
Conventionally, additional per-user Emacs-specific files are placed in
<code>.emacs.d</code> directory in the <code>HOME</code> directory. The variable
<code>user-emacs-directory</code> holds that.
</p>

<p>
Structure the <code>.emacs.d</code> directory by putting some sub-directories in it.
Following functions make it easy to get the location (whole path) of these
sub-directories (and files):
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #78c5d6;">(</span><span style="color: #F0DFAF; font-weight: bold;">defun</span> <span style="color: #93E0E3;">user-emacs-subdirectory</span> <span style="color: #bf62a6;">(</span>d<span style="color: #bf62a6;">)</span> <span style="color: #bf62a6;">(</span>expand-file-name d user-emacs-directory<span style="color: #bf62a6;">)</span><span style="color: #78c5d6;">)</span>
<span style="color: #78c5d6;">(</span><span style="color: #F0DFAF; font-weight: bold;">defun</span> <span style="color: #93E0E3;">user-emacs-file</span> <span style="color: #bf62a6;">(</span>f<span style="color: #bf62a6;">)</span> <span style="color: #bf62a6;">(</span>expand-file-name f user-emacs-directory<span style="color: #bf62a6;">)</span><span style="color: #78c5d6;">)</span>
</pre>
</div>

<p>
But, in practice, I didn't use them.
</p>
</div>
</div>

<div id="outline-container-org9f8789d" class="outline-4">
<h4 id="org9f8789d"><span class="section-number-4">3.1.2</span> Directory Structure</h4>
<div class="outline-text-4" id="text-3-1-2">
<p>
In case this is the first time running this on a computer, we need to make sure
the following directories have been created.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #78c5d6;">(</span><span style="color: #F0DFAF; font-weight: bold;">defconst</span> <span style="color: #DFAF8F;">user-emacs-savefile-dir</span>
  <span style="color: #bf62a6;">(</span>expand-file-name <span style="color: #CC9393;">"savefile"</span> user-emacs-directory<span style="color: #bf62a6;">)</span>
  <span style="color: #9FC59F;">"This folder stores all the history and cache files"</span><span style="color: #78c5d6;">)</span>
<span style="color: #78c5d6;">(</span><span style="color: #F0DFAF; font-weight: bold;">defconst</span> <span style="color: #DFAF8F;">user-emacs-backup-dir</span>
  <span style="color: #bf62a6;">(</span>expand-file-name <span style="color: #CC9393;">"backup"</span> user-emacs-directory<span style="color: #bf62a6;">)</span>
  <span style="color: #9FC59F;">"This folder stores all the backup~ files"</span><span style="color: #78c5d6;">)</span>
<span style="color: #78c5d6;">(</span><span style="color: #F0DFAF; font-weight: bold;">defconst</span> <span style="color: #DFAF8F;">user-emacs-autosave-dir</span>
  <span style="color: #bf62a6;">(</span>expand-file-name <span style="color: #CC9393;">"autosave"</span> user-emacs-directory<span style="color: #bf62a6;">)</span>
  <span style="color: #9FC59F;">"This folder stores all the #autosave# files"</span><span style="color: #78c5d6;">)</span>

<span style="color: #78c5d6;">(</span><span style="color: #F0DFAF; font-weight: bold;">unless</span> <span style="color: #bf62a6;">(</span>file-exists-p user-emacs-savefile-dir<span style="color: #bf62a6;">)</span>
  <span style="color: #bf62a6;">(</span>make-directory user-emacs-savefile-dir<span style="color: #bf62a6;">)</span><span style="color: #78c5d6;">)</span>
<span style="color: #78c5d6;">(</span><span style="color: #F0DFAF; font-weight: bold;">unless</span> <span style="color: #bf62a6;">(</span>file-exists-p user-emacs-backup-dir<span style="color: #bf62a6;">)</span>
  <span style="color: #bf62a6;">(</span>make-directory user-emacs-backup-dir<span style="color: #bf62a6;">)</span><span style="color: #78c5d6;">)</span>
<span style="color: #78c5d6;">(</span><span style="color: #F0DFAF; font-weight: bold;">unless</span> <span style="color: #bf62a6;">(</span>file-exists-p user-emacs-autosave-dir<span style="color: #bf62a6;">)</span>
  <span style="color: #bf62a6;">(</span>make-directory user-emacs-autosave-dir<span style="color: #bf62a6;">)</span><span style="color: #78c5d6;">)</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-orgd3d9c9d" class="outline-4">
<h4 id="orgd3d9c9d"><span class="section-number-4">3.1.3</span> Customization</h4>
<div class="outline-text-4" id="text-3-1-3">
<p>
While I would rather program my configurations, sometimes the Emacs
menu system is "good enough", but I want it in its own file:
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #78c5d6;">(</span><span style="color: #F0DFAF; font-weight: bold;">setq</span> custom-file <span style="color: #bf62a6;">(</span>expand-file-name <span style="color: #CC9393;">"custom.el"</span> user-emacs-directory<span style="color: #bf62a6;">)</span><span style="color: #78c5d6;">)</span>
<span style="color: #78c5d6;">(</span><span style="color: #F0DFAF; font-weight: bold;">when</span> <span style="color: #bf62a6;">(</span>file-exists-p custom-file<span style="color: #bf62a6;">)</span>
  <span style="color: #bf62a6;">(</span>load custom-file<span style="color: #bf62a6;">)</span><span style="color: #78c5d6;">)</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-org309d8a1" class="outline-4">
<h4 id="org309d8a1"><span class="section-number-4">3.1.4</span> Setting up the Load Path</h4>
<div class="outline-text-4" id="text-3-1-4">
<p>
Extra packages not available via the package manager go in my personal stash at
<code>$HOME/.emacs.d/elisp</code>. As long as they're in a directory in my <code>load-path</code>,
Emacs can find them.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #78c5d6;">(</span>add-to-list 'load-path <span style="color: #bf62a6;">(</span>expand-file-name <span style="color: #CC9393;">"elisp"</span> user-emacs-directory<span style="color: #bf62a6;">)</span><span style="color: #78c5d6;">)</span>
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-org18fd979" class="outline-3">
<h3 id="org18fd979"><span class="section-number-3">3.2</span> Package Management</h3>
<div class="outline-text-3" id="text-3-2">
</div>
