init.org
*** =ELPA= - Packages Installer and Manager

Emacs has become like every other operating system, and now has a package
manager called [[http://tromey.com/elpa/][Emacs Lisp Package Archive (ELPA)]] with its own collection
repository. This provides a nice way to [[http://ergoemacs.org/emacs/emacs_package_system.html][install additional packages]]. But since
it is so conservative, we need to add more package source.

#+BEGIN_SRC emacs-lisp :tangle no
  (require 'package)
  (setq package-archives
        '(("gnu" . "https://elpa.gnu.org/packages/")
          ("org" . "http://orgmode.org/elpa/")
          ("melpa" . "https://melpa.org/packages/")))

  (package-initialize)
  (setq package-enable-at-startup nil)
#+END_SRC

*Note:* As a Chinese user, I use the following mirrors instead. If you want to
use my emacs init file directly, you should change the value =yes= and =no=
after variable =:tangle= in the org file, then tangle the org file with
=org-babel= to use the official package source.

#+BEGIN_SRC emacs-lisp :tangle yes
  (require 'package)
  (setq package-archives
        '(("gnu"   . "http://elpa.emacs-china.org/gnu/")
          ("melpa" . "http://elpa.emacs-china.org/melpa/")
          ("org"   . "http://elpa.emacs-china.org/org/")))

  (package-initialize)
  (setq package-enable-at-startup nil)
#+END_SRC
*** =Use-Package= - Package Configuration Macro

This [[https://github.com/jwiegley/use-package][use-package]] macro provides more concise ways to setup package autoloads,
keybindings, and various mode configuration. The focus is on decreasing startup
time by /autoloading/ packages instead loading them on startup.

#+BEGIN_SRC emacs-lisp :tangle yes
  (unless (package-installed-p 'use-package)
    (package-refresh-contents)
    (package-install 'use-package))

  (setq use-package-verbose t
        use-package-always-ensure t)

  (eval-when-compile
    (require 'use-package))

  ;; Please don't load outdated byte code
  (setq load-prefer-newer t)
#+END_SRC
** Library Dependency 

Load up a collection of enhancements to Emacs Lisp, to make the configuration
and its dependencies work properly.

#+BEGIN_SRC emacs-lisp :tangle yes
  (require 'cl)                           ; provides useful things like `loop' and `setf'
  (use-package dash :ensure t)            ; a modern list library
  (use-package diminish :ensure t)        ; diminish keeps the modeline tidy
#+END_SRC

Benefiting from org-mode's contrib:

#+BEGIN_SRC emacs-lisp :tangle yes
  (use-package org
    :ensure org-plus-contrib)
#+END_SRC
** Environment fixup

On macOS, Emacs doesn't use the shell PATH if it's not started from the shell
(started from the GUI). [[https://github.com/purcell/exec-path-from-shell][Exec-path-from-shell]] can fix this problem. It ensure
environment variables inside Emacs look the same as in the user's shell.

#+BEGIN_SRC emacs-lisp :tangle yes
  (use-package exec-path-from-shell
    :defer t
    :init
    (progn
      (when (memq window-system '(mac ns))
        (exec-path-from-shell-initialize))))
#+END_SRC
** Keyboard settings for macOS users

Set keys for Apple keyboard, for Emacs in macOS.

#+BEGIN_SRC emacs-lisp :tangle yes
  (when (eq system-type 'darwin)

    (setq mac-command-modifier 'meta)     ; make command key do Meta
    (setq mac-option-modifier 'super)     ; make option key do Super
    (setq mac-control-modifier 'control)  ; make control key do Control
    (setq ns-function-modifier 'hyper)    ; make fn key do Hyper
    )
#+END_SRC
* Basic settings used everywhere
** General user interface and appearance
