init.html
<div id="outline-container-orgf721e53" class="outline-4">
<h4 id="orgf721e53"><span class="section-number-4">3.2.1</span> <code>ELPA</code> - Packages Installer and Manager</h4>
<div class="outline-text-4" id="text-3-2-1">
<p>
Emacs has become like every other operating system, and now has a package
manager called <a href="http://tromey.com/elpa/">Emacs Lisp Package Archive (ELPA)</a> with its own collection
repository. This provides a nice way to <a href="http://ergoemacs.org/emacs/emacs_package_system.html">install additional packages</a>. But since
it is so conservative, we need to add more package source.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #78c5d6;">(</span><span style="color: #F0DFAF; font-weight: bold;">require</span> '<span style="color: #BFEBBF;">package</span><span style="color: #78c5d6;">)</span>
<span style="color: #78c5d6;">(</span><span style="color: #F0DFAF; font-weight: bold;">setq</span> package-archives
      '<span style="color: #bf62a6;">(</span><span style="color: #459ba8;">(</span><span style="color: #CC9393;">"gnu"</span> . <span style="color: #CC9393;">"https://elpa.gnu.org/packages/"</span><span style="color: #459ba8;">)</span>
        <span style="color: #459ba8;">(</span><span style="color: #CC9393;">"org"</span> . <span style="color: #CC9393;">"http://orgmode.org/elpa/"</span><span style="color: #459ba8;">)</span>
        <span style="color: #459ba8;">(</span><span style="color: #CC9393;">"melpa"</span> . <span style="color: #CC9393;">"https://melpa.org/packages/"</span><span style="color: #459ba8;">)</span><span style="color: #bf62a6;">)</span><span style="color: #78c5d6;">)</span>

<span style="color: #78c5d6;">(</span>package-initialize<span style="color: #78c5d6;">)</span>
<span style="color: #78c5d6;">(</span><span style="color: #F0DFAF; font-weight: bold;">setq</span> package-enable-at-startup nil<span style="color: #78c5d6;">)</span>
</pre>
</div>

<p>
<b>Note:</b> As a Chinese user, I use the following mirrors instead. If you want to
use my emacs init file directly, you should change the value <code>yes</code> and <code>no</code>
after variable <code>:tangle</code> in the org file, then tangle the org file with
<code>org-babel</code> to use the official package source.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #78c5d6;">(</span><span style="color: #F0DFAF; font-weight: bold;">require</span> '<span style="color: #BFEBBF;">package</span><span style="color: #78c5d6;">)</span>
<span style="color: #78c5d6;">(</span><span style="color: #F0DFAF; font-weight: bold;">setq</span> package-archives
      '<span style="color: #bf62a6;">(</span><span style="color: #459ba8;">(</span><span style="color: #CC9393;">"gnu"</span>   . <span style="color: #CC9393;">"http://elpa.emacs-china.org/gnu/"</span><span style="color: #459ba8;">)</span>
        <span style="color: #459ba8;">(</span><span style="color: #CC9393;">"melpa"</span> . <span style="color: #CC9393;">"http://elpa.emacs-china.org/melpa/"</span><span style="color: #459ba8;">)</span>
        <span style="color: #459ba8;">(</span><span style="color: #CC9393;">"org"</span>   . <span style="color: #CC9393;">"http://elpa.emacs-china.org/org/"</span><span style="color: #459ba8;">)</span><span style="color: #bf62a6;">)</span><span style="color: #78c5d6;">)</span>

<span style="color: #78c5d6;">(</span>package-initialize<span style="color: #78c5d6;">)</span>
<span style="color: #78c5d6;">(</span><span style="color: #F0DFAF; font-weight: bold;">setq</span> package-enable-at-startup nil<span style="color: #78c5d6;">)</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-org1f3c6bd" class="outline-4">
<h4 id="org1f3c6bd"><span class="section-number-4">3.2.2</span> <code>Use-Package</code> - Package Configuration Macro</h4>
<div class="outline-text-4" id="text-3-2-2">
<p>
This <a href="https://github.com/jwiegley/use-package">use-package</a> macro provides more concise ways to setup package autoloads,
keybindings, and various mode configuration. The focus is on decreasing startup
time by <i>autoloading</i> packages instead loading them on startup.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #78c5d6;">(</span><span style="color: #F0DFAF; font-weight: bold;">unless</span> <span style="color: #bf62a6;">(</span>package-installed-p 'use-package<span style="color: #bf62a6;">)</span>
  <span style="color: #bf62a6;">(</span>package-refresh-contents<span style="color: #bf62a6;">)</span>
  <span style="color: #bf62a6;">(</span>package-install 'use-package<span style="color: #bf62a6;">)</span><span style="color: #78c5d6;">)</span>

<span style="color: #78c5d6;">(</span><span style="color: #F0DFAF; font-weight: bold;">setq</span> use-package-verbose t
      use-package-always-ensure t<span style="color: #78c5d6;">)</span>

<span style="color: #78c5d6;">(</span><span style="color: #F0DFAF; font-weight: bold;">eval-when-compile</span>
  <span style="color: #bf62a6;">(</span><span style="color: #F0DFAF; font-weight: bold;">require</span> '<span style="color: #BFEBBF;">use-package</span><span style="color: #bf62a6;">)</span><span style="color: #78c5d6;">)</span>

<span style="color: #5F7F5F;">;; </span><span style="color: #7F9F7F;">Please don't load outdated byte code</span>
<span style="color: #78c5d6;">(</span><span style="color: #F0DFAF; font-weight: bold;">setq</span> load-prefer-newer t<span style="color: #78c5d6;">)</span>
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-org7e1da8b" class="outline-3">
<h3 id="org7e1da8b"><span class="section-number-3">3.3</span> Library Dependency</h3>
<div class="outline-text-3" id="text-3-3">
<p>
Load up a collection of enhancements to Emacs Lisp, to make the configuration
and its dependencies work properly.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #78c5d6;">(</span><span style="color: #F0DFAF; font-weight: bold;">require</span> '<span style="color: #BFEBBF;">cl</span><span style="color: #78c5d6;">)</span>                           <span style="color: #5F7F5F;">; </span><span style="color: #7F9F7F;">provides useful things like `</span><span style="color: #BFEBBF;">loop</span><span style="color: #7F9F7F;">' and `</span><span style="color: #BFEBBF;">setf</span><span style="color: #7F9F7F;">'</span>
<span style="color: #78c5d6;">(</span><span style="color: #F0DFAF; font-weight: bold;">use-package</span> <span style="color: #BFEBBF;">dash</span> <span style="color: #DCDCCC; font-weight: bold;">:ensure</span> t<span style="color: #78c5d6;">)</span>            <span style="color: #5F7F5F;">; </span><span style="color: #7F9F7F;">a modern list library</span>
<span style="color: #78c5d6;">(</span><span style="color: #F0DFAF; font-weight: bold;">use-package</span> <span style="color: #BFEBBF;">diminish</span> <span style="color: #DCDCCC; font-weight: bold;">:ensure</span> t<span style="color: #78c5d6;">)</span>        <span style="color: #5F7F5F;">; </span><span style="color: #7F9F7F;">diminish keeps the modeline tidy</span>
</pre>
</div>

<p>
Benefiting from org-mode's contrib:
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #78c5d6;">(</span><span style="color: #F0DFAF; font-weight: bold;">use-package</span> <span style="color: #BFEBBF;">org</span>
  <span style="color: #DCDCCC; font-weight: bold;">:ensure</span> org-plus-contrib<span style="color: #78c5d6;">)</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-org8bd18a2" class="outline-3">
<h3 id="org8bd18a2"><span class="section-number-3">3.4</span> Environment fixup</h3>
<div class="outline-text-3" id="text-3-4">
<p>
On macOS, Emacs doesn't use the shell PATH if it's not started from the shell
(started from the GUI). <a href="https://github.com/purcell/exec-path-from-shell">Exec-path-from-shell</a> can fix this problem. It ensure
environment variables inside Emacs look the same as in the user's shell.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #78c5d6;">(</span><span style="color: #F0DFAF; font-weight: bold;">use-package</span> <span style="color: #BFEBBF;">exec-path-from-shell</span>
  <span style="color: #DCDCCC; font-weight: bold;">:defer</span> t
  <span style="color: #DCDCCC; font-weight: bold;">:init</span>
  <span style="color: #bf62a6;">(</span><span style="color: #F0DFAF; font-weight: bold;">progn</span>
    <span style="color: #459ba8;">(</span><span style="color: #F0DFAF; font-weight: bold;">when</span> <span style="color: #e868a2;">(</span>memq window-system '<span style="color: #79c267;">(</span>mac ns<span style="color: #79c267;">)</span><span style="color: #e868a2;">)</span>
      <span style="color: #e868a2;">(</span>exec-path-from-shell-initialize<span style="color: #e868a2;">)</span><span style="color: #459ba8;">)</span><span style="color: #bf62a6;">)</span><span style="color: #78c5d6;">)</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-orgc24e85d" class="outline-3">
<h3 id="orgc24e85d"><span class="section-number-3">3.5</span> Keyboard settings for macOS users</h3>
<div class="outline-text-3" id="text-3-5">
<p>
Set keys for Apple keyboard, for Emacs in macOS.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #78c5d6;">(</span><span style="color: #F0DFAF; font-weight: bold;">when</span> <span style="color: #bf62a6;">(</span>eq system-type 'darwin<span style="color: #bf62a6;">)</span>

  <span style="color: #bf62a6;">(</span><span style="color: #F0DFAF; font-weight: bold;">setq</span> mac-command-modifier 'meta<span style="color: #bf62a6;">)</span>     <span style="color: #5F7F5F;">; </span><span style="color: #7F9F7F;">make command key do Meta</span>
  <span style="color: #bf62a6;">(</span><span style="color: #F0DFAF; font-weight: bold;">setq</span> mac-option-modifier 'super<span style="color: #bf62a6;">)</span>     <span style="color: #5F7F5F;">; </span><span style="color: #7F9F7F;">make option key do Super</span>
  <span style="color: #bf62a6;">(</span><span style="color: #F0DFAF; font-weight: bold;">setq</span> mac-control-modifier 'control<span style="color: #bf62a6;">)</span>  <span style="color: #5F7F5F;">; </span><span style="color: #7F9F7F;">make control key do Control</span>
  <span style="color: #bf62a6;">(</span><span style="color: #F0DFAF; font-weight: bold;">setq</span> ns-function-modifier 'hyper<span style="color: #bf62a6;">)</span>    <span style="color: #5F7F5F;">; </span><span style="color: #7F9F7F;">make fn key do Hyper</span>
  <span style="color: #78c5d6;">)</span>
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-org42f6bca" class="outline-2">
<h2 id="org42f6bca"><span class="section-number-2">4</span> Basic settings used everywhere</h2>
<div class="outline-text-2" id="text-4">
</div>
<div id="outline-container-orgd6c5d0f" class="outline-3">
<h3 id="orgd6c5d0f"><span class="section-number-3">4.1</span> General user interface and appearance</h3>
<div class="outline-text-3" id="text-4-1">
</div>
