init.org
*** Startup screen and errors reporting

Turn off the startup messages when entering Emacs.

#+BEGIN_SRC emacs-lisp :tangle yes
  (setq inhibit-startup-screen t)         ; disable startup screen
#+END_SRC

No beep when reporting errors.

#+BEGIN_SRC emacs-lisp :tangle yes
  (setq ring-bell-function (lambda ()))   ; disable the annoying bell ring
#+END_SRC
*** Set frames title with buffer name

Use project and buffer name as frame title.

#+BEGIN_SRC emacs-lisp :tangle yes
  (setq frame-title-format
        (list "[" '(:eval (projectile-project-name)) "]"
              " ψωETωψ ◎ %b"))
#+END_SRC
*** Distinguish buffers with the same file name

Make two buffers with the same file name distinguishable. 

#+BEGIN_SRC emacs-lisp :tangle yes
  (require 'uniquify)
  (setq uniquify-buffer-name-style 'forward)
  (setq uniquify-separator "/")
  (setq uniquify-after-kill-buffer-p t)    ; rename after killing uniquified
  (setq uniquify-ignore-buffers-re "^\\*") ; don't muck with special buffers
#+END_SRC
*** Menu bar, tool bar, scroll bar. No!

Get rid of the menu bar, tool bar, and scroll bar. Useless!

#+BEGIN_SRC emacs-lisp :tangle yes
  (menu-bar-mode -1)
  (tool-bar-mode -1)
  (scroll-bar-mode -1)
#+END_SRC
*** Modeline settings

Show current line and cursor column position.

#+BEGIN_SRC emacs-lisp :tangle yes
  (line-number-mode 1)
  (column-number-mode 1)
#+END_SRC

Indicate current file size.

#+BEGIN_SRC emacs-lisp :tangle yes
  (size-indication-mode t)
#+END_SRC

Display the time.

#+BEGIN_SRC emacs-lisp :tangle yes
  (display-time-mode 1)
#+END_SRC
*** Put empty line markers into the left hand side

Put empty line markers into the left hand side to see when a file actually
ends.

#+BEGIN_SRC emacs-lisp :tangle yes
  (setq-default indicate-empty-lines t)
  (when (not indicate-empty-lines)
    (toggle-indicate-empty-lines))
#+END_SRC
*** Display Line Numbers

According to [[http://ergoemacs.org/emacs/emacs_line_number_mode.html][this article]], Emacs now has two line numbers mode: =linum-mode=
and =display-line-numbers-mode= (Emacs 26). Use the new one :)

#+BEGIN_SRC emacs-lisp :tangle yes
  (global-display-line-numbers-mode)
#+END_SRC

With the =display-line-numbers-mode= turned on, we can use =M-g g=
(=goto-line=) to go to the desired line quickly.

*** Cursor and mouse

The blinking cursor is nothing, but an annoyance.

#+BEGIN_SRC emacs-lisp :tangle yes
  (blink-cursor-mode -1)                  ; No blinking cursor
#+END_SRC

Hide the mouse while typing.

#+BEGIN_SRC emacs-lisp :tangle yes
  (setq make-pointer-invisible t)         ; Hide the mouse while typing
#+END_SRC
*** Sweet highlight

Hightlight something sweet.

#+BEGIN_SRC emacs-lisp :tangle yes
  (global-font-lock-mode 1)               ; Syntax highlight
  (global-hl-line-mode 1)                 ; Highlight cursor line
#+END_SRC

=Show-paren-mode= highlights the matching parenthesis on point.

#+BEGIN_SRC emacs-lisp :tangle yes
  (show-paren-mode 1)                      ; Highlight parenthesis pairs
  (setq show-paren-delay 0)                ; No delay
  (setq blink-matching-paren-distance nil) ; Blinking parenthesis
  (setq show-paren-style 'expression)      ; Highlight text between parenthesis
#+END_SRC

=Volatile-highlights= highlight things like undo, copy, paste, etc.

#+BEGIN_SRC emacs-lisp :tangle yes
  (use-package volatile-highlights
    :diminish ""
    :init (volatile-highlights-mode))
#+END_SRC

=Hl-todo= highlight annotations like /TODO/ in source code.

#+BEGIN_SRC emacs-lisp :tangle yes
  (use-package hl-todo
    :diminish ""
    :init (global-hl-todo-mode))
#+END_SRC
*** Nice scrolling

Scroll the screen in a better way.

#+BEGIN_SRC emacs-lisp :tangle yes
  (setq scroll-margin 0
        scroll-conservatively 100000
        scroll-preserve-screen-position 1)
#+END_SRC
