init.html
<div id="outline-container-org2bc15ec" class="outline-4">
<h4 id="org2bc15ec"><span class="section-number-4">4.1.1</span> Startup screen and errors reporting</h4>
<div class="outline-text-4" id="text-4-1-1">
<p>
Turn off the startup messages when entering Emacs.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #78c5d6;">(</span><span style="color: #F0DFAF; font-weight: bold;">setq</span> inhibit-startup-screen t<span style="color: #78c5d6;">)</span>         <span style="color: #5F7F5F;">; </span><span style="color: #7F9F7F;">disable startup screen</span>
</pre>
</div>

<p>
No beep when reporting errors.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #78c5d6;">(</span><span style="color: #F0DFAF; font-weight: bold;">setq</span> ring-bell-function <span style="color: #bf62a6;">(</span><span style="color: #F0DFAF; font-weight: bold;">lambda</span> <span style="color: #459ba8;">()</span><span style="color: #bf62a6;">)</span><span style="color: #78c5d6;">)</span>   <span style="color: #5F7F5F;">; </span><span style="color: #7F9F7F;">disable the annoying bell ring</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-org2d3134e" class="outline-4">
<h4 id="org2d3134e"><span class="section-number-4">4.1.2</span> Set frames title with buffer name</h4>
<div class="outline-text-4" id="text-4-1-2">
<p>
Use project and buffer name as frame title.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #78c5d6;">(</span><span style="color: #F0DFAF; font-weight: bold;">setq</span> frame-title-format
      <span style="color: #bf62a6;">(</span>list <span style="color: #CC9393;">"["</span> '<span style="color: #459ba8;">(</span><span style="color: #DCDCCC; font-weight: bold;">:eval</span> <span style="color: #e868a2;">(</span>projectile-project-name<span style="color: #e868a2;">)</span><span style="color: #459ba8;">)</span> <span style="color: #CC9393;">"]"</span>
            <span style="color: #CC9393;">" &#968;&#969;ET&#969;&#968; &#9678; %b"</span><span style="color: #bf62a6;">)</span><span style="color: #78c5d6;">)</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-org7f4fcf3" class="outline-4">
<h4 id="org7f4fcf3"><span class="section-number-4">4.1.3</span> Distinguish buffers with the same file name</h4>
<div class="outline-text-4" id="text-4-1-3">
<p>
Make two buffers with the same file name distinguishable. 
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #78c5d6;">(</span><span style="color: #F0DFAF; font-weight: bold;">require</span> '<span style="color: #BFEBBF;">uniquify</span><span style="color: #78c5d6;">)</span>
<span style="color: #78c5d6;">(</span><span style="color: #F0DFAF; font-weight: bold;">setq</span> uniquify-buffer-name-style 'forward<span style="color: #78c5d6;">)</span>
<span style="color: #78c5d6;">(</span><span style="color: #F0DFAF; font-weight: bold;">setq</span> uniquify-separator <span style="color: #CC9393;">"/"</span><span style="color: #78c5d6;">)</span>
<span style="color: #78c5d6;">(</span><span style="color: #F0DFAF; font-weight: bold;">setq</span> uniquify-after-kill-buffer-p t<span style="color: #78c5d6;">)</span>    <span style="color: #5F7F5F;">; </span><span style="color: #7F9F7F;">rename after killing uniquified</span>
<span style="color: #78c5d6;">(</span><span style="color: #F0DFAF; font-weight: bold;">setq</span> uniquify-ignore-buffers-re <span style="color: #CC9393;">"^\\*"</span><span style="color: #78c5d6;">)</span> <span style="color: #5F7F5F;">; </span><span style="color: #7F9F7F;">don't muck with special buffers</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-orge04d36c" class="outline-4">
<h4 id="orge04d36c"><span class="section-number-4">4.1.4</span> Menu bar, tool bar, scroll bar. No!</h4>
<div class="outline-text-4" id="text-4-1-4">
<p>
Get rid of the menu bar, tool bar, and scroll bar. Useless!
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #78c5d6;">(</span>menu-bar-mode -1<span style="color: #78c5d6;">)</span>
<span style="color: #78c5d6;">(</span>tool-bar-mode -1<span style="color: #78c5d6;">)</span>
<span style="color: #78c5d6;">(</span>scroll-bar-mode -1<span style="color: #78c5d6;">)</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-orgb6fcc0a" class="outline-4">
<h4 id="orgb6fcc0a"><span class="section-number-4">4.1.5</span> Modeline settings</h4>
<div class="outline-text-4" id="text-4-1-5">
<p>
Show current line and cursor column position.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #78c5d6;">(</span>line-number-mode 1<span style="color: #78c5d6;">)</span>
<span style="color: #78c5d6;">(</span>column-number-mode 1<span style="color: #78c5d6;">)</span>
</pre>
</div>

<p>
Indicate current file size.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #78c5d6;">(</span>size-indication-mode t<span style="color: #78c5d6;">)</span>
</pre>
</div>

<p>
Display the time.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #78c5d6;">(</span>display-time-mode 1<span style="color: #78c5d6;">)</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-org1172639" class="outline-4">
<h4 id="org1172639"><span class="section-number-4">4.1.6</span> Put empty line markers into the left hand side</h4>
<div class="outline-text-4" id="text-4-1-6">
<p>
Put empty line markers into the left hand side to see when a file actually
ends.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #78c5d6;">(</span><span style="color: #F0DFAF; font-weight: bold;">setq-default</span> indicate-empty-lines t<span style="color: #78c5d6;">)</span>
<span style="color: #78c5d6;">(</span><span style="color: #F0DFAF; font-weight: bold;">when</span> <span style="color: #bf62a6;">(</span>not indicate-empty-lines<span style="color: #bf62a6;">)</span>
  <span style="color: #bf62a6;">(</span>toggle-indicate-empty-lines<span style="color: #bf62a6;">)</span><span style="color: #78c5d6;">)</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-org1878779" class="outline-4">
<h4 id="org1878779"><span class="section-number-4">4.1.7</span> Display Line Numbers</h4>
<div class="outline-text-4" id="text-4-1-7">
<p>
According to <a href="http://ergoemacs.org/emacs/emacs_line_number_mode.html">this article</a>, Emacs now has two line numbers mode: <code>linum-mode</code>
and <code>display-line-numbers-mode</code> (Emacs 26). Use the new one :)
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #78c5d6;">(</span>global-display-line-numbers-mode<span style="color: #78c5d6;">)</span>
</pre>
</div>

<p>
With the <code>display-line-numbers-mode</code> turned on, we can use <code>M-g g</code>
(<code>goto-line</code>) to go to the desired line quickly.
</p>
</div>
</div>

<div id="outline-container-orgb4dd24c" class="outline-4">
<h4 id="orgb4dd24c"><span class="section-number-4">4.1.8</span> Cursor and mouse</h4>
<div class="outline-text-4" id="text-4-1-8">
<p>
The blinking cursor is nothing, but an annoyance.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #78c5d6;">(</span>blink-cursor-mode -1<span style="color: #78c5d6;">)</span>                  <span style="color: #5F7F5F;">; </span><span style="color: #7F9F7F;">No blinking cursor</span>
</pre>
</div>

<p>
Hide the mouse while typing.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #78c5d6;">(</span><span style="color: #F0DFAF; font-weight: bold;">setq</span> make-pointer-invisible t<span style="color: #78c5d6;">)</span>         <span style="color: #5F7F5F;">; </span><span style="color: #7F9F7F;">Hide the mouse while typing</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-orgd6d495d" class="outline-4">
<h4 id="orgd6d495d"><span class="section-number-4">4.1.9</span> Sweet highlight</h4>
<div class="outline-text-4" id="text-4-1-9">
<p>
Hightlight something sweet.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #78c5d6;">(</span>global-font-lock-mode 1<span style="color: #78c5d6;">)</span>               <span style="color: #5F7F5F;">; </span><span style="color: #7F9F7F;">Syntax highlight</span>
<span style="color: #78c5d6;">(</span>global-hl-line-mode 1<span style="color: #78c5d6;">)</span>                 <span style="color: #5F7F5F;">; </span><span style="color: #7F9F7F;">Highlight cursor line</span>
</pre>
</div>

<p>
<code>Show-paren-mode</code> highlights the matching parenthesis on point.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #78c5d6;">(</span>show-paren-mode 1<span style="color: #78c5d6;">)</span>                      <span style="color: #5F7F5F;">; </span><span style="color: #7F9F7F;">Highlight parenthesis pairs</span>
<span style="color: #78c5d6;">(</span><span style="color: #F0DFAF; font-weight: bold;">setq</span> show-paren-delay 0<span style="color: #78c5d6;">)</span>                <span style="color: #5F7F5F;">; </span><span style="color: #7F9F7F;">No delay</span>
<span style="color: #78c5d6;">(</span><span style="color: #F0DFAF; font-weight: bold;">setq</span> blink-matching-paren-distance nil<span style="color: #78c5d6;">)</span> <span style="color: #5F7F5F;">; </span><span style="color: #7F9F7F;">Blinking parenthesis</span>
<span style="color: #78c5d6;">(</span><span style="color: #F0DFAF; font-weight: bold;">setq</span> show-paren-style 'expression<span style="color: #78c5d6;">)</span>      <span style="color: #5F7F5F;">; </span><span style="color: #7F9F7F;">Highlight text between parenthesis</span>
</pre>
</div>

<p>
<code>Volatile-highlights</code> highlight things like undo, copy, paste, etc.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #78c5d6;">(</span><span style="color: #F0DFAF; font-weight: bold;">use-package</span> <span style="color: #BFEBBF;">volatile-highlights</span>
  <span style="color: #DCDCCC; font-weight: bold;">:diminish</span> <span style="color: #CC9393;">""</span>
  <span style="color: #DCDCCC; font-weight: bold;">:init</span> <span style="color: #bf62a6;">(</span>volatile-highlights-mode<span style="color: #bf62a6;">)</span><span style="color: #78c5d6;">)</span>
</pre>
</div>

<p>
<code>Hl-todo</code> highlight annotations like <i>TODO</i> in source code.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #78c5d6;">(</span><span style="color: #F0DFAF; font-weight: bold;">use-package</span> <span style="color: #BFEBBF;">hl-todo</span>
  <span style="color: #DCDCCC; font-weight: bold;">:diminish</span> <span style="color: #CC9393;">""</span>
  <span style="color: #DCDCCC; font-weight: bold;">:init</span> <span style="color: #bf62a6;">(</span>global-hl-todo-mode<span style="color: #bf62a6;">)</span><span style="color: #78c5d6;">)</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-org14da4d0" class="outline-4">
<h4 id="org14da4d0"><span class="section-number-4">4.1.10</span> Nice scrolling</h4>
<div class="outline-text-4" id="text-4-1-10">
<p>
Scroll the screen in a better way.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #78c5d6;">(</span><span style="color: #F0DFAF; font-weight: bold;">setq</span> scroll-margin 0
      scroll-conservatively 100000
      scroll-preserve-screen-position 1<span style="color: #78c5d6;">)</span>
</pre>
</div>
</div>
</div>
