init.org
*** No =#autosave#= and =backup~= files

Stop creating =backup~= files and =#autosave#= files.

#+BEGIN_SRC emacs-lisp :tangle yes
  (setq auto-save-default nil)            ; No #autosave# files
  (setq make-backup-files nil)            ; No backup~ files
#+END_SRC

Emacs backup is so annoying. This will completely stop Emacs from creating
temoporary symbolic link files (lock file) named =#.something=:

#+BEGIN_SRC emacs-lisp :tangle no
  (setq create-lockfiles nil)             ; No #.something symbolic link files
#+END_SRC

*Warning:* Disable lock file may be a problem if you have situations where a
file is being edited by different people or instances of Emacs. (So I didn't
disable it.)

*** Change "yes or no" to "y or n"

#+BEGIN_SRC emacs-lisp :tangle yes
  (defalias 'yes-or-no-p 'y-or-n-p)       ; y/n instead of yes/no
#+END_SRC
*** Confirm before quit

Confirmation is required before exiting Emacs.

#+BEGIN_SRC emacs-lisp :tangle yes
  (setq confirm-kill-emacs 'yes-or-no-p)
#+END_SRC
** Commands - useful interactive functions
*** Reload emacs initialization file

Here are the commands I used frequently when I writing this Emacs configuration
in =org-mode=:

#+BEGIN_SRC emacs-lisp :tangle yes
  (defun my/reload-emacs-init-el-file ()
    (interactive)
    (load-file (expand-file-name "init.el" user-emacs-directory)))
#+END_SRC

#+BEGIN_SRC emacs-lisp :tangle yes
  (defun my/reload-emacs-init-org-file ()
    (interactive)
    (org-babel-load-file (expand-file-name "init.org" user-emacs-directory)))
#+END_SRC
*** macOS swap Meta and Super

Swap the mapping of =Meta= and =Super= if necessary ([[https://github.com/bbatsov/prelude/blob/master/core/prelude-macos.el][taken form Prelude
project]]):

#+BEGIN_SRC emacs-lisp :tangle yes
  (defun prelude-swap-meta-and-super ()
    "Swap the mapping of Meta and Super.
  Very useful for people using their Mac with a
  Windows external keyboard from time to time."
    (interactive)
    (if (eq mac-command-modifier 'super)
        (progn
          (setq mac-command-modifier 'meta)
          (setq mac-option-modifier 'super)
          (message "Command is now bound to META and Option is bound to SUPER."))
      (setq mac-command-modifier 'super)
      (setq mac-option-modifier 'meta)
      (message "Command is now bound to SUPER and Option is bound to META.")))
#+END_SRC
*** Copy filename to clipboard

Sometimes I need to copy the name of the currently visited file to the
clipboard. Emacs does not have a built-in command for that, but [[https://emacsredux.com/blog/2013/03/27/copy-filename-to-the-clipboard/][cooking one]] is
pretty straightforward:

#+BEGIN_SRC emacs-lisp :tangle yes
  (defun copy-file-name-to-clipboard ()
    "Copy the current buffer file name to the clipboard."
    (interactive)
    (let ((filename (if (equal major-mode 'dired-mode)
                        default-directory
                      (buffer-file-name))))
      (when filename
        (kill-new filename)
        (message "Copied buffer file name '%s' to the clipboard." filename))))
#+END_SRC
