init.html
<div id="outline-container-orgb5d969d" class="outline-4">
<h4 id="orgb5d969d"><span class="section-number-4">4.1.11</span> No <code>#autosave#</code> and <code>backup~</code> files</h4>
<div class="outline-text-4" id="text-4-1-11">
<p>
Stop creating <code>backup~</code> files and <code>#autosave#</code> files.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #78c5d6;">(</span><span style="color: #F0DFAF; font-weight: bold;">setq</span> auto-save-default nil<span style="color: #78c5d6;">)</span>            <span style="color: #5F7F5F;">; </span><span style="color: #7F9F7F;">No #autosave# files</span>
<span style="color: #78c5d6;">(</span><span style="color: #F0DFAF; font-weight: bold;">setq</span> make-backup-files nil<span style="color: #78c5d6;">)</span>            <span style="color: #5F7F5F;">; </span><span style="color: #7F9F7F;">No backup~ files</span>
</pre>
</div>

<p>
Emacs backup is so annoying. This will completely stop Emacs from creating
temoporary symbolic link files (lock file) named <code>#.something</code>:
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #78c5d6;">(</span><span style="color: #F0DFAF; font-weight: bold;">setq</span> create-lockfiles nil<span style="color: #78c5d6;">)</span>             <span style="color: #5F7F5F;">; </span><span style="color: #7F9F7F;">No #.something symbolic link files</span>
</pre>
</div>

<p>
<b>Warning:</b> Disable lock file may be a problem if you have situations where a
file is being edited by different people or instances of Emacs. (So I didn't
disable it.)
</p>
</div>
</div>

<div id="outline-container-org3507206" class="outline-4">
<h4 id="org3507206"><span class="section-number-4">4.1.12</span> Change "yes or no" to "y or n"</h4>
<div class="outline-text-4" id="text-4-1-12">
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #78c5d6;">(</span><span style="color: #F0DFAF; font-weight: bold;">defalias</span> '<span style="color: #93E0E3;">yes-or-no-p</span> 'y-or-n-p<span style="color: #78c5d6;">)</span>       <span style="color: #5F7F5F;">; </span><span style="color: #7F9F7F;">y/n instead of yes/no</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-org9dbac5d" class="outline-4">
<h4 id="org9dbac5d"><span class="section-number-4">4.1.13</span> Confirm before quit</h4>
<div class="outline-text-4" id="text-4-1-13">
<p>
Confirmation is required before exiting Emacs.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #78c5d6;">(</span><span style="color: #F0DFAF; font-weight: bold;">setq</span> confirm-kill-emacs 'yes-or-no-p<span style="color: #78c5d6;">)</span>
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-orgab416a9" class="outline-3">
<h3 id="orgab416a9"><span class="section-number-3">4.2</span> Commands - useful interactive functions</h3>
<div class="outline-text-3" id="text-4-2">
</div>
<div id="outline-container-org1fe34dd" class="outline-4">
<h4 id="org1fe34dd"><span class="section-number-4">4.2.1</span> Reload emacs initialization file</h4>
<div class="outline-text-4" id="text-4-2-1">
<p>
Here are the commands I used frequently when I writing this Emacs configuration
in <code>org-mode</code>:
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #78c5d6;">(</span><span style="color: #F0DFAF; font-weight: bold;">defun</span> <span style="color: #93E0E3;">my/reload-emacs-init-el-file</span> <span style="color: #bf62a6;">()</span>
  <span style="color: #bf62a6;">(</span><span style="color: #F0DFAF; font-weight: bold;">interactive</span><span style="color: #bf62a6;">)</span>
  <span style="color: #bf62a6;">(</span>load-file <span style="color: #459ba8;">(</span>expand-file-name <span style="color: #CC9393;">"init.el"</span> user-emacs-directory<span style="color: #459ba8;">)</span><span style="color: #bf62a6;">)</span><span style="color: #78c5d6;">)</span>
</pre>
</div>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #78c5d6;">(</span><span style="color: #F0DFAF; font-weight: bold;">defun</span> <span style="color: #93E0E3;">my/reload-emacs-init-org-file</span> <span style="color: #bf62a6;">()</span>
  <span style="color: #bf62a6;">(</span><span style="color: #F0DFAF; font-weight: bold;">interactive</span><span style="color: #bf62a6;">)</span>
  <span style="color: #bf62a6;">(</span>org-babel-load-file <span style="color: #459ba8;">(</span>expand-file-name <span style="color: #CC9393;">"init.org"</span> user-emacs-directory<span style="color: #459ba8;">)</span><span style="color: #bf62a6;">)</span><span style="color: #78c5d6;">)</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-org9805775" class="outline-4">
<h4 id="org9805775"><span class="section-number-4">4.2.2</span> macOS swap Meta and Super</h4>
<div class="outline-text-4" id="text-4-2-2">
<p>
Swap the mapping of <code>Meta</code> and <code>Super</code> if necessary (<a href="https://github.com/bbatsov/prelude/blob/master/core/prelude-macos.el">taken form Prelude
project</a>):
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #78c5d6;">(</span><span style="color: #F0DFAF; font-weight: bold;">defun</span> <span style="color: #93E0E3;">prelude-swap-meta-and-super</span> <span style="color: #bf62a6;">()</span>
  <span style="color: #9FC59F;">"Swap the mapping of Meta and Super.</span>
<span style="color: #9FC59F;">Very useful for people using their Mac with a</span>
<span style="color: #9FC59F;">Windows external keyboard from time to time."</span>
  <span style="color: #bf62a6;">(</span><span style="color: #F0DFAF; font-weight: bold;">interactive</span><span style="color: #bf62a6;">)</span>
  <span style="color: #bf62a6;">(</span><span style="color: #F0DFAF; font-weight: bold;">if</span> <span style="color: #459ba8;">(</span>eq mac-command-modifier 'super<span style="color: #459ba8;">)</span>
      <span style="color: #459ba8;">(</span><span style="color: #F0DFAF; font-weight: bold;">progn</span>
        <span style="color: #e868a2;">(</span><span style="color: #F0DFAF; font-weight: bold;">setq</span> mac-command-modifier 'meta<span style="color: #e868a2;">)</span>
        <span style="color: #e868a2;">(</span><span style="color: #F0DFAF; font-weight: bold;">setq</span> mac-option-modifier 'super<span style="color: #e868a2;">)</span>
        <span style="color: #e868a2;">(</span>message <span style="color: #CC9393;">"Command is now bound to META and Option is bound to SUPER."</span><span style="color: #e868a2;">)</span><span style="color: #459ba8;">)</span>
    <span style="color: #459ba8;">(</span><span style="color: #F0DFAF; font-weight: bold;">setq</span> mac-command-modifier 'super<span style="color: #459ba8;">)</span>
    <span style="color: #459ba8;">(</span><span style="color: #F0DFAF; font-weight: bold;">setq</span> mac-option-modifier 'meta<span style="color: #459ba8;">)</span>
    <span style="color: #459ba8;">(</span>message <span style="color: #CC9393;">"Command is now bound to SUPER and Option is bound to META."</span><span style="color: #459ba8;">)</span><span style="color: #bf62a6;">)</span><span style="color: #78c5d6;">)</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-orge0bc6b6" class="outline-4">
<h4 id="orge0bc6b6"><span class="section-number-4">4.2.3</span> Copy filename to clipboard</h4>
<div class="outline-text-4" id="text-4-2-3">
<p>
Sometimes I need to copy the name of the currently visited file to the
clipboard. Emacs does not have a built-in command for that, but <a href="https://emacsredux.com/blog/2013/03/27/copy-filename-to-the-clipboard/">cooking one</a> is
pretty straightforward:
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #78c5d6;">(</span><span style="color: #F0DFAF; font-weight: bold;">defun</span> <span style="color: #93E0E3;">copy-file-name-to-clipboard</span> <span style="color: #bf62a6;">()</span>
  <span style="color: #9FC59F;">"Copy the current buffer file name to the clipboard."</span>
  <span style="color: #bf62a6;">(</span><span style="color: #F0DFAF; font-weight: bold;">interactive</span><span style="color: #bf62a6;">)</span>
  <span style="color: #bf62a6;">(</span><span style="color: #F0DFAF; font-weight: bold;">let</span> <span style="color: #459ba8;">(</span><span style="color: #e868a2;">(</span>filename <span style="color: #79c267;">(</span><span style="color: #F0DFAF; font-weight: bold;">if</span> <span style="color: #f28c33;">(</span>equal major-mode 'dired-mode<span style="color: #f28c33;">)</span>
                      default-directory
                    <span style="color: #f28c33;">(</span>buffer-file-name<span style="color: #f28c33;">)</span><span style="color: #79c267;">)</span><span style="color: #e868a2;">)</span><span style="color: #459ba8;">)</span>
    <span style="color: #459ba8;">(</span><span style="color: #F0DFAF; font-weight: bold;">when</span> filename
      <span style="color: #e868a2;">(</span>kill-new filename<span style="color: #e868a2;">)</span>
      <span style="color: #e868a2;">(</span>message <span style="color: #CC9393;">"Copied buffer file name '%s' to the clipboard."</span> filename<span style="color: #e868a2;">)</span><span style="color: #459ba8;">)</span><span style="color: #bf62a6;">)</span><span style="color: #78c5d6;">)</span>
</pre>
</div>
</div>
</div>
