init.org
*** Open File in external app

Here's a command to [[http://ergoemacs.org/emacs/emacs_dired_open_file_in_ext_apps.html][open the current file or marked dired files in external
app]]. (as if you double-clicked the file on desktop) It's useful for image
files, PDF file, video, audio files.

#+BEGIN_SRC emacs-lisp :tangle yes
  (defun xah-open-in-external-app (&optional @fname)
    "Open the current file or dired marked files in external app.
  The app is chosen from your OS's preference.

  When called in emacs lisp, if @fname is given, open that.

  URL `http://ergoemacs.org/emacs/emacs_dired_open_file_in_ext_apps.html'
  Version 2019-01-18"
    (interactive)
    (let* (
           ($file-list
            (if @fname
                (progn (list @fname))
              (if (string-equal major-mode "dired-mode")
                  (dired-get-marked-files)
                (list (buffer-file-name)))))
           ($do-it-p (if (<= (length $file-list) 5)
                         t
                       (y-or-n-p "Open more than 5 files? "))))
      (when $do-it-p
        (cond
         ((string-equal system-type "windows-nt")
          (mapc
           (lambda ($fpath)
             (w32-shell-execute "open" (replace-regexp-in-string "/" "\\" $fpath t t))) $file-list))
         ((string-equal system-type "darwin")
          (mapc
           (lambda ($fpath)
             (shell-command
              (concat "open " (shell-quote-argument $fpath))))  $file-list))
         ((string-equal system-type "gnu/linux")
          (mapc
           (lambda ($fpath) (let ((process-connection-type nil))
                              (start-process "" nil "xdg-open" $fpath))) $file-list))))))
#+END_SRC
** Navigation
*** =Projectile= - project interaction

The [[https://github.com/bbatsov/projectile][Projectile]] project is a nifty way to run commands and search for files in a
particular "project". All projectile keybindings is placed under =C-x p=. And,
the most used commands by myself are =C-x p p= to switch-project, and =C-x p f=
to find a file and =C-x p d= to find a directory.

#+BEGIN_SRC emacs-lisp :tangle yes
  (use-package projectile
    :ensure t
    :diminish projectile-mode
    :init (projectile-global-mode)
    ;; caching can speedup file and directory listings
    ;;(setq projectile-enable-caching t)
    ;; projectile cache file location
    (setq projectile-cache-file (expand-file-name  "projectile.cache" user-emacs-savefile-dir))
    :commands projectile-ag
    :config
    (define-key projectile-mode-map (kbd "s-p") 'projectile-command-map)
    (define-key projectile-mode-map (kbd "C-x p") 'projectile-command-map)

    (setq projectile-completion-system 'helm ; `ido' or `helm' interface?
          projectile-switch-project-action 'projectile-commander
          projectile-create-missing-test-files t)
    (add-to-list 'projectile-globally-ignored-files ".DS_Store")

    (def-projectile-commander-method ?d
      "Open project root in dired."
      (projectile-dired))

    (def-projectile-commander-method ?s
      "Open a *shell* buffer for the project."
      (projectile-run-shell))

    (def-projectile-commander-method ?c
      "Run `compile' in the project."
      (projectile-compile-project nil))

    (def-projectile-commander-method ?F
      "Git fetch."
      (magit-status)
      (call-interactively #'magit-fetch-current)))
#+END_SRC

Much of the section came from [[http://endlessparentheses.com/improving-projectile-with-extra-commands.html][this essay]]. Read it for config details and usage.

