init.html
<div id="outline-container-org2363f2e" class="outline-4">
<h4 id="org2363f2e"><span class="section-number-4">4.2.4</span> Open File in external app</h4>
<div class="outline-text-4" id="text-4-2-4">
<p>
Here's a command to <a href="http://ergoemacs.org/emacs/emacs_dired_open_file_in_ext_apps.html">open the current file or marked dired files in external
app</a>. (as if you double-clicked the file on desktop) It's useful for image
files, PDF file, video, audio files.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #78c5d6;">(</span><span style="color: #F0DFAF; font-weight: bold;">defun</span> <span style="color: #93E0E3;">xah-open-in-external-app</span> <span style="color: #bf62a6;">(</span><span style="color: #7CB8BB;">&amp;optional</span> @fname<span style="color: #bf62a6;">)</span>
  <span style="color: #9FC59F;">"Open the current file or dired marked files in external app.</span>
<span style="color: #9FC59F;">The app is chosen from your OS's preference.</span>

<span style="color: #9FC59F;">When called in emacs lisp, if @fname is given, open that.</span>

<span style="color: #9FC59F;">URL `</span><span style="color: #BFEBBF;">http://ergoemacs.org/emacs/emacs_dired_open_file_in_ext_apps.html</span><span style="color: #9FC59F;">'</span>
<span style="color: #9FC59F;">Version 2019-01-18"</span>
  <span style="color: #bf62a6;">(</span><span style="color: #F0DFAF; font-weight: bold;">interactive</span><span style="color: #bf62a6;">)</span>
  <span style="color: #bf62a6;">(</span><span style="color: #F0DFAF; font-weight: bold;">let*</span> <span style="color: #459ba8;">(</span>
         <span style="color: #e868a2;">(</span>$file-list
          <span style="color: #79c267;">(</span><span style="color: #F0DFAF; font-weight: bold;">if</span> @fname
              <span style="color: #f28c33;">(</span><span style="color: #F0DFAF; font-weight: bold;">progn</span> <span style="color: #c5d647;">(</span>list @fname<span style="color: #c5d647;">)</span><span style="color: #f28c33;">)</span>
            <span style="color: #f28c33;">(</span><span style="color: #F0DFAF; font-weight: bold;">if</span> <span style="color: #c5d647;">(</span>string-equal major-mode <span style="color: #CC9393;">"dired-mode"</span><span style="color: #c5d647;">)</span>
                <span style="color: #c5d647;">(</span>dired-get-marked-files<span style="color: #c5d647;">)</span>
              <span style="color: #c5d647;">(</span>list <span style="color: #f5d63d;">(</span>buffer-file-name<span style="color: #f5d63d;">)</span><span style="color: #c5d647;">)</span><span style="color: #f28c33;">)</span><span style="color: #79c267;">)</span><span style="color: #e868a2;">)</span>
         <span style="color: #e868a2;">(</span>$do-it-p <span style="color: #79c267;">(</span><span style="color: #F0DFAF; font-weight: bold;">if</span> <span style="color: #f28c33;">(</span>&lt;= <span style="color: #c5d647;">(</span>length $file-list<span style="color: #c5d647;">)</span> 5<span style="color: #f28c33;">)</span>
                       t
                     <span style="color: #f28c33;">(</span>y-or-n-p <span style="color: #CC9393;">"Open more than 5 files? "</span><span style="color: #f28c33;">)</span><span style="color: #79c267;">)</span><span style="color: #e868a2;">)</span><span style="color: #459ba8;">)</span>
    <span style="color: #459ba8;">(</span><span style="color: #F0DFAF; font-weight: bold;">when</span> $do-it-p
      <span style="color: #e868a2;">(</span><span style="color: #F0DFAF; font-weight: bold;">cond</span>
       <span style="color: #79c267;">(</span><span style="color: #f28c33;">(</span>string-equal system-type <span style="color: #CC9393;">"windows-nt"</span><span style="color: #f28c33;">)</span>
        <span style="color: #f28c33;">(</span>mapc
         <span style="color: #c5d647;">(</span><span style="color: #F0DFAF; font-weight: bold;">lambda</span> <span style="color: #f5d63d;">(</span>$fpath<span style="color: #f5d63d;">)</span>
           <span style="color: #f5d63d;">(</span>w32-shell-execute <span style="color: #CC9393;">"open"</span> <span style="color: #78c5d6;">(</span>replace-regexp-in-string <span style="color: #CC9393;">"/"</span> <span style="color: #CC9393;">"\\"</span> $fpath t t<span style="color: #78c5d6;">)</span><span style="color: #f5d63d;">)</span><span style="color: #c5d647;">)</span> <span style="color: #D0BF8F; font-weight: bold;">$file-list</span><span style="color: #f28c33; font-weight: bold;">)</span><span style="color: #79c267; font-weight: bold;">)</span>
       <span style="color: #79c267;">(</span><span style="color: #f28c33;">(</span>string-equal system-type <span style="color: #CC9393;">"darwin"</span><span style="color: #f28c33;">)</span>
        <span style="color: #f28c33;">(</span>mapc
         <span style="color: #c5d647;">(</span><span style="color: #F0DFAF; font-weight: bold;">lambda</span> <span style="color: #f5d63d;">(</span>$fpath<span style="color: #f5d63d;">)</span>
           <span style="color: #f5d63d;">(</span>shell-command
            <span style="color: #78c5d6;">(</span>concat <span style="color: #CC9393;">"open "</span> <span style="color: #78c5d6;">(</span>shell-quote-argument $fpath<span style="color: #78c5d6;">)</span><span style="color: #78c5d6;">)</span><span style="color: #f5d63d;">)</span><span style="color: #c5d647;">)</span>  <span style="color: #D0BF8F; font-weight: bold;">$file-list</span><span style="color: #f28c33; font-weight: bold;">)</span><span style="color: #79c267; font-weight: bold;">)</span>
       <span style="color: #79c267;">(</span><span style="color: #f28c33;">(</span>string-equal system-type <span style="color: #CC9393;">"gnu/linux"</span><span style="color: #f28c33;">)</span>
        <span style="color: #f28c33;">(</span>mapc
         <span style="color: #c5d647;">(</span><span style="color: #F0DFAF; font-weight: bold;">lambda</span> <span style="color: #f5d63d;">(</span>$fpath<span style="color: #f5d63d;">)</span> <span style="color: #f5d63d;">(</span><span style="color: #F0DFAF; font-weight: bold;">let</span> <span style="color: #78c5d6;">(</span><span style="color: #78c5d6;">(</span>process-connection-type nil<span style="color: #78c5d6;">)</span><span style="color: #78c5d6;">)</span>
                            <span style="color: #78c5d6;">(</span>start-process <span style="color: #CC9393;">""</span> nil <span style="color: #CC9393;">"xdg-open"</span> $fpath<span style="color: #78c5d6;">)</span><span style="color: #f5d63d;">)</span><span style="color: #c5d647;">)</span> <span style="color: #D0BF8F; font-weight: bold;">$file-list</span><span style="color: #f28c33; font-weight: bold;">)</span><span style="color: #79c267; font-weight: bold;">)</span><span style="color: #e868a2; font-weight: bold;">)</span><span style="color: #459ba8; font-weight: bold;">)</span><span style="color: #bf62a6; font-weight: bold;">)</span><span style="color: #78c5d6; font-weight: bold;">)</span>
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-org245dd46" class="outline-3">
<h3 id="org245dd46"><span class="section-number-3">4.3</span> Navigation</h3>
<div class="outline-text-3" id="text-4-3">
</div>
<div id="outline-container-orgdb07faa" class="outline-4">
<h4 id="orgdb07faa"><span class="section-number-4">4.3.1</span> <code>Projectile</code> - project interaction</h4>
<div class="outline-text-4" id="text-4-3-1">
<p>
The <a href="https://github.com/bbatsov/projectile">Projectile</a> project is a nifty way to run commands and search for files in a
particular "project". All projectile keybindings is placed under <code>C-x p</code>. And,
the most used commands by myself are <code>C-x p p</code> to switch-project, and <code>C-x p f</code>
to find a file and <code>C-x p d</code> to find a directory.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #78c5d6;">(</span><span style="color: #F0DFAF; font-weight: bold;">use-package</span> <span style="color: #BFEBBF;">projectile</span>
  <span style="color: #DCDCCC; font-weight: bold;">:ensure</span> t
  <span style="color: #DCDCCC; font-weight: bold;">:diminish</span> projectile-mode
  <span style="color: #DCDCCC; font-weight: bold;">:init</span> <span style="color: #bf62a6;">(</span>projectile-global-mode<span style="color: #bf62a6;">)</span>
  <span style="color: #5F7F5F;">;; </span><span style="color: #7F9F7F;">caching can speedup file and directory listings</span>
  <span style="color: #5F7F5F;">;;</span><span style="color: #7F9F7F;">(setq projectile-enable-caching t)</span>
  <span style="color: #5F7F5F;">;; </span><span style="color: #7F9F7F;">projectile cache file location</span>
  <span style="color: #bf62a6;">(</span><span style="color: #F0DFAF; font-weight: bold;">setq</span> projectile-cache-file <span style="color: #459ba8;">(</span>expand-file-name  <span style="color: #CC9393;">"projectile.cache"</span> user-emacs-savefile-dir<span style="color: #459ba8;">)</span><span style="color: #bf62a6;">)</span>
  <span style="color: #DCDCCC; font-weight: bold;">:commands</span> projectile-ag
  <span style="color: #DCDCCC; font-weight: bold;">:config</span>
  <span style="color: #bf62a6;">(</span>define-key projectile-mode-map <span style="color: #459ba8;">(</span>kbd <span style="color: #CC9393;">"s-p"</span><span style="color: #459ba8;">)</span> 'projectile-command-map<span style="color: #bf62a6;">)</span>
  <span style="color: #bf62a6;">(</span>define-key projectile-mode-map <span style="color: #459ba8;">(</span>kbd <span style="color: #CC9393;">"C-x p"</span><span style="color: #459ba8;">)</span> 'projectile-command-map<span style="color: #bf62a6;">)</span>

  <span style="color: #bf62a6;">(</span><span style="color: #F0DFAF; font-weight: bold;">setq</span> projectile-completion-system 'helm <span style="color: #5F7F5F;">; </span><span style="color: #7F9F7F;">`</span><span style="color: #BFEBBF;">ido</span><span style="color: #7F9F7F;">' or `</span><span style="color: #BFEBBF;">helm</span><span style="color: #7F9F7F;">' interface?</span>
        projectile-switch-project-action 'projectile-commander
        projectile-create-missing-test-files t<span style="color: #bf62a6;">)</span>
  <span style="color: #bf62a6;">(</span>add-to-list 'projectile-globally-ignored-files <span style="color: #CC9393;">".DS_Store"</span><span style="color: #bf62a6;">)</span>

  <span style="color: #bf62a6;">(</span><span style="color: #F0DFAF; font-weight: bold;">def-projectile-commander-method</span> ?d
    <span style="color: #CC9393;">"Open project root in dired."</span>
    <span style="color: #459ba8;">(</span>projectile-dired<span style="color: #459ba8;">)</span><span style="color: #bf62a6;">)</span>

  <span style="color: #bf62a6;">(</span><span style="color: #F0DFAF; font-weight: bold;">def-projectile-commander-method</span> ?s
    <span style="color: #CC9393;">"Open a *shell* buffer for the project."</span>
    <span style="color: #459ba8;">(</span>projectile-run-shell<span style="color: #459ba8;">)</span><span style="color: #bf62a6;">)</span>

  <span style="color: #bf62a6;">(</span><span style="color: #F0DFAF; font-weight: bold;">def-projectile-commander-method</span> ?c
    <span style="color: #CC9393;">"Run `</span><span style="color: #BFEBBF;">compile</span><span style="color: #CC9393;">' in the project."</span>
    <span style="color: #459ba8;">(</span>projectile-compile-project nil<span style="color: #459ba8;">)</span><span style="color: #bf62a6;">)</span>

  <span style="color: #bf62a6;">(</span><span style="color: #F0DFAF; font-weight: bold;">def-projectile-commander-method</span> ?F
    <span style="color: #CC9393;">"Git fetch."</span>
    <span style="color: #459ba8;">(</span>magit-status<span style="color: #459ba8;">)</span>
    <span style="color: #459ba8;">(</span>call-interactively #'magit-fetch-current<span style="color: #459ba8;">)</span><span style="color: #bf62a6;">)</span><span style="color: #78c5d6;">)</span>
</pre>
</div>

<p>
Much of the section came from <a href="http://endlessparentheses.com/improving-projectile-with-extra-commands.html">this essay</a>. Read it for config details and usage.
</p>
</div>
</div>
