init.org
*** =Dired= - directory editor

Install GNU Coreutils (and add it to your $PATH correctly) to make sure "ls"
program support "--dired" option:

#+BEGIN_SRC sh
  brew install coreutils
#+END_SRC

#+BEGIN_SRC emacs-lisp :tangle yes
  (setq ls-lisp-use-insert-directory-program nil)
#+END_SRC

Alternatively, you might want to use Emacs’s own emulation of "ls", by using:

#+BEGIN_SRC emacs-lisp :tangle no
  (setq ls-lisp-use-insert-directory-program t)
#+END_SRC

After =dired-x= mode turned on. =C-x C-j= (=dired-jump=) can jump to the
directory of any current buffer:

#+BEGIN_SRC emacs-lisp :tangle yes
  (use-package direx
    :ensure t
    :bind (("C-x j" . direx:jump-to-directory)
           ("C-x C-j" . direx:jump-to-directory)))
#+END_SRC

Tell =dired= to stop asking me whether I want to recursively delete or copy,
since I never respond to that question with =no=.

#+BEGIN_SRC emacs-lisp :tangle yes
  (setq dired-recursive-copies 'always)   ; recursive copies without asking
  (setq dired-recursive-deletes 'top)     ; recursive deletes with asked only once
#+END_SRC

Enables /Do What I Mean/ mode for dired: If I'm in a split frame with two dired
buffers, the default target to copy (and rename) will be the other window.

#+BEGIN_SRC emacs-lisp :tangle yes
  (setq dired-dwim-target t)
#+END_SRC

This =dired-hide-details-mode= enhancement to dired hides the ugly details
(owner permission info) until you hit =(= and shows the details with =)= hit
again. I want it always on:

#+BEGIN_SRC emacs-lisp :tangle yes
  (add-hook 'dired-mode-hook (lambda () (dired-hide-details-mode 1)))
  (setq dired-listing-switches "-alh")    ; human readable format
#+END_SRC

I also want dired to automatically revert, but to be quiet about it. The first
line actually enables auto-revert for any buffers.

#+BEGIN_SRC emacs-lisp :tangle yes
  (global-auto-revert-mode 1)
  (setq global-auto-revert-non-file-buffers t)
  (setq auto-revert-verbose nil)
#+END_SRC

The ability to create a dired buffer based on searching for files in a
directory tree with =find-name-dired= is fantastic. The [[http://www.masteringemacs.org/articles/2011/03/25/working-multiple-files-dired/][following magic]]
optimizes this approach:

#+BEGIN_SRC emacs-lisp :tangle yes
  (use-package find-dired
     :ensure t
     :init (setq find-ls-option '("-print0 | xargs -0 ls -od" . "-od")))
#+END_SRC

The [[http://pragmaticemacs.com/emacs/quickly-preview-images-and-other-files-with-peep-dired/][peep project]] allows you to preview files before loading them into a
dedicated buffer:

#+BEGIN_SRC emacs-lisp :tangle yes
  (use-package peep-dired
    :defer t ; don't access `dired-mode-map' until `peep-dired' is loaded
    :bind (:map dired-mode-map
                ("P" . peep-dired)))
#+END_SRC
*** =Neotree= - tree layout directory explorer

The [[https://github.com/jaypei/emacs-neotree][NeoTree]] project provides a nice tree layout file explorer, and it gives an
/ide-like/ look and feel.

#+BEGIN_SRC emacs-lisp :tangle yes
  (use-package neotree
    :ensure t
    :defer t
    :bind ("C-x t n" . neotree-toggle)
    :config
    (setq projectile-switch-project-action 'neotree-projectile-action)
    (setq neo-show-hidden-files t)
    (setq neo-smart-open t))

  (global-set-key [f2] 'neotree-toggle)
  (global-set-key [f8] 'neotree-toggle)
#+END_SRC
*** =Winner= - undo and redo window configuration

Change window configuration and then return to the old configuration with
[[http://www.emacswiki.org/emacs/WinnerMode][winner-mode]]. Use =Control-C Arrow= keys to cycle through window/frame
configurations. This is handy when something has popped up a buffer that you
want to look at briefly before returning to whatever you were working on. When
you're done, press =C-c <left>=.

#+BEGIN_SRC emacs-lisp :tangle yes
  (winner-mode 1)
#+END_SRC
*** =Windmove= - switch between windows

=Windmove= lets you move between windows with something more natural than
cycling through =C-x o= (=other-window=).

#+BEGIN_SRC emacs-lisp :tangle yes
  (use-package windmove
    :bind
    (("s-<right>" . windmove-right)
     ("s-<left>" . windmove-left)
     ("s-<up>" . windmove-up)
     ("s-<down>" . windmove-down)))
#+END_SRC
