init.html

<div id="outline-container-org580f8ae" class="outline-4">
<h4 id="org580f8ae"><span class="section-number-4">4.3.2</span> <code>Dired</code> - directory editor</h4>
<div class="outline-text-4" id="text-4-3-2">
<p>
Install GNU Coreutils (and add it to your $PATH correctly) to make sure "ls"
program support "&#x2013;dired" option:
</p>

<div class="org-src-container">
<pre class="src src-sh">brew install coreutils
</pre>
</div>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #78c5d6;">(</span><span style="color: #F0DFAF; font-weight: bold;">setq</span> ls-lisp-use-insert-directory-program nil<span style="color: #78c5d6;">)</span>
</pre>
</div>

<p>
Alternatively, you might want to use Emacs’s own emulation of "ls", by using:
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #78c5d6;">(</span><span style="color: #F0DFAF; font-weight: bold;">setq</span> ls-lisp-use-insert-directory-program t<span style="color: #78c5d6;">)</span>
</pre>
</div>

<p>
After <code>dired-x</code> mode turned on. <code>C-x C-j</code> (<code>dired-jump</code>) can jump to the
directory of any current buffer:
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #78c5d6;">(</span><span style="color: #F0DFAF; font-weight: bold;">use-package</span> <span style="color: #BFEBBF;">direx</span>
  <span style="color: #DCDCCC; font-weight: bold;">:ensure</span> t
  <span style="color: #DCDCCC; font-weight: bold;">:bind</span> <span style="color: #bf62a6;">(</span><span style="color: #459ba8;">(</span><span style="color: #CC9393;">"C-x j"</span> . direx:jump-to-directory<span style="color: #459ba8;">)</span>
         <span style="color: #459ba8;">(</span><span style="color: #CC9393;">"C-x C-j"</span> . direx:jump-to-directory<span style="color: #459ba8;">)</span><span style="color: #bf62a6;">)</span><span style="color: #78c5d6;">)</span>
</pre>
</div>

<p>
Tell <code>dired</code> to stop asking me whether I want to recursively delete or copy,
since I never respond to that question with <code>no</code>.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #78c5d6;">(</span><span style="color: #F0DFAF; font-weight: bold;">setq</span> dired-recursive-copies 'always<span style="color: #78c5d6;">)</span>   <span style="color: #5F7F5F;">; </span><span style="color: #7F9F7F;">recursive copies without asking</span>
<span style="color: #78c5d6;">(</span><span style="color: #F0DFAF; font-weight: bold;">setq</span> dired-recursive-deletes 'top<span style="color: #78c5d6;">)</span>     <span style="color: #5F7F5F;">; </span><span style="color: #7F9F7F;">recursive deletes with asked only once</span>
</pre>
</div>

<p>
Enables <i>Do What I Mean</i> mode for dired: If I'm in a split frame with two dired
buffers, the default target to copy (and rename) will be the other window.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #78c5d6;">(</span><span style="color: #F0DFAF; font-weight: bold;">setq</span> dired-dwim-target t<span style="color: #78c5d6;">)</span>
</pre>
</div>

<p>
This <code>dired-hide-details-mode</code> enhancement to dired hides the ugly details
(owner permission info) until you hit <code>(</code> and shows the details with <code>)</code> hit
again. I want it always on:
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #78c5d6;">(</span>add-hook 'dired-mode-hook <span style="color: #bf62a6;">(</span><span style="color: #F0DFAF; font-weight: bold;">lambda</span> <span style="color: #459ba8;">()</span> <span style="color: #459ba8;">(</span>dired-hide-details-mode 1<span style="color: #459ba8;">)</span><span style="color: #bf62a6;">)</span><span style="color: #78c5d6;">)</span>
<span style="color: #78c5d6;">(</span><span style="color: #F0DFAF; font-weight: bold;">setq</span> dired-listing-switches <span style="color: #CC9393;">"-alh"</span><span style="color: #78c5d6;">)</span>    <span style="color: #5F7F5F;">; </span><span style="color: #7F9F7F;">human readable format</span>
</pre>
</div>

<p>
I also want dired to automatically revert, but to be quiet about it. The first
line actually enables auto-revert for any buffers.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #78c5d6;">(</span>global-auto-revert-mode 1<span style="color: #78c5d6;">)</span>
<span style="color: #78c5d6;">(</span><span style="color: #F0DFAF; font-weight: bold;">setq</span> global-auto-revert-non-file-buffers t<span style="color: #78c5d6;">)</span>
<span style="color: #78c5d6;">(</span><span style="color: #F0DFAF; font-weight: bold;">setq</span> auto-revert-verbose nil<span style="color: #78c5d6;">)</span>
</pre>
</div>

<p>
The ability to create a dired buffer based on searching for files in a
directory tree with <code>find-name-dired</code> is fantastic. The <a href="http://www.masteringemacs.org/articles/2011/03/25/working-multiple-files-dired/">following magic</a>
optimizes this approach:
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #78c5d6;">(</span><span style="color: #F0DFAF; font-weight: bold;">use-package</span> <span style="color: #BFEBBF;">find-dired</span>
   <span style="color: #DCDCCC; font-weight: bold;">:ensure</span> t
   <span style="color: #DCDCCC; font-weight: bold;">:init</span> <span style="color: #bf62a6;">(</span><span style="color: #F0DFAF; font-weight: bold;">setq</span> find-ls-option '<span style="color: #459ba8;">(</span><span style="color: #CC9393;">"-print0 | xargs -0 ls -od"</span> . <span style="color: #CC9393;">"-od"</span><span style="color: #459ba8;">)</span><span style="color: #bf62a6;">)</span><span style="color: #78c5d6;">)</span>
</pre>
</div>

<p>
The <a href="http://pragmaticemacs.com/emacs/quickly-preview-images-and-other-files-with-peep-dired/">peep project</a> allows you to preview files before loading them into a
dedicated buffer:
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #78c5d6;">(</span><span style="color: #F0DFAF; font-weight: bold;">use-package</span> <span style="color: #BFEBBF;">peep-dired</span>
  <span style="color: #DCDCCC; font-weight: bold;">:defer</span> t <span style="color: #5F7F5F;">; </span><span style="color: #7F9F7F;">don't access `</span><span style="color: #BFEBBF;">dired-mode-map</span><span style="color: #7F9F7F;">' until `</span><span style="color: #BFEBBF;">peep-dired</span><span style="color: #7F9F7F;">' is loaded</span>
  <span style="color: #DCDCCC; font-weight: bold;">:bind</span> <span style="color: #bf62a6;">(</span><span style="color: #DCDCCC; font-weight: bold;">:map</span> dired-mode-map
              <span style="color: #459ba8;">(</span><span style="color: #CC9393;">"P"</span> . peep-dired<span style="color: #459ba8;">)</span><span style="color: #bf62a6;">)</span><span style="color: #78c5d6;">)</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-orga141e17" class="outline-4">
<h4 id="orga141e17"><span class="section-number-4">4.3.3</span> <code>Neotree</code> - tree layout directory explorer</h4>
<div class="outline-text-4" id="text-4-3-3">
<p>
The <a href="https://github.com/jaypei/emacs-neotree">NeoTree</a> project provides a nice tree layout file explorer, and it gives an
<i>ide-like</i> look and feel.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #78c5d6;">(</span><span style="color: #F0DFAF; font-weight: bold;">use-package</span> <span style="color: #BFEBBF;">neotree</span>
  <span style="color: #DCDCCC; font-weight: bold;">:ensure</span> t
  <span style="color: #DCDCCC; font-weight: bold;">:defer</span> t
  <span style="color: #DCDCCC; font-weight: bold;">:bind</span> <span style="color: #bf62a6;">(</span><span style="color: #CC9393;">"C-x t n"</span> . neotree-toggle<span style="color: #bf62a6;">)</span>
  <span style="color: #DCDCCC; font-weight: bold;">:config</span>
  <span style="color: #bf62a6;">(</span><span style="color: #F0DFAF; font-weight: bold;">setq</span> projectile-switch-project-action 'neotree-projectile-action<span style="color: #bf62a6;">)</span>
  <span style="color: #bf62a6;">(</span><span style="color: #F0DFAF; font-weight: bold;">setq</span> neo-show-hidden-files t<span style="color: #bf62a6;">)</span>
  <span style="color: #bf62a6;">(</span><span style="color: #F0DFAF; font-weight: bold;">setq</span> neo-smart-open t<span style="color: #bf62a6;">)</span><span style="color: #78c5d6;">)</span>

<span style="color: #78c5d6;">(</span>global-set-key <span style="color: #bf62a6;">[</span>f2<span style="color: #bf62a6;">]</span> 'neotree-toggle<span style="color: #78c5d6;">)</span>
<span style="color: #78c5d6;">(</span>global-set-key <span style="color: #bf62a6;">[</span>f8<span style="color: #bf62a6;">]</span> 'neotree-toggle<span style="color: #78c5d6;">)</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-orgfe23ace" class="outline-4">
<h4 id="orgfe23ace"><span class="section-number-4">4.3.4</span> <code>Winner</code> - undo and redo window configuration</h4>
<div class="outline-text-4" id="text-4-3-4">
<p>
Change window configuration and then return to the old configuration with
<a href="http://www.emacswiki.org/emacs/WinnerMode">winner-mode</a>. Use <code>Control-C Arrow</code> keys to cycle through window/frame
configurations. This is handy when something has popped up a buffer that you
want to look at briefly before returning to whatever you were working on. When
you're done, press <code>C-c &lt;left&gt;</code>.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #78c5d6;">(</span>winner-mode 1<span style="color: #78c5d6;">)</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-orgf9d4ba6" class="outline-4">
<h4 id="orgf9d4ba6"><span class="section-number-4">4.3.5</span> <code>Windmove</code> - switch between windows</h4>
<div class="outline-text-4" id="text-4-3-5">
<p>
<code>Windmove</code> lets you move between windows with something more natural than
cycling through <code>C-x o</code> (<code>other-window</code>).
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #78c5d6;">(</span><span style="color: #F0DFAF; font-weight: bold;">use-package</span> <span style="color: #BFEBBF;">windmove</span>
  <span style="color: #DCDCCC; font-weight: bold;">:bind</span>
  <span style="color: #bf62a6;">(</span><span style="color: #459ba8;">(</span><span style="color: #CC9393;">"s-&lt;right&gt;"</span> . windmove-right<span style="color: #459ba8;">)</span>
   <span style="color: #459ba8;">(</span><span style="color: #CC9393;">"s-&lt;left&gt;"</span> . windmove-left<span style="color: #459ba8;">)</span>
   <span style="color: #459ba8;">(</span><span style="color: #CC9393;">"s-&lt;up&gt;"</span> . windmove-up<span style="color: #459ba8;">)</span>
   <span style="color: #459ba8;">(</span><span style="color: #CC9393;">"s-&lt;down&gt;"</span> . windmove-down<span style="color: #459ba8;">)</span><span style="color: #bf62a6;">)</span><span style="color: #78c5d6;">)</span>
</pre>
</div>
</div>
</div>
