init.org
*** =Buffer-move= - move or swap buffer to other window

=Buffer-move= is similar to =windmove=, but more powerful. It can swap the
buffers.

#+BEGIN_SRC emacs-lisp :tangle yes
  (use-package buffer-move
    :config
    (global-set-key (kbd "<C-s-up>")     'buf-move-up)
    (global-set-key (kbd "<C-s-down>")   'buf-move-down)
    (global-set-key (kbd "<C-s-left>")   'buf-move-left)
    (global-set-key (kbd "<C-s-right>")  'buf-move-right))
#+END_SRC
*** =C-x o= : Moving to another window

A visual replacement for =C-x o=.

#+begin_src emacs-lisp :tangle yes
  (use-package switch-window
    :bind (("C-x o" . switch-window)))
#+end_src
*** =C-x k= : Quick kill buffer

I rarely want to kill any buffer but the one I'm looking at. And, I usually
want to kill buffers even if modified unconditionally. [[https://stackoverflow.com/questions/6467002/how-to-kill-buffer-in-emacs-without-answering-confirmation][Code from this
discussion]].

#+BEGIN_SRC emacs-lisp :tangle yes
  (defun kill-this-buffer-volatile ()
      "Kill current buffer unconditionally, even if it has been modified."
      (interactive)
      (set-buffer-modified-p nil)
      (kill-this-buffer))

  ;; Kill the current visible buffer without confirmation unless the buffer has
  ;; been modified. In this last case, you have to answer y/n.
  (global-set-key (kbd "C-x k") 'kill-this-buffer)
  ;; Unconditionally kill unmodified buffers.
  (global-set-key (kbd "C-x K") 'kill-this-buffer-volatile)
#+END_SRC
*** =Avy= - fast cursor movement

[[https://github.com/abo-abo/avy][Avy]] enable fast cursor movement to visible text using a char-based decision
tree. *Avy is fast!*

#+BEGIN_SRC emacs-lisp :tangle yes
  (use-package avy
    :ensure t
    :init (setq avy-background t)
    :config
    (global-set-key (kbd "s-;") 'avy-goto-line)
    (global-set-key (kbd "s-l") 'avy-goto-line)
    (global-set-key (kbd "s-.") 'avy-goto-char-timer)
    (global-set-key (kbd "s-j") 'avy-goto-char-timer)
    (global-set-key (kbd "s-,") 'avy-pop-mark)
    (global-set-key (kbd "s-J") 'avy-pop-mark))
#+END_SRC
*** =C-a= : Smart beginning of line

This [[http://emacsredux.com/blog/2013/05/22/smarter-navigation-to-the-beginning-of-a-line/][Emacs Redux article]] has a great suggestion for having =C-a= go to the
beginning of the line's content instead of the actual beginning of the line.
Hit =C-a= a second to get to the actual beginning.

#+BEGIN_SRC emacs-lisp :tangle yes
  (defun my/smarter-move-beginning-of-line (arg)
    "Move point back to indentation of beginning of line.

  Move point to the first non-whitespace character on this line.
  If point is already there, move to the beginning of the line.
  Effectively toggle between the first non-whitespace character and
  the beginning of the line.

  If ARG is not nil or 1, move forward ARG - 1 lines first.  If
  point reaches the beginning or end of the buffer, stop there."
    (interactive "^p")
    (setq arg (or arg 1))

    ;; Move lines first
    (when (/= arg 1)
      (let ((line-move-visual nil))
        (forward-line (1- arg))))

    (let ((orig-point (point)))
      (back-to-indentation)
      (when (= orig-point (point))
        (move-beginning-of-line 1))))

  ;; remap C-a to `smarter-move-beginning-of-line'
  (global-set-key [remap move-beginning-of-line]
                  'my/smarter-move-beginning-of-line)
#+END_SRC
