init.html
<div id="outline-container-org24da4a3" class="outline-4">
<h4 id="org24da4a3"><span class="section-number-4">4.3.6</span> <code>Buffer-move</code> - move or swap buffer to other window</h4>
<div class="outline-text-4" id="text-4-3-6">
<p>
<code>Buffer-move</code> is similar to <code>windmove</code>, but more powerful. It can swap the
buffers.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #78c5d6;">(</span><span style="color: #F0DFAF; font-weight: bold;">use-package</span> <span style="color: #BFEBBF;">buffer-move</span>
  <span style="color: #DCDCCC; font-weight: bold;">:config</span>
  <span style="color: #bf62a6;">(</span>global-set-key <span style="color: #459ba8;">(</span>kbd <span style="color: #CC9393;">"&lt;C-s-up&gt;"</span><span style="color: #459ba8;">)</span>     'buf-move-up<span style="color: #bf62a6;">)</span>
  <span style="color: #bf62a6;">(</span>global-set-key <span style="color: #459ba8;">(</span>kbd <span style="color: #CC9393;">"&lt;C-s-down&gt;"</span><span style="color: #459ba8;">)</span>   'buf-move-down<span style="color: #bf62a6;">)</span>
  <span style="color: #bf62a6;">(</span>global-set-key <span style="color: #459ba8;">(</span>kbd <span style="color: #CC9393;">"&lt;C-s-left&gt;"</span><span style="color: #459ba8;">)</span>   'buf-move-left<span style="color: #bf62a6;">)</span>
  <span style="color: #bf62a6;">(</span>global-set-key <span style="color: #459ba8;">(</span>kbd <span style="color: #CC9393;">"&lt;C-s-right&gt;"</span><span style="color: #459ba8;">)</span>  'buf-move-right<span style="color: #bf62a6;">)</span><span style="color: #78c5d6;">)</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-org31b6d98" class="outline-4">
<h4 id="org31b6d98"><span class="section-number-4">4.3.7</span> <code>C-x o</code> : Moving to another window</h4>
<div class="outline-text-4" id="text-4-3-7">
<p>
A visual replacement for <code>C-x o</code>.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #78c5d6;">(</span><span style="color: #F0DFAF; font-weight: bold;">use-package</span> <span style="color: #BFEBBF;">switch-window</span>
  <span style="color: #DCDCCC; font-weight: bold;">:bind</span> <span style="color: #bf62a6;">(</span><span style="color: #459ba8;">(</span><span style="color: #CC9393;">"C-x o"</span> . switch-window<span style="color: #459ba8;">)</span><span style="color: #bf62a6;">)</span><span style="color: #78c5d6;">)</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-org4f0a77a" class="outline-4">
<h4 id="org4f0a77a"><span class="section-number-4">4.3.8</span> <code>C-x k</code> : Quick kill buffer</h4>
<div class="outline-text-4" id="text-4-3-8">
<p>
I rarely want to kill any buffer but the one I'm looking at. And, I usually
want to kill buffers even if modified unconditionally. <a href="https://stackoverflow.com/questions/6467002/how-to-kill-buffer-in-emacs-without-answering-confirmation">Code from this
discussion</a>.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #78c5d6;">(</span><span style="color: #F0DFAF; font-weight: bold;">defun</span> <span style="color: #93E0E3;">kill-this-buffer-volatile</span> <span style="color: #bf62a6;">()</span>
    <span style="color: #9FC59F;">"Kill current buffer unconditionally, even if it has been modified."</span>
    <span style="color: #bf62a6;">(</span><span style="color: #F0DFAF; font-weight: bold;">interactive</span><span style="color: #bf62a6;">)</span>
    <span style="color: #bf62a6;">(</span>set-buffer-modified-p nil<span style="color: #bf62a6;">)</span>
    <span style="color: #bf62a6;">(</span>kill-this-buffer<span style="color: #bf62a6;">)</span><span style="color: #78c5d6;">)</span>

<span style="color: #5F7F5F;">;; </span><span style="color: #7F9F7F;">Kill the current visible buffer without confirmation unless the buffer has</span>
<span style="color: #5F7F5F;">;; </span><span style="color: #7F9F7F;">been modified. In this last case, you have to answer y/n.</span>
<span style="color: #78c5d6;">(</span>global-set-key <span style="color: #bf62a6;">(</span>kbd <span style="color: #CC9393;">"C-x k"</span><span style="color: #bf62a6;">)</span> 'kill-this-buffer<span style="color: #78c5d6;">)</span>
<span style="color: #5F7F5F;">;; </span><span style="color: #7F9F7F;">Unconditionally kill unmodified buffers.</span>
<span style="color: #78c5d6;">(</span>global-set-key <span style="color: #bf62a6;">(</span>kbd <span style="color: #CC9393;">"C-x K"</span><span style="color: #bf62a6;">)</span> 'kill-this-buffer-volatile<span style="color: #78c5d6;">)</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-org0b3c712" class="outline-4">
<h4 id="org0b3c712"><span class="section-number-4">4.3.9</span> <code>Avy</code> - fast cursor movement</h4>
<div class="outline-text-4" id="text-4-3-9">
<p>
<a href="https://github.com/abo-abo/avy">Avy</a> enable fast cursor movement to visible text using a char-based decision
tree. <b>Avy is fast!</b>
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #78c5d6;">(</span><span style="color: #F0DFAF; font-weight: bold;">use-package</span> <span style="color: #BFEBBF;">avy</span>
  <span style="color: #DCDCCC; font-weight: bold;">:ensure</span> t
  <span style="color: #DCDCCC; font-weight: bold;">:init</span> <span style="color: #bf62a6;">(</span><span style="color: #F0DFAF; font-weight: bold;">setq</span> avy-background t<span style="color: #bf62a6;">)</span>
  <span style="color: #DCDCCC; font-weight: bold;">:config</span>
  <span style="color: #bf62a6;">(</span>global-set-key <span style="color: #459ba8;">(</span>kbd <span style="color: #CC9393;">"s-;"</span><span style="color: #459ba8;">)</span> 'avy-goto-line<span style="color: #bf62a6;">)</span>
  <span style="color: #bf62a6;">(</span>global-set-key <span style="color: #459ba8;">(</span>kbd <span style="color: #CC9393;">"s-l"</span><span style="color: #459ba8;">)</span> 'avy-goto-line<span style="color: #bf62a6;">)</span>
  <span style="color: #bf62a6;">(</span>global-set-key <span style="color: #459ba8;">(</span>kbd <span style="color: #CC9393;">"s-."</span><span style="color: #459ba8;">)</span> 'avy-goto-char-timer<span style="color: #bf62a6;">)</span>
  <span style="color: #bf62a6;">(</span>global-set-key <span style="color: #459ba8;">(</span>kbd <span style="color: #CC9393;">"s-j"</span><span style="color: #459ba8;">)</span> 'avy-goto-char-timer<span style="color: #bf62a6;">)</span>
  <span style="color: #bf62a6;">(</span>global-set-key <span style="color: #459ba8;">(</span>kbd <span style="color: #CC9393;">"s-,"</span><span style="color: #459ba8;">)</span> 'avy-pop-mark<span style="color: #bf62a6;">)</span>
  <span style="color: #bf62a6;">(</span>global-set-key <span style="color: #459ba8;">(</span>kbd <span style="color: #CC9393;">"s-J"</span><span style="color: #459ba8;">)</span> 'avy-pop-mark<span style="color: #bf62a6;">)</span><span style="color: #78c5d6;">)</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-org55a7e4a" class="outline-4">
<h4 id="org55a7e4a"><span class="section-number-4">4.3.10</span> <code>C-a</code> : Smart beginning of line</h4>
<div class="outline-text-4" id="text-4-3-10">
<p>
This <a href="http://emacsredux.com/blog/2013/05/22/smarter-navigation-to-the-beginning-of-a-line/">Emacs Redux article</a> has a great suggestion for having <code>C-a</code> go to the
beginning of the line's content instead of the actual beginning of the line.
Hit <code>C-a</code> a second to get to the actual beginning.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #78c5d6;">(</span><span style="color: #F0DFAF; font-weight: bold;">defun</span> <span style="color: #93E0E3;">my/smarter-move-beginning-of-line</span> <span style="color: #bf62a6;">(</span>arg<span style="color: #bf62a6;">)</span>
  <span style="color: #9FC59F;">"Move point back to indentation of beginning of line.</span>

<span style="color: #9FC59F;">Move point to the first non-whitespace character on this line.</span>
<span style="color: #9FC59F;">If point is already there, move to the beginning of the line.</span>
<span style="color: #9FC59F;">Effectively toggle between the first non-whitespace character and</span>
<span style="color: #9FC59F;">the beginning of the line.</span>

<span style="color: #9FC59F;">If ARG is not nil or 1, move forward ARG - 1 lines first.  If</span>
<span style="color: #9FC59F;">point reaches the beginning or end of the buffer, stop there."</span>
  <span style="color: #bf62a6;">(</span><span style="color: #F0DFAF; font-weight: bold;">interactive</span> <span style="color: #CC9393;">"^p"</span><span style="color: #bf62a6;">)</span>
  <span style="color: #bf62a6;">(</span><span style="color: #F0DFAF; font-weight: bold;">setq</span> arg <span style="color: #459ba8;">(</span><span style="color: #F0DFAF; font-weight: bold;">or</span> arg 1<span style="color: #459ba8;">)</span><span style="color: #bf62a6;">)</span>

  <span style="color: #5F7F5F;">;; </span><span style="color: #7F9F7F;">Move lines first</span>
  <span style="color: #bf62a6;">(</span><span style="color: #F0DFAF; font-weight: bold;">when</span> <span style="color: #459ba8;">(</span>/= arg 1<span style="color: #459ba8;">)</span>
    <span style="color: #459ba8;">(</span><span style="color: #F0DFAF; font-weight: bold;">let</span> <span style="color: #e868a2;">(</span><span style="color: #79c267;">(</span>line-move-visual nil<span style="color: #79c267;">)</span><span style="color: #e868a2;">)</span>
      <span style="color: #e868a2;">(</span>forward-line <span style="color: #79c267;">(</span>1- arg<span style="color: #79c267;">)</span><span style="color: #e868a2;">)</span><span style="color: #459ba8;">)</span><span style="color: #bf62a6;">)</span>

  <span style="color: #bf62a6;">(</span><span style="color: #F0DFAF; font-weight: bold;">let</span> <span style="color: #459ba8;">(</span><span style="color: #e868a2;">(</span>orig-point <span style="color: #79c267;">(</span>point<span style="color: #79c267;">)</span><span style="color: #e868a2;">)</span><span style="color: #459ba8;">)</span>
    <span style="color: #459ba8;">(</span>back-to-indentation<span style="color: #459ba8;">)</span>
    <span style="color: #459ba8;">(</span><span style="color: #F0DFAF; font-weight: bold;">when</span> <span style="color: #e868a2;">(</span>= orig-point <span style="color: #79c267;">(</span>point<span style="color: #79c267;">)</span><span style="color: #e868a2;">)</span>
      <span style="color: #e868a2;">(</span>move-beginning-of-line 1<span style="color: #e868a2;">)</span><span style="color: #459ba8;">)</span><span style="color: #bf62a6;">)</span><span style="color: #78c5d6;">)</span>

<span style="color: #5F7F5F;">;; </span><span style="color: #7F9F7F;">remap C-a to `</span><span style="color: #BFEBBF;">smarter-move-beginning-of-line</span><span style="color: #7F9F7F;">'</span>
<span style="color: #78c5d6;">(</span>global-set-key <span style="color: #bf62a6;">[</span>remap move-beginning-of-line<span style="color: #bf62a6;">]</span>
                'my/smarter-move-beginning-of-line<span style="color: #78c5d6;">)</span>
</pre>
</div>
</div>
</div>
