init.org
*** =C-w= and =M-w= : Smart cut and copy

Here's a [[http://ergoemacs.org/emacs/emacs_copy_cut_current_line.html][function]] to cut current line if there's no text selection:

#+BEGIN_SRC emacs-lisp :tangle yes
  (defun xah-cut-line-or-region ()
    "Cut current line, or text selection.
  When `universal-argument' is called first, cut whole buffer (respects `narrow-to-region').

  URL `http://ergoemacs.org/emacs/emacs_copy_cut_current_line.html'
  Version 2015-06-10"
    (interactive)
    (if current-prefix-arg
        (progn ; not using kill-region because we don't want to include previous kill
          (kill-new (buffer-string))
          (delete-region (point-min) (point-max)))
      (progn (if (use-region-p)
                 (kill-region (region-beginning) (region-end) t)
               (kill-region (line-beginning-position) (line-beginning-position 2))))))

  (global-set-key (kbd "C-w") 'xah-cut-line-or-region)
#+END_SRC

Here is a [[http://ergoemacs.org/emacs/emacs_copy_cut_current_line.html][function]] copy current line if there is no text selection. If called
again, it'll append-copy next line. So you can press a key repeatedly to keep
copying lines.

#+BEGIN_SRC emacs-lisp :tangle yes
  (defun xah-copy-line-or-region ()
    "Copy current line, or text selection.
  When called repeatedly, append copy subsequent lines.
  When `universal-argument' is called first, copy whole buffer (respects `narrow-to-region').

  URL `http://ergoemacs.org/emacs/emacs_copy_cut_current_line.html'
  Version 2018-09-10"
    (interactive)
    (if current-prefix-arg
        (progn
          (copy-region-as-kill (point-min) (point-max)))
      (if (use-region-p)
          (progn
            (copy-region-as-kill (region-beginning) (region-end)))
        (if (eq last-command this-command)
            (if (eobp)
                (progn )
              (progn
                (kill-append "\n" nil)
                (kill-append
                 (buffer-substring-no-properties (line-beginning-position) (line-end-position))
                 nil)
                (progn
                  (end-of-line)
                  (forward-char))))
          (if (eobp)
              (if (eq (char-before) 10 )
                  (progn )
                (progn
                  (copy-region-as-kill (line-beginning-position) (line-end-position))
                  (end-of-line)))
            (progn
              (copy-region-as-kill (line-beginning-position) (line-end-position))
              (end-of-line)
              (forward-char)))))))

  (global-set-key (kbd "M-w") 'xah-copy-line-or-region)
  (global-set-key (kbd "M-[") 'xah-copy-line-or-region)
#+END_SRC
