init.html
<div id="outline-container-org2e38be9" class="outline-4">
<h4 id="org2e38be9"><span class="section-number-4">4.3.11</span> <code>C-w</code> and <code>M-w</code> : Smart cut and copy</h4>
<div class="outline-text-4" id="text-4-3-11">
<p>
Here's a <a href="http://ergoemacs.org/emacs/emacs_copy_cut_current_line.html">function</a> to cut current line if there's no text selection:
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #78c5d6;">(</span><span style="color: #F0DFAF; font-weight: bold;">defun</span> <span style="color: #93E0E3;">xah-cut-line-or-region</span> <span style="color: #bf62a6;">()</span>
  <span style="color: #9FC59F;">"Cut current line, or text selection.</span>
<span style="color: #9FC59F;">When `</span><span style="color: #BFEBBF;">universal-argument</span><span style="color: #9FC59F;">' is called first, cut whole buffer (respects `</span><span style="color: #BFEBBF;">narrow-to-region</span><span style="color: #9FC59F;">').</span>

<span style="color: #9FC59F;">URL `</span><span style="color: #BFEBBF;">http://ergoemacs.org/emacs/emacs_copy_cut_current_line.html</span><span style="color: #9FC59F;">'</span>
<span style="color: #9FC59F;">Version 2015-06-10"</span>
  <span style="color: #bf62a6;">(</span><span style="color: #F0DFAF; font-weight: bold;">interactive</span><span style="color: #bf62a6;">)</span>
  <span style="color: #bf62a6;">(</span><span style="color: #F0DFAF; font-weight: bold;">if</span> current-prefix-arg
      <span style="color: #459ba8;">(</span><span style="color: #F0DFAF; font-weight: bold;">progn</span> <span style="color: #5F7F5F;">; </span><span style="color: #7F9F7F;">not using kill-region because we don't want to include previous kill</span>
        <span style="color: #e868a2;">(</span>kill-new <span style="color: #79c267;">(</span>buffer-string<span style="color: #79c267;">)</span><span style="color: #e868a2;">)</span>
        <span style="color: #e868a2;">(</span>delete-region <span style="color: #79c267;">(</span>point-min<span style="color: #79c267;">)</span> <span style="color: #79c267;">(</span>point-max<span style="color: #79c267;">)</span><span style="color: #e868a2;">)</span><span style="color: #459ba8;">)</span>
    <span style="color: #459ba8;">(</span><span style="color: #F0DFAF; font-weight: bold;">progn</span> <span style="color: #e868a2;">(</span><span style="color: #F0DFAF; font-weight: bold;">if</span> <span style="color: #79c267;">(</span>use-region-p<span style="color: #79c267;">)</span>
               <span style="color: #79c267;">(</span>kill-region <span style="color: #f28c33;">(</span>region-beginning<span style="color: #f28c33;">)</span> <span style="color: #f28c33;">(</span>region-end<span style="color: #f28c33;">)</span> t<span style="color: #79c267;">)</span>
             <span style="color: #79c267;">(</span>kill-region <span style="color: #f28c33;">(</span>line-beginning-position<span style="color: #f28c33;">)</span> <span style="color: #f28c33;">(</span>line-beginning-position 2<span style="color: #f28c33;">)</span><span style="color: #79c267;">)</span><span style="color: #e868a2;">)</span><span style="color: #459ba8;">)</span><span style="color: #bf62a6;">)</span><span style="color: #78c5d6;">)</span>

<span style="color: #78c5d6;">(</span>global-set-key <span style="color: #bf62a6;">(</span>kbd <span style="color: #CC9393;">"C-w"</span><span style="color: #bf62a6;">)</span> 'xah-cut-line-or-region<span style="color: #78c5d6;">)</span>
</pre>
</div>

<p>
Here is a <a href="http://ergoemacs.org/emacs/emacs_copy_cut_current_line.html">function</a> copy current line if there is no text selection. If called
again, it'll append-copy next line. So you can press a key repeatedly to keep
copying lines.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #78c5d6;">(</span><span style="color: #F0DFAF; font-weight: bold;">defun</span> <span style="color: #93E0E3;">xah-copy-line-or-region</span> <span style="color: #bf62a6;">()</span>
  <span style="color: #9FC59F;">"Copy current line, or text selection.</span>
<span style="color: #9FC59F;">When called repeatedly, append copy subsequent lines.</span>
<span style="color: #9FC59F;">When `</span><span style="color: #BFEBBF;">universal-argument</span><span style="color: #9FC59F;">' is called first, copy whole buffer (respects `</span><span style="color: #BFEBBF;">narrow-to-region</span><span style="color: #9FC59F;">').</span>

<span style="color: #9FC59F;">URL `</span><span style="color: #BFEBBF;">http://ergoemacs.org/emacs/emacs_copy_cut_current_line.html</span><span style="color: #9FC59F;">'</span>
<span style="color: #9FC59F;">Version 2018-09-10"</span>
  <span style="color: #bf62a6;">(</span><span style="color: #F0DFAF; font-weight: bold;">interactive</span><span style="color: #bf62a6;">)</span>
  <span style="color: #bf62a6;">(</span><span style="color: #F0DFAF; font-weight: bold;">if</span> current-prefix-arg
      <span style="color: #459ba8;">(</span><span style="color: #F0DFAF; font-weight: bold;">progn</span>
        <span style="color: #e868a2;">(</span>copy-region-as-kill <span style="color: #79c267;">(</span>point-min<span style="color: #79c267;">)</span> <span style="color: #79c267;">(</span>point-max<span style="color: #79c267;">)</span><span style="color: #e868a2;">)</span><span style="color: #459ba8;">)</span>
    <span style="color: #459ba8;">(</span><span style="color: #F0DFAF; font-weight: bold;">if</span> <span style="color: #e868a2;">(</span>use-region-p<span style="color: #e868a2;">)</span>
        <span style="color: #e868a2;">(</span><span style="color: #F0DFAF; font-weight: bold;">progn</span>
          <span style="color: #79c267;">(</span>copy-region-as-kill <span style="color: #f28c33;">(</span>region-beginning<span style="color: #f28c33;">)</span> <span style="color: #f28c33;">(</span>region-end<span style="color: #f28c33;">)</span><span style="color: #79c267;">)</span><span style="color: #e868a2;">)</span>
      <span style="color: #e868a2;">(</span><span style="color: #F0DFAF; font-weight: bold;">if</span> <span style="color: #79c267;">(</span>eq last-command this-command<span style="color: #79c267;">)</span>
          <span style="color: #79c267;">(</span><span style="color: #F0DFAF; font-weight: bold;">if</span> <span style="color: #f28c33;">(</span>eobp<span style="color: #f28c33;">)</span>
              <span style="color: #f28c33;">(</span><span style="color: #F0DFAF; font-weight: bold;">progn</span> <span style="color: #f28c33;">)</span>
            <span style="color: #f28c33;">(</span><span style="color: #F0DFAF; font-weight: bold;">progn</span>
              <span style="color: #c5d647;">(</span>kill-append <span style="color: #CC9393;">"\n"</span> nil<span style="color: #c5d647;">)</span>
              <span style="color: #c5d647;">(</span>kill-append
               <span style="color: #f5d63d;">(</span>buffer-substring-no-properties <span style="color: #78c5d6;">(</span>line-beginning-position<span style="color: #78c5d6;">)</span> <span style="color: #78c5d6;">(</span>line-end-position<span style="color: #78c5d6;">)</span><span style="color: #f5d63d;">)</span>
               nil<span style="color: #c5d647;">)</span>
              <span style="color: #c5d647;">(</span><span style="color: #F0DFAF; font-weight: bold;">progn</span>
                <span style="color: #f5d63d;">(</span>end-of-line<span style="color: #f5d63d;">)</span>
                <span style="color: #f5d63d;">(</span>forward-char<span style="color: #f5d63d;">)</span><span style="color: #c5d647;">)</span><span style="color: #f28c33;">)</span><span style="color: #79c267;">)</span>
        <span style="color: #79c267;">(</span><span style="color: #F0DFAF; font-weight: bold;">if</span> <span style="color: #f28c33;">(</span>eobp<span style="color: #f28c33;">)</span>
            <span style="color: #f28c33;">(</span><span style="color: #F0DFAF; font-weight: bold;">if</span> <span style="color: #c5d647;">(</span>eq <span style="color: #f5d63d;">(</span>char-before<span style="color: #f5d63d;">)</span> 10 <span style="color: #c5d647;">)</span>
                <span style="color: #c5d647;">(</span><span style="color: #F0DFAF; font-weight: bold;">progn</span> <span style="color: #c5d647;">)</span>
              <span style="color: #c5d647;">(</span><span style="color: #F0DFAF; font-weight: bold;">progn</span>
                <span style="color: #f5d63d;">(</span>copy-region-as-kill <span style="color: #78c5d6;">(</span>line-beginning-position<span style="color: #78c5d6;">)</span> <span style="color: #78c5d6;">(</span>line-end-position<span style="color: #78c5d6;">)</span><span style="color: #f5d63d;">)</span>
                <span style="color: #f5d63d;">(</span>end-of-line<span style="color: #f5d63d;">)</span><span style="color: #c5d647;">)</span><span style="color: #f28c33;">)</span>
          <span style="color: #f28c33;">(</span><span style="color: #F0DFAF; font-weight: bold;">progn</span>
            <span style="color: #c5d647;">(</span>copy-region-as-kill <span style="color: #f5d63d;">(</span>line-beginning-position<span style="color: #f5d63d;">)</span> <span style="color: #f5d63d;">(</span>line-end-position<span style="color: #f5d63d;">)</span><span style="color: #c5d647;">)</span>
            <span style="color: #c5d647;">(</span>end-of-line<span style="color: #c5d647;">)</span>
            <span style="color: #c5d647;">(</span>forward-char<span style="color: #c5d647;">)</span><span style="color: #f28c33;">)</span><span style="color: #79c267;">)</span><span style="color: #e868a2;">)</span><span style="color: #459ba8;">)</span><span style="color: #bf62a6;">)</span><span style="color: #78c5d6;">)</span>

<span style="color: #78c5d6;">(</span>global-set-key <span style="color: #bf62a6;">(</span>kbd <span style="color: #CC9393;">"M-w"</span><span style="color: #bf62a6;">)</span> 'xah-copy-line-or-region<span style="color: #78c5d6;">)</span>
<span style="color: #78c5d6;">(</span>global-set-key <span style="color: #bf62a6;">(</span>kbd <span style="color: #CC9393;">"M-["</span><span style="color: #bf62a6;">)</span> 'xah-copy-line-or-region<span style="color: #78c5d6;">)</span>
</pre>
</div>
</div>
</div>
