init.html
<div id="outline-container-org199dea3" class="outline-4">
<h4 id="org199dea3"><span class="section-number-4">4.3.12</span> <code>M-\</code> : Smart delete whitespaces around cursor</h4>
<div class="outline-text-4" id="text-4-3-12">
<p>
Here's a function <a href="http://ergoemacs.org/emacs/emacs_shrink_whitespace.html">combine most of the deleting whitespaces around cursor
command into single one</a>:
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #78c5d6;">(</span><span style="color: #F0DFAF; font-weight: bold;">defun</span> <span style="color: #93E0E3;">xah-delete-blank-lines</span> <span style="color: #bf62a6;">()</span>
  <span style="color: #9FC59F;">"Delete all newline around cursor.</span>

<span style="color: #9FC59F;">URL `</span><span style="color: #BFEBBF;">http://ergoemacs.org/emacs/emacs_shrink_whitespace.html</span><span style="color: #9FC59F;">'</span>
<span style="color: #9FC59F;">Version 2018-04-02"</span>
  <span style="color: #bf62a6;">(</span><span style="color: #F0DFAF; font-weight: bold;">interactive</span><span style="color: #bf62a6;">)</span>
  <span style="color: #bf62a6;">(</span><span style="color: #F0DFAF; font-weight: bold;">let</span> <span style="color: #459ba8;">(</span>$p3 $p4<span style="color: #459ba8;">)</span>
          <span style="color: #459ba8;">(</span>skip-chars-backward <span style="color: #CC9393;">"\n"</span><span style="color: #459ba8;">)</span>
          <span style="color: #459ba8;">(</span><span style="color: #F0DFAF; font-weight: bold;">setq</span> $p3 <span style="color: #e868a2;">(</span>point<span style="color: #e868a2;">)</span><span style="color: #459ba8;">)</span>
          <span style="color: #459ba8;">(</span>skip-chars-forward <span style="color: #CC9393;">"\n"</span><span style="color: #459ba8;">)</span>
          <span style="color: #459ba8;">(</span><span style="color: #F0DFAF; font-weight: bold;">setq</span> $p4 <span style="color: #e868a2;">(</span>point<span style="color: #e868a2;">)</span><span style="color: #459ba8;">)</span>
          <span style="color: #459ba8;">(</span>delete-region $p3 $p4<span style="color: #459ba8;">)</span><span style="color: #bf62a6;">)</span><span style="color: #78c5d6;">)</span>

<span style="color: #78c5d6;">(</span><span style="color: #F0DFAF; font-weight: bold;">defun</span> <span style="color: #93E0E3;">xah-shrink-whitespaces</span> <span style="color: #bf62a6;">()</span>
  <span style="color: #9FC59F;">"Remove whitespaces around cursor to just one, or none.</span>

<span style="color: #9FC59F;">Shrink any neighboring space tab newline characters to 1 or none.</span>
<span style="color: #9FC59F;">If cursor neighbor has space/tab, toggle between 1 or 0 space.</span>
<span style="color: #9FC59F;">If cursor neighbor are newline, shrink them to just 1.</span>
<span style="color: #9FC59F;">If already has just 1 whitespace, delete it.</span>

<span style="color: #9FC59F;">URL `</span><span style="color: #BFEBBF;">http://ergoemacs.org/emacs/emacs_shrink_whitespace.html</span><span style="color: #9FC59F;">'</span>
<span style="color: #9FC59F;">Version 2018-04-02T14:38:04-07:00"</span>
  <span style="color: #bf62a6;">(</span><span style="color: #F0DFAF; font-weight: bold;">interactive</span><span style="color: #bf62a6;">)</span>
  <span style="color: #bf62a6;">(</span><span style="color: #F0DFAF; font-weight: bold;">let*</span> <span style="color: #459ba8;">(</span>
         <span style="color: #e868a2;">(</span>$eol-count 0<span style="color: #e868a2;">)</span>
         <span style="color: #e868a2;">(</span>$p0 <span style="color: #79c267;">(</span>point<span style="color: #79c267;">)</span><span style="color: #e868a2;">)</span>
         $p1 <span style="color: #5F7F5F;">; </span><span style="color: #7F9F7F;">whitespace begin</span>
         $p2 <span style="color: #5F7F5F;">; </span><span style="color: #7F9F7F;">whitespace end</span>
         <span style="color: #e868a2;">(</span>$charBefore <span style="color: #79c267;">(</span>char-before<span style="color: #79c267;">)</span><span style="color: #e868a2;">)</span>
         <span style="color: #e868a2;">(</span>$charAfter <span style="color: #79c267;">(</span>char-after <span style="color: #79c267;">)</span><span style="color: #e868a2;">)</span>
         <span style="color: #e868a2;">(</span>$space-neighbor-p <span style="color: #79c267;">(</span><span style="color: #F0DFAF; font-weight: bold;">or</span> <span style="color: #f28c33;">(</span>eq $charBefore 32<span style="color: #f28c33;">)</span> <span style="color: #f28c33;">(</span>eq $charBefore 9<span style="color: #f28c33;">)</span> <span style="color: #f28c33;">(</span>eq $charAfter 32<span style="color: #f28c33;">)</span> <span style="color: #f28c33;">(</span>eq $charAfter 9<span style="color: #f28c33;">)</span><span style="color: #79c267;">)</span><span style="color: #e868a2;">)</span>
         $just-1-space-p
         <span style="color: #459ba8;">)</span>
    <span style="color: #459ba8;">(</span>skip-chars-backward <span style="color: #CC9393;">" \n\t"</span><span style="color: #459ba8;">)</span>
    <span style="color: #459ba8;">(</span><span style="color: #F0DFAF; font-weight: bold;">setq</span> $p1 <span style="color: #e868a2;">(</span>point<span style="color: #e868a2;">)</span><span style="color: #459ba8;">)</span>
    <span style="color: #459ba8;">(</span>goto-char $p0<span style="color: #459ba8;">)</span>
    <span style="color: #459ba8;">(</span>skip-chars-forward <span style="color: #CC9393;">" \n\t"</span><span style="color: #459ba8;">)</span>
    <span style="color: #459ba8;">(</span><span style="color: #F0DFAF; font-weight: bold;">setq</span> $p2 <span style="color: #e868a2;">(</span>point<span style="color: #e868a2;">)</span><span style="color: #459ba8;">)</span>
    <span style="color: #459ba8;">(</span>goto-char $p1<span style="color: #459ba8;">)</span>
    <span style="color: #459ba8;">(</span><span style="color: #F0DFAF; font-weight: bold;">while</span> <span style="color: #e868a2;">(</span>search-forward <span style="color: #CC9393;">"\n"</span> $p2 t <span style="color: #e868a2;">)</span>
      <span style="color: #e868a2;">(</span><span style="color: #F0DFAF; font-weight: bold;">setq</span> $eol-count <span style="color: #79c267;">(</span>1+ $eol-count<span style="color: #79c267;">)</span><span style="color: #e868a2;">)</span><span style="color: #459ba8;">)</span>
    <span style="color: #459ba8;">(</span><span style="color: #F0DFAF; font-weight: bold;">setq</span> $just-1-space-p <span style="color: #e868a2;">(</span>eq <span style="color: #79c267;">(</span>- $p2 $p1<span style="color: #79c267;">)</span> 1<span style="color: #e868a2;">)</span><span style="color: #459ba8;">)</span>
    <span style="color: #459ba8;">(</span>goto-char $p0<span style="color: #459ba8;">)</span>
    <span style="color: #459ba8;">(</span><span style="color: #F0DFAF; font-weight: bold;">cond</span>
     <span style="color: #e868a2;">(</span><span style="color: #79c267;">(</span>eq $eol-count 0<span style="color: #79c267;">)</span>
      <span style="color: #79c267;">(</span><span style="color: #F0DFAF; font-weight: bold;">if</span> $just-1-space-p
          <span style="color: #f28c33;">(</span>delete-horizontal-space<span style="color: #f28c33;">)</span>
        <span style="color: #f28c33;">(</span><span style="color: #F0DFAF; font-weight: bold;">progn</span> <span style="color: #c5d647;">(</span>delete-horizontal-space<span style="color: #c5d647;">)</span>
               <span style="color: #c5d647;">(</span>insert <span style="color: #CC9393;">" "</span><span style="color: #c5d647;">)</span><span style="color: #f28c33;">)</span><span style="color: #79c267;">)</span><span style="color: #e868a2;">)</span>
     <span style="color: #e868a2;">(</span><span style="color: #79c267;">(</span>eq $eol-count 1<span style="color: #79c267;">)</span>
      <span style="color: #79c267;">(</span><span style="color: #F0DFAF; font-weight: bold;">if</span> $space-neighbor-p
          <span style="color: #f28c33;">(</span>delete-horizontal-space<span style="color: #f28c33;">)</span>
        <span style="color: #f28c33;">(</span><span style="color: #F0DFAF; font-weight: bold;">progn</span> <span style="color: #c5d647;">(</span>xah-delete-blank-lines<span style="color: #c5d647;">)</span> <span style="color: #c5d647;">(</span>insert <span style="color: #CC9393;">" "</span><span style="color: #c5d647;">)</span><span style="color: #f28c33;">)</span><span style="color: #79c267;">)</span><span style="color: #e868a2;">)</span>
     <span style="color: #e868a2;">(</span><span style="color: #79c267;">(</span>eq $eol-count 2<span style="color: #79c267;">)</span>
      <span style="color: #79c267;">(</span><span style="color: #F0DFAF; font-weight: bold;">if</span> $space-neighbor-p
          <span style="color: #f28c33;">(</span>delete-horizontal-space<span style="color: #f28c33;">)</span>
        <span style="color: #f28c33;">(</span><span style="color: #F0DFAF; font-weight: bold;">progn</span>
          <span style="color: #c5d647;">(</span>xah-delete-blank-lines<span style="color: #c5d647;">)</span>
          <span style="color: #c5d647;">(</span>insert <span style="color: #CC9393;">"\n"</span><span style="color: #c5d647;">)</span><span style="color: #f28c33;">)</span><span style="color: #79c267;">)</span><span style="color: #e868a2;">)</span>
     <span style="color: #e868a2;">(</span><span style="color: #79c267;">(</span>&gt; $eol-count 2<span style="color: #79c267;">)</span>
      <span style="color: #79c267;">(</span><span style="color: #F0DFAF; font-weight: bold;">if</span> $space-neighbor-p
          <span style="color: #f28c33;">(</span>delete-horizontal-space<span style="color: #f28c33;">)</span>
        <span style="color: #f28c33;">(</span><span style="color: #F0DFAF; font-weight: bold;">progn</span>
          <span style="color: #c5d647;">(</span>goto-char $p2<span style="color: #c5d647;">)</span>
          <span style="color: #c5d647;">(</span>search-backward <span style="color: #CC9393;">"\n"</span> <span style="color: #c5d647;">)</span>
          <span style="color: #c5d647;">(</span>delete-region $p1 <span style="color: #f5d63d;">(</span>point<span style="color: #f5d63d;">)</span><span style="color: #c5d647;">)</span>
          <span style="color: #c5d647;">(</span>insert <span style="color: #CC9393;">"\n"</span><span style="color: #c5d647;">)</span><span style="color: #f28c33;">)</span><span style="color: #79c267;">)</span><span style="color: #e868a2;">)</span>
     <span style="color: #e868a2;">(</span>t <span style="color: #79c267;">(</span><span style="color: #F0DFAF; font-weight: bold;">progn</span>
          <span style="color: #f28c33;">(</span>message <span style="color: #CC9393;">"nothing done. logic error 40873. shouldn't reach here"</span> <span style="color: #f28c33;">)</span><span style="color: #79c267;">)</span><span style="color: #e868a2;">)</span><span style="color: #459ba8;">)</span><span style="color: #bf62a6;">)</span><span style="color: #78c5d6;">)</span>

<span style="color: #78c5d6;">(</span>global-set-key <span style="color: #bf62a6;">(</span>kbd <span style="color: #CC9393;">"M-\\"</span><span style="color: #bf62a6;">)</span> 'xah-shrink-whitespaces<span style="color: #78c5d6;">)</span>
</pre>
</div>
</div>
</div>
