init.org
*** =C-k= : Smart kill entire lines

According to [[http://endlessparentheses.com/kill-entire-line-with-prefix-argument.html][this article]], killing arbitrary number of lines of text can be done
with two keystrokes.

This creates a macro that moves to the beginning of the line and then calls a
function given to it. Quite an interesting approach:

#+BEGIN_SRC emacs-lisp :tangle yes
  (defmacro bol-with-prefix (function)
    "Define a new function which calls FUNCTION.
  Except it moves to beginning of line before calling FUNCTION when
  called with a prefix argument. The FUNCTION still receives the
  prefix argument."
    (let ((name (intern (format "endless/%s-BOL" function))))
      `(progn
         (defun ,name (p)
           ,(format
             "Call `%s', but move to the beginning of the line when called with a prefix argument."
             function)
           (interactive "P")
           (when p
             (forward-line 0))
           (call-interactively ',function))
         ',name)))
#+END_SRC

And we re-bind them to functions that use them.

#+BEGIN_SRC emacs-lisp :tangle yes
  (global-set-key [remap paredit-kill] (bol-with-prefix paredit-kill))
  (global-set-key [remap sp-kill-hybrid-sexp] (bol-with-prefix sp-kill-hybrid-sexp))
  (global-set-key [remap org-kill-line] (bol-with-prefix org-kill-line))
  (global-set-key [remap kill-line] (bol-with-prefix kill-line))

  (global-set-key (kbd "C-k") (bol-with-prefix kill-line))
#+END_SRC

With this little macro, =C-k= still kills from point, but =C-7 C-k= swallows
seven whole line. As a bonus, we get the =kill-whole-line= (=C-S-backspace=)
behavior by doing =C-1 C-k= (I prefer =M-1= to =C-1= for easy stroke.).

*** =Expand-region= - Smart region selection

Wherever you are in a file, and whatever the type of file, you can
slowly increase a region selection by logical segments by using the
[[https://github.com/magnars/expand-region.el][expand-region]] project.

However, the normal experience for =expand-region= is interactive, expected to
be called repeatedly to expand and contract the regions based on syntax, and
whatnot. Since I am seldom sure what I will select if I give this function a
numeric prefix, I created a wrapper function that will (when given a number),
just select the number of lines for the region. Select the current line with a
0 argument. No argument (well, =lines= is given 1 with no argument), then it
just calls original =expand-region= (Taken from [[https://github.com/howardabrams/dot-files/blob/master/emacs.org][here]]):

#+BEGIN_SRC emacs-lisp :tangle yes
  (use-package expand-region  
    :ensure t
    :defer t
    :config
    (defun ha/expand-region (lines)
      "Prefix-oriented wrapper around Magnar's `er/expand-region'.

  Call with LINES equal to 1 (given no prefix), it expands the
  region as normal.  When LINES given a positive number, selects
  the current line and number of lines specified.  When LINES is a
  negative number, selects the current line and the previous lines
  specified.  Select the current line if the LINES prefix is zero."
      (interactive "p")
      (cond ((= lines 1)   (er/expand-region 1))
            ((< lines 0)   (ha/expand-previous-line-as-region lines))
            (t             (ha/expand-next-line-as-region (1+ lines)))))

    (defun ha/expand-next-line-as-region (lines)
      (message "lines = %d" lines)
      (beginning-of-line)
      (set-mark (point))
      (end-of-line lines))

    (defun ha/expand-previous-line-as-region (lines)
      (end-of-line)
      (set-mark (point))
      (beginning-of-line (1+ lines)))

    :bind (("C-=" . ha/expand-region)     ; wrapped version of `er/expand-region'
           ("C--" . er/contract-region)))
#+END_SRC

I chose =C-0= instead of =C-1= as the prefix argument to select the current
line, because It's easier to stroke =C-0= than =C-1=.

Give it a try, and you will know what it will do quickly.

