init.html

<div id="outline-container-org41bfc13" class="outline-4">
<h4 id="org41bfc13"><span class="section-number-4">4.3.13</span> <code>C-k</code> : Smart kill entire lines</h4>
<div class="outline-text-4" id="text-4-3-13">
<p>
According to <a href="http://endlessparentheses.com/kill-entire-line-with-prefix-argument.html">this article</a>, killing arbitrary number of lines of text can be done
with two keystrokes.
</p>

<p>
This creates a macro that moves to the beginning of the line and then calls a
function given to it. Quite an interesting approach:
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #78c5d6;">(</span><span style="color: #F0DFAF; font-weight: bold;">defmacro</span> <span style="color: #93E0E3;">bol-with-prefix</span> <span style="color: #bf62a6;">(</span><span style="color: #F0DFAF; font-weight: bold;">function</span><span style="color: #bf62a6;">)</span>
  <span style="color: #9FC59F;">"Define a new function which calls FUNCTION.</span>
<span style="color: #9FC59F;">Except it moves to beginning of line before calling FUNCTION when</span>
<span style="color: #9FC59F;">called with a prefix argument. The FUNCTION still receives the</span>
<span style="color: #9FC59F;">prefix argument."</span>
  <span style="color: #bf62a6;">(</span><span style="color: #F0DFAF; font-weight: bold;">let</span> <span style="color: #459ba8;">(</span><span style="color: #e868a2;">(</span>name <span style="color: #79c267;">(</span>intern <span style="color: #f28c33;">(</span>format <span style="color: #CC9393;">"endless/%s-BOL"</span> function<span style="color: #f28c33;">)</span><span style="color: #79c267;">)</span><span style="color: #e868a2;">)</span><span style="color: #459ba8;">)</span>
    `<span style="color: #459ba8;">(</span><span style="color: #F0DFAF; font-weight: bold;">progn</span>
       <span style="color: #e868a2;">(</span><span style="color: #F0DFAF; font-weight: bold;">defun</span> ,name <span style="color: #79c267;">(</span>p<span style="color: #79c267;">)</span>
         ,<span style="color: #79c267;">(</span>format
           <span style="color: #CC9393;">"Call `</span><span style="color: #BFEBBF;">%s</span><span style="color: #CC9393;">', but move to the beginning of the line when called with a prefix argument."</span>
           function<span style="color: #79c267;">)</span>
         <span style="color: #79c267;">(</span><span style="color: #F0DFAF; font-weight: bold;">interactive</span> <span style="color: #CC9393;">"P"</span><span style="color: #79c267;">)</span>
         <span style="color: #79c267;">(</span><span style="color: #F0DFAF; font-weight: bold;">when</span> p
           <span style="color: #f28c33;">(</span>forward-line 0<span style="color: #f28c33;">)</span><span style="color: #79c267;">)</span>
         <span style="color: #79c267;">(</span>call-interactively ',function<span style="color: #79c267;">)</span><span style="color: #e868a2;">)</span>
       ',name<span style="color: #459ba8;">)</span><span style="color: #bf62a6;">)</span><span style="color: #78c5d6;">)</span>
</pre>
</div>

<p>
And we re-bind them to functions that use them.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #78c5d6;">(</span>global-set-key <span style="color: #bf62a6;">[</span>remap paredit-kill<span style="color: #bf62a6;">]</span> <span style="color: #bf62a6;">(</span><span style="color: #F0DFAF; font-weight: bold;">bol-with-prefix</span> paredit-kill<span style="color: #bf62a6;">)</span><span style="color: #78c5d6;">)</span>
<span style="color: #78c5d6;">(</span>global-set-key <span style="color: #bf62a6;">[</span>remap sp-kill-hybrid-sexp<span style="color: #bf62a6;">]</span> <span style="color: #bf62a6;">(</span><span style="color: #F0DFAF; font-weight: bold;">bol-with-prefix</span> sp-kill-hybrid-sexp<span style="color: #bf62a6;">)</span><span style="color: #78c5d6;">)</span>
<span style="color: #78c5d6;">(</span>global-set-key <span style="color: #bf62a6;">[</span>remap org-kill-line<span style="color: #bf62a6;">]</span> <span style="color: #bf62a6;">(</span><span style="color: #F0DFAF; font-weight: bold;">bol-with-prefix</span> org-kill-line<span style="color: #bf62a6;">)</span><span style="color: #78c5d6;">)</span>
<span style="color: #78c5d6;">(</span>global-set-key <span style="color: #bf62a6;">[</span>remap kill-line<span style="color: #bf62a6;">]</span> <span style="color: #bf62a6;">(</span><span style="color: #F0DFAF; font-weight: bold;">bol-with-prefix</span> kill-line<span style="color: #bf62a6;">)</span><span style="color: #78c5d6;">)</span>

<span style="color: #78c5d6;">(</span>global-set-key <span style="color: #bf62a6;">(</span>kbd <span style="color: #CC9393;">"C-k"</span><span style="color: #bf62a6;">)</span> <span style="color: #bf62a6;">(</span><span style="color: #F0DFAF; font-weight: bold;">bol-with-prefix</span> kill-line<span style="color: #bf62a6;">)</span><span style="color: #78c5d6;">)</span>
</pre>
</div>

<p>
With this little macro, <code>C-k</code> still kills from point, but <code>C-7 C-k</code> swallows
seven whole line. As a bonus, we get the <code>kill-whole-line</code> (<code>C-S-backspace</code>)
behavior by doing <code>C-1 C-k</code> (I prefer <code>M-1</code> to <code>C-1</code> for easy stroke.).
</p>
</div>
</div>

<div id="outline-container-org195504f" class="outline-4">
<h4 id="org195504f"><span class="section-number-4">4.3.14</span> <code>Expand-region</code> - Smart region selection</h4>
<div class="outline-text-4" id="text-4-3-14">
<p>
Wherever you are in a file, and whatever the type of file, you can
slowly increase a region selection by logical segments by using the
<a href="https://github.com/magnars/expand-region.el">expand-region</a> project.
</p>

<p>
However, the normal experience for <code>expand-region</code> is interactive, expected to
be called repeatedly to expand and contract the regions based on syntax, and
whatnot. Since I am seldom sure what I will select if I give this function a
numeric prefix, I created a wrapper function that will (when given a number),
just select the number of lines for the region. Select the current line with a
0 argument. No argument (well, <code>lines</code> is given 1 with no argument), then it
just calls original <code>expand-region</code> (Taken from <a href="https://github.com/howardabrams/dot-files/blob/master/emacs.org">here</a>):
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #78c5d6;">(</span><span style="color: #F0DFAF; font-weight: bold;">use-package</span> <span style="color: #BFEBBF;">expand-region</span>  
  <span style="color: #DCDCCC; font-weight: bold;">:ensure</span> t
  <span style="color: #DCDCCC; font-weight: bold;">:defer</span> t
  <span style="color: #DCDCCC; font-weight: bold;">:config</span>
  <span style="color: #bf62a6;">(</span><span style="color: #F0DFAF; font-weight: bold;">defun</span> <span style="color: #93E0E3;">ha/expand-region</span> <span style="color: #459ba8;">(</span>lines<span style="color: #459ba8;">)</span>
    <span style="color: #9FC59F;">"Prefix-oriented wrapper around Magnar's `</span><span style="color: #BFEBBF;">er/expand-region</span><span style="color: #9FC59F;">'.</span>

<span style="color: #9FC59F;">Call with LINES equal to 1 (given no prefix), it expands the</span>
<span style="color: #9FC59F;">region as normal.  When LINES given a positive number, selects</span>
<span style="color: #9FC59F;">the current line and number of lines specified.  When LINES is a</span>
<span style="color: #9FC59F;">negative number, selects the current line and the previous lines</span>
<span style="color: #9FC59F;">specified.  Select the current line if the LINES prefix is zero."</span>
    <span style="color: #459ba8;">(</span><span style="color: #F0DFAF; font-weight: bold;">interactive</span> <span style="color: #CC9393;">"p"</span><span style="color: #459ba8;">)</span>
    <span style="color: #459ba8;">(</span><span style="color: #F0DFAF; font-weight: bold;">cond</span> <span style="color: #e868a2;">(</span><span style="color: #79c267;">(</span>= lines 1<span style="color: #79c267;">)</span>   <span style="color: #79c267;">(</span>er/expand-region 1<span style="color: #79c267;">)</span><span style="color: #e868a2;">)</span>
          <span style="color: #e868a2;">(</span><span style="color: #79c267;">(</span>&lt; lines 0<span style="color: #79c267;">)</span>   <span style="color: #79c267;">(</span>ha/expand-previous-line-as-region lines<span style="color: #79c267;">)</span><span style="color: #e868a2;">)</span>
          <span style="color: #e868a2;">(</span>t             <span style="color: #79c267;">(</span>ha/expand-next-line-as-region <span style="color: #f28c33;">(</span>1+ lines<span style="color: #f28c33;">)</span><span style="color: #79c267;">)</span><span style="color: #e868a2;">)</span><span style="color: #459ba8;">)</span><span style="color: #bf62a6;">)</span>

  <span style="color: #bf62a6;">(</span><span style="color: #F0DFAF; font-weight: bold;">defun</span> <span style="color: #93E0E3;">ha/expand-next-line-as-region</span> <span style="color: #459ba8;">(</span>lines<span style="color: #459ba8;">)</span>
    <span style="color: #459ba8;">(</span>message <span style="color: #CC9393;">"lines = %d"</span> lines<span style="color: #459ba8;">)</span>
    <span style="color: #459ba8;">(</span>beginning-of-line<span style="color: #459ba8;">)</span>
    <span style="color: #459ba8;">(</span>set-mark <span style="color: #e868a2;">(</span>point<span style="color: #e868a2;">)</span><span style="color: #459ba8;">)</span>
    <span style="color: #459ba8;">(</span>end-of-line lines<span style="color: #459ba8;">)</span><span style="color: #bf62a6;">)</span>

  <span style="color: #bf62a6;">(</span><span style="color: #F0DFAF; font-weight: bold;">defun</span> <span style="color: #93E0E3;">ha/expand-previous-line-as-region</span> <span style="color: #459ba8;">(</span>lines<span style="color: #459ba8;">)</span>
    <span style="color: #459ba8;">(</span>end-of-line<span style="color: #459ba8;">)</span>
    <span style="color: #459ba8;">(</span>set-mark <span style="color: #e868a2;">(</span>point<span style="color: #e868a2;">)</span><span style="color: #459ba8;">)</span>
    <span style="color: #459ba8;">(</span>beginning-of-line <span style="color: #e868a2;">(</span>1+ lines<span style="color: #e868a2;">)</span><span style="color: #459ba8;">)</span><span style="color: #bf62a6;">)</span>

  <span style="color: #DCDCCC; font-weight: bold;">:bind</span> <span style="color: #bf62a6;">(</span><span style="color: #459ba8;">(</span><span style="color: #CC9393;">"C-="</span> . ha/expand-region<span style="color: #459ba8;">)</span>     <span style="color: #5F7F5F;">; </span><span style="color: #7F9F7F;">wrapped version of `</span><span style="color: #BFEBBF;">er/expand-region</span><span style="color: #7F9F7F;">'</span>
         <span style="color: #459ba8;">(</span><span style="color: #CC9393;">"C--"</span> . er/contract-region<span style="color: #459ba8;">)</span><span style="color: #bf62a6;">)</span><span style="color: #78c5d6;">)</span>
</pre>
</div>

<p>
I chose <code>C-0</code> instead of <code>C-1</code> as the prefix argument to select the current
line, because It's easier to stroke <code>C-0</code> than <code>C-1</code>.
</p>

<p>
Give it a try, and you will know what it will do quickly.
</p>
</div>
</div>
