init.org
*** =Fancy-narrow= - Smart narrowing

[[https://www.gnu.org/software/emacs/manual/html_node/emacs/Narrowing.html#Narrowing][Narrowing]] is one of the fascinating features in Emacs, great for code-reviews
and other presentations. It works well but still can be better.

This [[http://endlessparentheses.com/emacs-narrow-or-widen-dwim.html][nifty function]] is a nice replacement for many other narrowing keybindings
that I use, it is smart (/do what I mean/):

#+BEGIN_SRC emacs-lisp :tangle yes
  (defun narrow-or-widen-dwim (p)
    "If the buffer is narrowed, it widens. Otherwise, it narrows intelligently.
     Intelligently means: region, subtree, or defun, whichever
     applies first.

     With prefix P, don't widen, just narrow even if buffer is
     already narrowed."
    (interactive "P")
    (declare (interactive-only))
    (cond ((and (buffer-narrowed-p) (not p)) (widen))
          ((region-active-p)
           (narrow-to-region (region-beginning) (region-end)))
          ((derived-mode-p 'org-mode) (org-narrow-to-subtree))
          (t (narrow-to-defun))))

  (global-set-key (kbd "C-x n x") 'narrow-or-widen-dwim)
#+END_SRC

Unlike =narrow-to-region=, which completely hides text outside the narrowed
region, this [[https://github.com/Bruce-Connor/fancy-narrow][fancy-narrow]] package simply deemphasizes the text, makes it
readonly, and makes it unreachable (hightlight instead of narrow). With this
=fancy-narrow= package, we can define a smart =hightlight-section= function
with /prefix argument/:

#+BEGIN_SRC emacs-lisp :tangle yes
  (use-package fancy-narrow
    :ensure t
    :config
    (defun ha/highlight-block ()
      "Highlights a 'block' in a buffer defined by the first blank
       line before and after the current cursor position. Uses the
       'fancy-narrow' mode to high-light the block."
      (interactive)
      (let (cur beg end)
        (setq cur (point))
        (setq end (or (re-search-forward  "^\s*$" nil t) (point-max)))
        (goto-char cur)
        (setq beg (or (re-search-backward "^\s*$" nil t) (point-min)))
        (fancy-narrow-to-region beg end)
        (goto-char cur)))

    (defun ha/highlight-section (num)
      "If some of the buffer is highlighted with the `fancy-narrow'
       mode, then un-highlight it by calling `fancy-widen'.

       If region is active, call `fancy-narrow-to-region'.

       If NUM is 0, highlight the current block (delimited by blank
       lines). If NUM is positive or negative, highlight that number
       of lines.  Otherwise, called `fancy-narrow-to-defun', to
       highlight current function."
      (interactive "p")
      (cond
       ((fancy-narrow-active-p)  (fancy-widen))
       ((region-active-p)        (fancy-narrow-to-region (region-beginning) (region-end)))
       ((= num 0)                (ha/highlight-block))
       ((= num 1)                (fancy-narrow-to-defun))
       (t                        (progn (ha/expand-region num)
                                        (fancy-narrow-to-region (region-beginning) (region-end))
                                        (setq mark-active nil)))))
  
    :bind (("C-x n ." . ha/highlight-section)))
    ;; :bind (("C-M-+" . ha/highlight-section)
    ;;        ("C-<f12>" . ha/highlight-section)))

  ;; (use-package fancy-narrow
  ;;   :ensure t
  ;;   :config
  ;;   (defun ha/highlight-block ()
  ;;     "Highlights a 'block' in a buffer defined by the first blank
  ;;      line before and after the current cursor position. Uses the
  ;;      `fancy-narrow' mode to high-light the block."
  ;;     (interactive)
  ;;     (let (cur beg end)
  ;;       (setq cur (point))
  ;;       (setq end (or (re-search-forward  "^\s*$" nil t) (point-max)))
  ;;       (goto-char cur)
  ;;       (setq beg (or (re-search-backward "^\s*$" nil t) (point-min)))
  ;;       (fancy-narrow-to-region beg end)
  ;;       (goto-char cur)))

  ;;   (defun ha/highlight-section (num)
  ;;     "If some of the buffer is highlighted with the `fancy-narrow'
  ;;      mode, then un-highlight it by calling `fancy-widen'.

  ;;      If region is active, call `fancy-narrow-to-region'.

  ;;      If NUM is 0, call `fancy-narrow-to-defun', to highlight
  ;;      current function. If NUM is 1, highlight the current
  ;;      block (delimited by blank lines). Otherwise, highlight that
  ;;      number of lines."
  ;;     (interactive "p")
  ;;     (cond
  ;;      ((fancy-narrow-active-p)  (fancy-widen))
  ;;      ((region-active-p)        (fancy-narrow-to-region (region-beginning) (region-end)))
  ;;      ((= num 0)                (fancy-narrow-to-defun))
  ;;      ((= num 1)                (ha/highlight-block))
  ;;      (t                        (progn (er/expand-region num) ; depend on `er/expand-region'
  ;;                                       (fancy-narrow-to-region (region-beginning) (region-end))
  ;;                                       (setq mark-active nil)))))

  ;;   ;; highlight-section is smart enough
  ;;   :bind (("C-x n ." . ha/highlight-section)))
#+END_SRC
