init.html

<div id="outline-container-org1d4939e" class="outline-4">
<h4 id="org1d4939e"><span class="section-number-4">4.3.15</span> <code>Fancy-narrow</code> - Smart narrowing</h4>
<div class="outline-text-4" id="text-4-3-15">
<p>
<a href="https://www.gnu.org/software/emacs/manual/html_node/emacs/Narrowing.html#Narrowing">Narrowing</a> is one of the fascinating features in Emacs, great for code-reviews
and other presentations. It works well but still can be better.
</p>

<p>
This <a href="http://endlessparentheses.com/emacs-narrow-or-widen-dwim.html">nifty function</a> is a nice replacement for many other narrowing keybindings
that I use, it is smart (<i>do what I mean</i>):
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #78c5d6;">(</span><span style="color: #F0DFAF; font-weight: bold;">defun</span> <span style="color: #93E0E3;">narrow-or-widen-dwim</span> <span style="color: #bf62a6;">(</span>p<span style="color: #bf62a6;">)</span>
  <span style="color: #9FC59F;">"If the buffer is narrowed, it widens. Otherwise, it narrows intelligently.</span>
<span style="color: #9FC59F;">   Intelligently means: region, subtree, or defun, whichever</span>
<span style="color: #9FC59F;">   applies first.</span>

<span style="color: #9FC59F;">   With prefix P, don't widen, just narrow even if buffer is</span>
<span style="color: #9FC59F;">   already narrowed."</span>
  <span style="color: #bf62a6;">(</span><span style="color: #F0DFAF; font-weight: bold;">interactive</span> <span style="color: #CC9393;">"P"</span><span style="color: #bf62a6;">)</span>
  <span style="color: #bf62a6;">(</span><span style="color: #F0DFAF; font-weight: bold;">declare</span> <span style="color: #459ba8;">(</span>interactive-only<span style="color: #459ba8;">)</span><span style="color: #bf62a6;">)</span>
  <span style="color: #bf62a6;">(</span><span style="color: #F0DFAF; font-weight: bold;">cond</span> <span style="color: #459ba8;">(</span><span style="color: #e868a2;">(</span><span style="color: #F0DFAF; font-weight: bold;">and</span> <span style="color: #79c267;">(</span>buffer-narrowed-p<span style="color: #79c267;">)</span> <span style="color: #79c267;">(</span>not p<span style="color: #79c267;">)</span><span style="color: #e868a2;">)</span> <span style="color: #e868a2;">(</span>widen<span style="color: #e868a2;">)</span><span style="color: #459ba8;">)</span>
        <span style="color: #459ba8;">(</span><span style="color: #e868a2;">(</span>region-active-p<span style="color: #e868a2;">)</span>
         <span style="color: #e868a2;">(</span>narrow-to-region <span style="color: #79c267;">(</span>region-beginning<span style="color: #79c267;">)</span> <span style="color: #79c267;">(</span>region-end<span style="color: #79c267;">)</span><span style="color: #e868a2;">)</span><span style="color: #459ba8;">)</span>
        <span style="color: #459ba8;">(</span><span style="color: #e868a2;">(</span>derived-mode-p 'org-mode<span style="color: #e868a2;">)</span> <span style="color: #e868a2;">(</span>org-narrow-to-subtree<span style="color: #e868a2;">)</span><span style="color: #459ba8;">)</span>
        <span style="color: #459ba8;">(</span>t <span style="color: #e868a2;">(</span>narrow-to-defun<span style="color: #e868a2;">)</span><span style="color: #459ba8;">)</span><span style="color: #bf62a6;">)</span><span style="color: #78c5d6;">)</span>

<span style="color: #78c5d6;">(</span>global-set-key <span style="color: #bf62a6;">(</span>kbd <span style="color: #CC9393;">"C-x n x"</span><span style="color: #bf62a6;">)</span> 'narrow-or-widen-dwim<span style="color: #78c5d6;">)</span>
</pre>
</div>

<p>
Unlike <code>narrow-to-region</code>, which completely hides text outside the narrowed
region, this <a href="https://github.com/Bruce-Connor/fancy-narrow">fancy-narrow</a> package simply deemphasizes the text, makes it
readonly, and makes it unreachable (hightlight instead of narrow). With this
<code>fancy-narrow</code> package, we can define a smart <code>hightlight-section</code> function
with <i>prefix argument</i>:
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #78c5d6;">(</span><span style="color: #F0DFAF; font-weight: bold;">use-package</span> <span style="color: #BFEBBF;">fancy-narrow</span>
  <span style="color: #DCDCCC; font-weight: bold;">:ensure</span> t
  <span style="color: #DCDCCC; font-weight: bold;">:config</span>
  <span style="color: #bf62a6;">(</span><span style="color: #F0DFAF; font-weight: bold;">defun</span> <span style="color: #93E0E3;">ha/highlight-block</span> <span style="color: #459ba8;">()</span>
    <span style="color: #9FC59F;">"Highlights a 'block' in a buffer defined by the first blank</span>
<span style="color: #9FC59F;">     line before and after the current cursor position. Uses the</span>
<span style="color: #9FC59F;">     'fancy-narrow' mode to high-light the block."</span>
    <span style="color: #459ba8;">(</span><span style="color: #F0DFAF; font-weight: bold;">interactive</span><span style="color: #459ba8;">)</span>
    <span style="color: #459ba8;">(</span><span style="color: #F0DFAF; font-weight: bold;">let</span> <span style="color: #e868a2;">(</span>cur beg end<span style="color: #e868a2;">)</span>
      <span style="color: #e868a2;">(</span><span style="color: #F0DFAF; font-weight: bold;">setq</span> cur <span style="color: #79c267;">(</span>point<span style="color: #79c267;">)</span><span style="color: #e868a2;">)</span>
      <span style="color: #e868a2;">(</span><span style="color: #F0DFAF; font-weight: bold;">setq</span> end <span style="color: #79c267;">(</span><span style="color: #F0DFAF; font-weight: bold;">or</span> <span style="color: #f28c33;">(</span>re-search-forward  <span style="color: #CC9393;">"^\s*$"</span> nil t<span style="color: #f28c33;">)</span> <span style="color: #f28c33;">(</span>point-max<span style="color: #f28c33;">)</span><span style="color: #79c267;">)</span><span style="color: #e868a2;">)</span>
      <span style="color: #e868a2;">(</span>goto-char cur<span style="color: #e868a2;">)</span>
      <span style="color: #e868a2;">(</span><span style="color: #F0DFAF; font-weight: bold;">setq</span> beg <span style="color: #79c267;">(</span><span style="color: #F0DFAF; font-weight: bold;">or</span> <span style="color: #f28c33;">(</span>re-search-backward <span style="color: #CC9393;">"^\s*$"</span> nil t<span style="color: #f28c33;">)</span> <span style="color: #f28c33;">(</span>point-min<span style="color: #f28c33;">)</span><span style="color: #79c267;">)</span><span style="color: #e868a2;">)</span>
      <span style="color: #e868a2;">(</span>fancy-narrow-to-region beg end<span style="color: #e868a2;">)</span>
      <span style="color: #e868a2;">(</span>goto-char cur<span style="color: #e868a2;">)</span><span style="color: #459ba8;">)</span><span style="color: #bf62a6;">)</span>

  <span style="color: #bf62a6;">(</span><span style="color: #F0DFAF; font-weight: bold;">defun</span> <span style="color: #93E0E3;">ha/highlight-section</span> <span style="color: #459ba8;">(</span>num<span style="color: #459ba8;">)</span>
    <span style="color: #9FC59F;">"If some of the buffer is highlighted with the `</span><span style="color: #BFEBBF;">fancy-narrow</span><span style="color: #9FC59F;">'</span>
<span style="color: #9FC59F;">     mode, then un-highlight it by calling `</span><span style="color: #BFEBBF;">fancy-widen</span><span style="color: #9FC59F;">'.</span>

<span style="color: #9FC59F;">     If region is active, call `</span><span style="color: #BFEBBF;">fancy-narrow-to-region</span><span style="color: #9FC59F;">'.</span>

<span style="color: #9FC59F;">     If NUM is 0, highlight the current block (delimited by blank</span>
<span style="color: #9FC59F;">     lines). If NUM is positive or negative, highlight that number</span>
<span style="color: #9FC59F;">     of lines.  Otherwise, called `</span><span style="color: #BFEBBF;">fancy-narrow-to-defun</span><span style="color: #9FC59F;">', to</span>
<span style="color: #9FC59F;">     highlight current function."</span>
    <span style="color: #459ba8;">(</span><span style="color: #F0DFAF; font-weight: bold;">interactive</span> <span style="color: #CC9393;">"p"</span><span style="color: #459ba8;">)</span>
    <span style="color: #459ba8;">(</span><span style="color: #F0DFAF; font-weight: bold;">cond</span>
     <span style="color: #e868a2;">(</span><span style="color: #79c267;">(</span>fancy-narrow-active-p<span style="color: #79c267;">)</span>  <span style="color: #79c267;">(</span>fancy-widen<span style="color: #79c267;">)</span><span style="color: #e868a2;">)</span>
     <span style="color: #e868a2;">(</span><span style="color: #79c267;">(</span>region-active-p<span style="color: #79c267;">)</span>        <span style="color: #79c267;">(</span>fancy-narrow-to-region <span style="color: #f28c33;">(</span>region-beginning<span style="color: #f28c33;">)</span> <span style="color: #f28c33;">(</span>region-end<span style="color: #f28c33;">)</span><span style="color: #79c267;">)</span><span style="color: #e868a2;">)</span>
     <span style="color: #e868a2;">(</span><span style="color: #79c267;">(</span>= num 0<span style="color: #79c267;">)</span>                <span style="color: #79c267;">(</span>ha/highlight-block<span style="color: #79c267;">)</span><span style="color: #e868a2;">)</span>
     <span style="color: #e868a2;">(</span><span style="color: #79c267;">(</span>= num 1<span style="color: #79c267;">)</span>                <span style="color: #79c267;">(</span>fancy-narrow-to-defun<span style="color: #79c267;">)</span><span style="color: #e868a2;">)</span>
     <span style="color: #e868a2;">(</span>t                        <span style="color: #79c267;">(</span><span style="color: #F0DFAF; font-weight: bold;">progn</span> <span style="color: #f28c33;">(</span>ha/expand-region num<span style="color: #f28c33;">)</span>
                                      <span style="color: #f28c33;">(</span>fancy-narrow-to-region <span style="color: #c5d647;">(</span>region-beginning<span style="color: #c5d647;">)</span> <span style="color: #c5d647;">(</span>region-end<span style="color: #c5d647;">)</span><span style="color: #f28c33;">)</span>
                                      <span style="color: #f28c33;">(</span><span style="color: #F0DFAF; font-weight: bold;">setq</span> mark-active nil<span style="color: #f28c33;">)</span><span style="color: #79c267;">)</span><span style="color: #e868a2;">)</span><span style="color: #459ba8;">)</span><span style="color: #bf62a6;">)</span>

  <span style="color: #DCDCCC; font-weight: bold;">:bind</span> <span style="color: #bf62a6;">(</span><span style="color: #459ba8;">(</span><span style="color: #CC9393;">"C-x n ."</span> . ha/highlight-section<span style="color: #459ba8;">)</span><span style="color: #bf62a6;">)</span><span style="color: #78c5d6;">)</span>
  <span style="color: #5F7F5F;">;; </span><span style="color: #7F9F7F;">:bind (("C-M-+" . ha/highlight-section)</span>
  <span style="color: #5F7F5F;">;;        </span><span style="color: #7F9F7F;">("C-&lt;f12&gt;" . ha/highlight-section)))</span>

<span style="color: #5F7F5F;">;; </span><span style="color: #7F9F7F;">(use-package fancy-narrow</span>
<span style="color: #5F7F5F;">;;   </span><span style="color: #7F9F7F;">:ensure t</span>
<span style="color: #5F7F5F;">;;   </span><span style="color: #7F9F7F;">:config</span>
<span style="color: #5F7F5F;">;;   </span><span style="color: #7F9F7F;">(defun ha/highlight-block ()</span>
<span style="color: #5F7F5F;">;;     </span><span style="color: #7F9F7F;">"Highlights a 'block' in a buffer defined by the first blank</span>
<span style="color: #5F7F5F;">;;      </span><span style="color: #7F9F7F;">line before and after the current cursor position. Uses the</span>
<span style="color: #5F7F5F;">;;      </span><span style="color: #7F9F7F;">`</span><span style="color: #BFEBBF;">fancy-narrow</span><span style="color: #7F9F7F;">' mode to high-light the block."</span>
<span style="color: #5F7F5F;">;;     </span><span style="color: #7F9F7F;">(interactive)</span>
<span style="color: #5F7F5F;">;;     </span><span style="color: #7F9F7F;">(let (cur beg end)</span>
<span style="color: #5F7F5F;">;;       </span><span style="color: #7F9F7F;">(setq cur (point))</span>
<span style="color: #5F7F5F;">;;       </span><span style="color: #7F9F7F;">(setq end (or (re-search-forward  "^\s*$" nil t) (point-max)))</span>
<span style="color: #5F7F5F;">;;       </span><span style="color: #7F9F7F;">(goto-char cur)</span>
<span style="color: #5F7F5F;">;;       </span><span style="color: #7F9F7F;">(setq beg (or (re-search-backward "^\s*$" nil t) (point-min)))</span>
<span style="color: #5F7F5F;">;;       </span><span style="color: #7F9F7F;">(fancy-narrow-to-region beg end)</span>
<span style="color: #5F7F5F;">;;       </span><span style="color: #7F9F7F;">(goto-char cur)))</span>

<span style="color: #5F7F5F;">;;   </span><span style="color: #7F9F7F;">(defun ha/highlight-section (num)</span>
<span style="color: #5F7F5F;">;;     </span><span style="color: #7F9F7F;">"If some of the buffer is highlighted with the `</span><span style="color: #BFEBBF;">fancy-narrow</span><span style="color: #7F9F7F;">'</span>
<span style="color: #5F7F5F;">;;      </span><span style="color: #7F9F7F;">mode, then un-highlight it by calling `</span><span style="color: #BFEBBF;">fancy-widen</span><span style="color: #7F9F7F;">'.</span>

<span style="color: #5F7F5F;">;;      </span><span style="color: #7F9F7F;">If region is active, call `</span><span style="color: #BFEBBF;">fancy-narrow-to-region</span><span style="color: #7F9F7F;">'.</span>

<span style="color: #5F7F5F;">;;      </span><span style="color: #7F9F7F;">If NUM is 0, call `</span><span style="color: #BFEBBF;">fancy-narrow-to-defun</span><span style="color: #7F9F7F;">', to highlight</span>
<span style="color: #5F7F5F;">;;      </span><span style="color: #7F9F7F;">current function. If NUM is 1, highlight the current</span>
<span style="color: #5F7F5F;">;;      </span><span style="color: #7F9F7F;">block (delimited by blank lines). Otherwise, highlight that</span>
<span style="color: #5F7F5F;">;;      </span><span style="color: #7F9F7F;">number of lines."</span>
<span style="color: #5F7F5F;">;;     </span><span style="color: #7F9F7F;">(interactive "p")</span>
<span style="color: #5F7F5F;">;;     </span><span style="color: #7F9F7F;">(cond</span>
<span style="color: #5F7F5F;">;;      </span><span style="color: #7F9F7F;">((fancy-narrow-active-p)  (fancy-widen))</span>
<span style="color: #5F7F5F;">;;      </span><span style="color: #7F9F7F;">((region-active-p)        (fancy-narrow-to-region (region-beginning) (region-end)))</span>
<span style="color: #5F7F5F;">;;      </span><span style="color: #7F9F7F;">((= num 0)                (fancy-narrow-to-defun))</span>
<span style="color: #5F7F5F;">;;      </span><span style="color: #7F9F7F;">((= num 1)                (ha/highlight-block))</span>
<span style="color: #5F7F5F;">;;      </span><span style="color: #7F9F7F;">(t                        (progn (er/expand-region num) ; depend on `</span><span style="color: #BFEBBF;">er/expand-region</span><span style="color: #7F9F7F;">'</span>
<span style="color: #5F7F5F;">;;                                       </span><span style="color: #7F9F7F;">(fancy-narrow-to-region (region-beginning) (region-end))</span>
<span style="color: #5F7F5F;">;;                                       </span><span style="color: #7F9F7F;">(setq mark-active nil)))))</span>

<span style="color: #5F7F5F;">;;   </span><span style="color: #7F9F7F;">;; highlight-section is smart enough</span>
<span style="color: #5F7F5F;">;;   </span><span style="color: #7F9F7F;">:bind (("C-x n ." . ha/highlight-section)))</span>
</pre>
</div>
</div>
</div>
