init.org
*** =M-;= : Smart Comment

The [[https://github.com/paldepind/smart-comment][smart-comment]] project has the nice feature of commenting a line without
being at the beginning of the line =M-;= (default comment in the middle of the
line is to split it). Also has the ability (with the =C-u= prefix) to mark
comments as things to be deleted.

#+BEGIN_SRC emacs-lisp :tangle yes
  (use-package smart-comment
    :bind ("M-;" . smart-comment))
#+END_SRC
*** =M-p= and =M-n= : Smart Scan

Use the =M-n= to search the buffer for the word the cursor is currently
pointing. =M-p= to go backwards. See [[http://www.masteringemacs.org/articles/2011/01/14/effective-editing-movement/][this essay]] for details.

#+BEGIN_SRC emacs-lisp :tangle yes
  (use-package smartscan
    :ensure t
    :bind
    ("M-n" . smartscan-symbol-go-forward)
    ("M-p" . smartscan-symbol-go-backward))
#+END_SRC
*** Better Searching and Visual Regular Expressions

The [[https://github.com/syohex/emacs-anzu][anzu]] package enhances =query-replace= and =query-replace-regexp= by showing
total matches and current match position.

#+BEGIN_SRC emacs-lisp :tangle yes
  (use-package anzu
    :diminish anzu-mode
    :bind (("M-%" . anzu-query-replace)
           ("C-M-%" . anzu-query-replace-regexp))
    :config (global-anzu-mode))
#+END_SRC

The [[https://github.com/benma/visual-regexp.el][Visual Regular Expressions]] project highlights the matches while you try to
remember the differences between Perl's regular expressions and Emacs'...

Begin with =C-c r= then type the regexp. To see the highlighted matches, type
=C-c a= before you hit =RET= to accept it.

#+BEGIN_SRC emacs-lisp :tangle yes
  (use-package visual-regexp
    :ensure t
    :init
    ;; use modern regular expressions instead of Emacs-style regular expressions
    (use-package visual-regexp-steroids :ensure t)

    :bind (("C-c r" . vr/replace)
           ("C-c q" . vr/query-replace))

    ;; if you use `multiple-cursors', this is for you:
    :config (use-package  multiple-cursors
              :bind ("C-c m" . vr/mc-mark)))
#+END_SRC
** Editing
*** Coding - always UTF-8

Always, always UTF-8.

#+BEGIN_SRC emacs-lisp :tangle yes
  (prefer-coding-system 'utf-8)
  (set-default-coding-systems 'utf-8)
  (set-terminal-coding-system 'utf-8)
  (set-keyboard-coding-system 'utf-8)
  (setq default-buffer-file-coding-system 'utf-8)
#+END_SRC
*** Tabs, spaces, enters
**** Tabs vs. Space

Tabs are evil! I want spaces instead of tabs, and want exactly 2 spaces instead
of a tab. Note to self: Apparently emacs is smart enough to not do this in
Python, which is a good thing.

#+BEGIN_SRC emacs-lisp :tangle yes
  ;; make indentation commands use space only (never tab character)
  (setq-default indent-tabs-mode nil)

  ;; set current buffer's tab char's display width to 2 spaces
  (setq tab-width 2)
#+END_SRC

**** Indent or Complete - smart tab behavior

#+BEGIN_SRC emacs-lisp :tangle yes
  (setq-default tab-always-indent 'complete)
#+END_SRC
**** Sentences end with one space

#+BEGIN_SRC emacs-lisp :tangle yes
  (setq sentence-end-double-space nil)    ; Sentences end with one space
#+END_SRC
**** Bind =ENT= to =newline-and-indent=

By default, Emacs won't indent when press RET because the command bound to RET
is newline. You can enable automatic indentation by binding =RET= to
=newline-and-indent=.

#+BEGIN_SRC emacs-lisp :tangle yes
  (global-set-key (kbd "RET") 'newline-and-indent)
#+END_SRC
**** Always newline at end of file

#+BEGIN_SRC emacs-lisp :tangle yes
  (setq require-final-newline t)
#+END_SRC
*** Delete the selection with a keypress

#+BEGIN_SRC emacs-lisp :tangle yes
  (delete-selection-mode t)
#+END_SRC
