init.html
<div id="outline-container-org2cf1f28" class="outline-4">
<h4 id="org2cf1f28"><span class="section-number-4">4.3.16</span> <code>M-;</code> : Smart Comment</h4>
<div class="outline-text-4" id="text-4-3-16">
<p>
The <a href="https://github.com/paldepind/smart-comment">smart-comment</a> project has the nice feature of commenting a line without
being at the beginning of the line <code>M-;</code> (default comment in the middle of the
line is to split it). Also has the ability (with the <code>C-u</code> prefix) to mark
comments as things to be deleted.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #78c5d6;">(</span><span style="color: #F0DFAF; font-weight: bold;">use-package</span> <span style="color: #BFEBBF;">smart-comment</span>
  <span style="color: #DCDCCC; font-weight: bold;">:bind</span> <span style="color: #bf62a6;">(</span><span style="color: #CC9393;">"M-;"</span> . smart-comment<span style="color: #bf62a6;">)</span><span style="color: #78c5d6;">)</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-org391a8f6" class="outline-4">
<h4 id="org391a8f6"><span class="section-number-4">4.3.17</span> <code>M-p</code> and <code>M-n</code> : Smart Scan</h4>
<div class="outline-text-4" id="text-4-3-17">
<p>
Use the <code>M-n</code> to search the buffer for the word the cursor is currently
pointing. <code>M-p</code> to go backwards. See <a href="http://www.masteringemacs.org/articles/2011/01/14/effective-editing-movement/">this essay</a> for details.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #78c5d6;">(</span><span style="color: #F0DFAF; font-weight: bold;">use-package</span> <span style="color: #BFEBBF;">smartscan</span>
  <span style="color: #DCDCCC; font-weight: bold;">:ensure</span> t
  <span style="color: #DCDCCC; font-weight: bold;">:bind</span>
  <span style="color: #bf62a6;">(</span><span style="color: #CC9393;">"M-n"</span> . smartscan-symbol-go-forward<span style="color: #bf62a6;">)</span>
  <span style="color: #bf62a6;">(</span><span style="color: #CC9393;">"M-p"</span> . smartscan-symbol-go-backward<span style="color: #bf62a6;">)</span><span style="color: #78c5d6;">)</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-orge19c167" class="outline-4">
<h4 id="orge19c167"><span class="section-number-4">4.3.18</span> Better Searching and Visual Regular Expressions</h4>
<div class="outline-text-4" id="text-4-3-18">
<p>
The <a href="https://github.com/syohex/emacs-anzu">anzu</a> package enhances <code>query-replace</code> and <code>query-replace-regexp</code> by showing
total matches and current match position.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #78c5d6;">(</span><span style="color: #F0DFAF; font-weight: bold;">use-package</span> <span style="color: #BFEBBF;">anzu</span>
  <span style="color: #DCDCCC; font-weight: bold;">:diminish</span> anzu-mode
  <span style="color: #DCDCCC; font-weight: bold;">:bind</span> <span style="color: #bf62a6;">(</span><span style="color: #459ba8;">(</span><span style="color: #CC9393;">"M-%"</span> . anzu-query-replace<span style="color: #459ba8;">)</span>
         <span style="color: #459ba8;">(</span><span style="color: #CC9393;">"C-M-%"</span> . anzu-query-replace-regexp<span style="color: #459ba8;">)</span><span style="color: #bf62a6;">)</span>
  <span style="color: #DCDCCC; font-weight: bold;">:config</span> <span style="color: #bf62a6;">(</span>global-anzu-mode<span style="color: #bf62a6;">)</span><span style="color: #78c5d6;">)</span>
</pre>
</div>

<p>
The <a href="https://github.com/benma/visual-regexp.el">Visual Regular Expressions</a> project highlights the matches while you try to
remember the differences between Perl's regular expressions and Emacs'&#x2026;
</p>

<p>
Begin with <code>C-c r</code> then type the regexp. To see the highlighted matches, type
<code>C-c a</code> before you hit <code>RET</code> to accept it.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #78c5d6;">(</span><span style="color: #F0DFAF; font-weight: bold;">use-package</span> <span style="color: #BFEBBF;">visual-regexp</span>
  <span style="color: #DCDCCC; font-weight: bold;">:ensure</span> t
  <span style="color: #DCDCCC; font-weight: bold;">:init</span>
  <span style="color: #5F7F5F;">;; </span><span style="color: #7F9F7F;">use modern regular expressions instead of Emacs-style regular expressions</span>
  <span style="color: #bf62a6;">(</span><span style="color: #F0DFAF; font-weight: bold;">use-package</span> <span style="color: #BFEBBF;">visual-regexp-steroids</span> <span style="color: #DCDCCC; font-weight: bold;">:ensure</span> t<span style="color: #bf62a6;">)</span>

  <span style="color: #DCDCCC; font-weight: bold;">:bind</span> <span style="color: #bf62a6;">(</span><span style="color: #459ba8;">(</span><span style="color: #CC9393;">"C-c r"</span> . vr/replace<span style="color: #459ba8;">)</span>
         <span style="color: #459ba8;">(</span><span style="color: #CC9393;">"C-c q"</span> . vr/query-replace<span style="color: #459ba8;">)</span><span style="color: #bf62a6;">)</span>

  <span style="color: #5F7F5F;">;; </span><span style="color: #7F9F7F;">if you use `</span><span style="color: #BFEBBF;">multiple-cursors</span><span style="color: #7F9F7F;">', this is for you:</span>
  <span style="color: #DCDCCC; font-weight: bold;">:config</span> <span style="color: #bf62a6;">(</span><span style="color: #F0DFAF; font-weight: bold;">use-package</span>  <span style="color: #BFEBBF;">multiple-cursors</span>
            <span style="color: #DCDCCC; font-weight: bold;">:bind</span> <span style="color: #459ba8;">(</span><span style="color: #CC9393;">"C-c m"</span> . vr/mc-mark<span style="color: #459ba8;">)</span><span style="color: #bf62a6;">)</span><span style="color: #78c5d6;">)</span>
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-org72f0f95" class="outline-3">
<h3 id="org72f0f95"><span class="section-number-3">4.4</span> Editing</h3>
<div class="outline-text-3" id="text-4-4">
</div>
<div id="outline-container-orgac74a56" class="outline-4">
<h4 id="orgac74a56"><span class="section-number-4">4.4.1</span> Coding - always UTF-8</h4>
<div class="outline-text-4" id="text-4-4-1">
<p>
Always, always UTF-8.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #78c5d6;">(</span>prefer-coding-system 'utf-8<span style="color: #78c5d6;">)</span>
<span style="color: #78c5d6;">(</span>set-default-coding-systems 'utf-8<span style="color: #78c5d6;">)</span>
<span style="color: #78c5d6;">(</span>set-terminal-coding-system 'utf-8<span style="color: #78c5d6;">)</span>
<span style="color: #78c5d6;">(</span>set-keyboard-coding-system 'utf-8<span style="color: #78c5d6;">)</span>
<span style="color: #78c5d6;">(</span><span style="color: #F0DFAF; font-weight: bold;">setq</span> default-buffer-file-coding-system 'utf-8<span style="color: #78c5d6;">)</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-orgb2ec81d" class="outline-4">
<h4 id="orgb2ec81d"><span class="section-number-4">4.4.2</span> Tabs, spaces, enters</h4>
<div class="outline-text-4" id="text-4-4-2">
</div>
<ul class="org-ul">
<li><a id="org2ead47b"></a>Tabs vs. Space<br />
<div class="outline-text-5" id="text-org2ead47b">
<p>
Tabs are evil! I want spaces instead of tabs, and want exactly 2 spaces instead
of a tab. Note to self: Apparently emacs is smart enough to not do this in
Python, which is a good thing.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #5F7F5F;">;; </span><span style="color: #7F9F7F;">make indentation commands use space only (never tab character)</span>
<span style="color: #78c5d6;">(</span><span style="color: #F0DFAF; font-weight: bold;">setq-default</span> indent-tabs-mode nil<span style="color: #78c5d6;">)</span>

<span style="color: #5F7F5F;">;; </span><span style="color: #7F9F7F;">set current buffer's tab char's display width to 2 spaces</span>
<span style="color: #78c5d6;">(</span><span style="color: #F0DFAF; font-weight: bold;">setq</span> tab-width 2<span style="color: #78c5d6;">)</span>
</pre>
</div>
</div>
</li>

<li><a id="orge9935de"></a>Indent or Complete - smart tab behavior<br />
<div class="outline-text-5" id="text-orge9935de">
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #78c5d6;">(</span><span style="color: #F0DFAF; font-weight: bold;">setq-default</span> tab-always-indent 'complete<span style="color: #78c5d6;">)</span>
</pre>
</div>
</div>
</li>
<li><a id="orgf3c8534"></a>Sentences end with one space<br />
<div class="outline-text-5" id="text-orgf3c8534">
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #78c5d6;">(</span><span style="color: #F0DFAF; font-weight: bold;">setq</span> sentence-end-double-space nil<span style="color: #78c5d6;">)</span>    <span style="color: #5F7F5F;">; </span><span style="color: #7F9F7F;">Sentences end with one space</span>
</pre>
</div>
</div>
</li>
<li><a id="orgb347d2a"></a>Bind <code>ENT</code> to <code>newline-and-indent</code><br />
<div class="outline-text-5" id="text-orgb347d2a">
<p>
By default, Emacs won't indent when press RET because the command bound to RET
is newline. You can enable automatic indentation by binding <code>RET</code> to
<code>newline-and-indent</code>.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #78c5d6;">(</span>global-set-key <span style="color: #bf62a6;">(</span>kbd <span style="color: #CC9393;">"RET"</span><span style="color: #bf62a6;">)</span> 'newline-and-indent<span style="color: #78c5d6;">)</span>
</pre>
</div>
</div>
</li>
<li><a id="orgd9324ae"></a>Always newline at end of file<br />
<div class="outline-text-5" id="text-orgd9324ae">
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #78c5d6;">(</span><span style="color: #F0DFAF; font-weight: bold;">setq</span> require-final-newline t<span style="color: #78c5d6;">)</span>
</pre>
</div>
</div>
</li>
</ul>
</div>
<div id="outline-container-org3ebc4a3" class="outline-4">
<h4 id="org3ebc4a3"><span class="section-number-4">4.4.3</span> Delete the selection with a keypress</h4>
<div class="outline-text-4" id="text-4-4-3">
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #78c5d6;">(</span>delete-selection-mode t<span style="color: #78c5d6;">)</span>
</pre>
</div>
</div>
</div>
