init.org
*** =Whitespace= - show and clean devil

We want to show trailing whitespace. Trailing whitespace is the devil.

#+BEGIN_SRC emacs-lisp :tangle yes
  (use-package whitespace
    :bind ("C-c x w" . whitespace-mode)
    :diminish whitespace-mode
    :init
    ;; Indicate trailing empty lines in the GUI
    (set-default 'indicate-empty-lines t)
    (setq show-trailing-whitespace t)

    ;; limit line length                                                                    
    (setq whitespace-line-column 80)
    ;; Here are the things that whitespace-mode should highlight
    (setq whitespace-style '(face tabs empty trailing lines-tail))

    ;; Display pretty things for newlines and tabs (nothing for spaces)
    (setq whitespace-display-mappings
          ;; all numbers are Unicode codepoint in decimal. e.g. (insert-char 182 1)
          ;; 32 SPACE, 183 MIDDLE DOT
          '((space-mark nil)
            ;; 10 LINE FEED
            ;;(newline-mark 10 [172 10])
            (newline-mark nil)
            ;; 9 TAB, MIDDLE DOT
            (tab-mark 9 [183 9] [92 9])))

    ;; Disable it in certain modes where whitespace doesn't make sense.
    (setq whitespace-global-modes '(not org-mode
                                      eshell-mode
                                      shell-mode
                                      web-mode
                                      log4j-mode
                                      dired-mode
                                      emacs-lisp-mode
                                      clojure-mode
                                      lisp-mode)))
#+END_SRC

When you press =RET= to create a newline and got indented by
=eletric-indent-mode=, you have appropriate whitespace for indenting. But, if
you leave the line blank and move to the next line, the whitespace becomes
useless. =Clean-aindent-mode= helps [[https://www.emacswiki.org/emacs/CleanAutoIndent][clean up unused whitespace]]. Turn it on in
=prog-mode= by default.

#+BEGIN_SRC emacs-lisp :tangle yes
  (use-package clean-aindent-mode
    :init
    (add-hook 'prog-mode-hook 'clean-aindent-mode))
#+END_SRC
*** =Smartparents= - Insert closing parens automagically

[[https://github.com/Fuco1/smartparens][Smartparents]] is a minor mode for dealing with pairs, such as automatically
insert pairs, wrap, unwrap and rewrap pairs,

#+BEGIN_SRC emacs-lisp :tangle yes
  (use-package smartparens
    :ensure t
    :defer t
    :diminish ""
    :init
    (smartparens-global-mode)
    (require 'smartparens-config))  
#+END_SRC
*** =Undo-tree= - visualize your undos and branches

[[http://www.dr-qubit.org/undo-tree/undo-tree.el][Undo-tree-mode]] lets you use =C-x u= (=undo-tree-visualize=) to visually walk
through the changes you've made, undo back to a certain point (or redo), and go
down different branches.

#+BEGIN_SRC emacs-lisp :tangle yes
  (use-package undo-tree
    :ensure t
    :diminish undo-tree-mode
    :init (global-undo-tree-mode)
    :config
    (progn
      (setq undo-tree-visualizer-timestamps t)
      (setq undo-tree-visualizer-diff t)))
#+END_SRC
*** =Auto-fill= - warp long lines

Turn on [[https://www.emacswiki.org/emacs/AutoFillMode][auto-fill-mode]] to warp long lines automatically, instead of =M-q=
altogether. Sometimes, =toggle-truncate-lines= would be useful.

#+BEGIN_SRC emacs-lisp :tangle yes
  (setq-default fill-column 79)
  (add-hook 'text-mode-hook 'turn-on-auto-fill)
  (add-hook 'prog-mode-hook 'turn-on-auto-fill)

  (global-set-key (kbd "C-x t f") 'auto-fill-mode)
  (global-set-key (kbd "C-x t t") 'toggle-truncate-lines)
#+END_SRC

Sometimes, l want to join all the lines in a paragraph into a single line,
Emacs does not have a =unfill= command to do the inverse of =fill=. Luckly, [[http://ergoemacs.org/emacs/emacs_unfill-paragraph.html][Xah
Lee wrote unfill functions]] for us.

#+BEGIN_SRC emacs-lisp :tangle yes
  (defun xah-unfill-paragraph ()
    "Replace newline chars in current paragraph by single spaces.
  This command does the inverse of `fill-paragraph'."
    (interactive)
    (let ((fill-column most-positive-fixnum))
      (fill-paragraph)))

  (define-key global-map "\M-Q" 'unfill-paragraph)
#+END_SRC 
