init.html
<div id="outline-container-org65416a8" class="outline-4">
<h4 id="org65416a8"><span class="section-number-4">4.4.4</span> <code>Whitespace</code> - show and clean devil</h4>
<div class="outline-text-4" id="text-4-4-4">
<p>
We want to show trailing whitespace. Trailing whitespace is the devil.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #78c5d6;">(</span><span style="color: #F0DFAF; font-weight: bold;">use-package</span> <span style="color: #BFEBBF;">whitespace</span>
  <span style="color: #DCDCCC; font-weight: bold;">:bind</span> <span style="color: #bf62a6;">(</span><span style="color: #CC9393;">"C-c x w"</span> . whitespace-mode<span style="color: #bf62a6;">)</span>
  <span style="color: #DCDCCC; font-weight: bold;">:diminish</span> whitespace-mode
  <span style="color: #DCDCCC; font-weight: bold;">:init</span>
  <span style="color: #5F7F5F;">;; </span><span style="color: #7F9F7F;">Indicate trailing empty lines in the GUI</span>
  <span style="color: #bf62a6;">(</span>set-default 'indicate-empty-lines t<span style="color: #bf62a6;">)</span>
  <span style="color: #bf62a6;">(</span><span style="color: #F0DFAF; font-weight: bold;">setq</span> show-trailing-whitespace t<span style="color: #bf62a6;">)</span>

  <span style="color: #5F7F5F;">;; </span><span style="color: #7F9F7F;">limit line length                                                                    </span>
  <span style="color: #bf62a6;">(</span><span style="color: #F0DFAF; font-weight: bold;">setq</span> whitespace-line-column 80<span style="color: #bf62a6;">)</span>
  <span style="color: #5F7F5F;">;; </span><span style="color: #7F9F7F;">Here are the things that whitespace-mode should highlight</span>
  <span style="color: #bf62a6;">(</span><span style="color: #F0DFAF; font-weight: bold;">setq</span> whitespace-style '<span style="color: #459ba8;">(</span>face tabs empty trailing lines-tail<span style="color: #459ba8;">)</span><span style="color: #bf62a6;">)</span>

  <span style="color: #5F7F5F;">;; </span><span style="color: #7F9F7F;">Display pretty things for newlines and tabs (nothing for spaces)</span>
  <span style="color: #bf62a6;">(</span><span style="color: #F0DFAF; font-weight: bold;">setq</span> whitespace-display-mappings
        <span style="color: #5F7F5F;">;; </span><span style="color: #7F9F7F;">all numbers are Unicode codepoint in decimal. e.g. (insert-char 182 1)</span>
        <span style="color: #5F7F5F;">;; </span><span style="color: #7F9F7F;">32 SPACE, 183 MIDDLE DOT</span>
        '<span style="color: #459ba8;">(</span><span style="color: #e868a2;">(</span>space-mark nil<span style="color: #e868a2;">)</span>
          <span style="color: #5F7F5F;">;; </span><span style="color: #7F9F7F;">10 LINE FEED</span>
          <span style="color: #5F7F5F;">;;</span><span style="color: #7F9F7F;">(newline-mark 10 [172 10])</span>
          <span style="color: #e868a2;">(</span>newline-mark nil<span style="color: #e868a2;">)</span>
          <span style="color: #5F7F5F;">;; </span><span style="color: #7F9F7F;">9 TAB, MIDDLE DOT</span>
          <span style="color: #e868a2;">(</span>tab-mark 9 <span style="color: #79c267;">[</span>183 9<span style="color: #79c267;">]</span> <span style="color: #79c267;">[</span>92 9<span style="color: #79c267;">]</span><span style="color: #e868a2;">)</span><span style="color: #459ba8;">)</span><span style="color: #bf62a6;">)</span>

  <span style="color: #5F7F5F;">;; </span><span style="color: #7F9F7F;">Disable it in certain modes where whitespace doesn't make sense.</span>
  <span style="color: #bf62a6;">(</span><span style="color: #F0DFAF; font-weight: bold;">setq</span> whitespace-global-modes '<span style="color: #459ba8;">(</span>not org-mode
                                    eshell-mode
                                    shell-mode
                                    web-mode
                                    log4j-mode
                                    dired-mode
                                    emacs-lisp-mode
                                    clojure-mode
                                    lisp-mode<span style="color: #459ba8;">)</span><span style="color: #bf62a6;">)</span><span style="color: #78c5d6;">)</span>
</pre>
</div>

<p>
When you press <code>RET</code> to create a newline and got indented by
<code>eletric-indent-mode</code>, you have appropriate whitespace for indenting. But, if
you leave the line blank and move to the next line, the whitespace becomes
useless. <code>Clean-aindent-mode</code> helps <a href="https://www.emacswiki.org/emacs/CleanAutoIndent">clean up unused whitespace</a>. Turn it on in
<code>prog-mode</code> by default.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #78c5d6;">(</span><span style="color: #F0DFAF; font-weight: bold;">use-package</span> <span style="color: #BFEBBF;">clean-aindent-mode</span>
  <span style="color: #DCDCCC; font-weight: bold;">:init</span>
  <span style="color: #bf62a6;">(</span>add-hook 'prog-mode-hook 'clean-aindent-mode<span style="color: #bf62a6;">)</span><span style="color: #78c5d6;">)</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-org6e6e11b" class="outline-4">
<h4 id="org6e6e11b"><span class="section-number-4">4.4.5</span> <code>Smartparents</code> - Insert closing parens automagically</h4>
<div class="outline-text-4" id="text-4-4-5">
<p>
<a href="https://github.com/Fuco1/smartparens">Smartparents</a> is a minor mode for dealing with pairs, such as automatically
insert pairs, wrap, unwrap and rewrap pairs,
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #78c5d6;">(</span><span style="color: #F0DFAF; font-weight: bold;">use-package</span> <span style="color: #BFEBBF;">smartparens</span>
  <span style="color: #DCDCCC; font-weight: bold;">:ensure</span> t
  <span style="color: #DCDCCC; font-weight: bold;">:defer</span> t
  <span style="color: #DCDCCC; font-weight: bold;">:diminish</span> <span style="color: #CC9393;">""</span>
  <span style="color: #DCDCCC; font-weight: bold;">:init</span>
  <span style="color: #bf62a6;">(</span>smartparens-global-mode<span style="color: #bf62a6;">)</span>
  <span style="color: #bf62a6;">(</span><span style="color: #F0DFAF; font-weight: bold;">require</span> '<span style="color: #BFEBBF;">smartparens-config</span><span style="color: #bf62a6;">)</span><span style="color: #78c5d6;">)</span>  
</pre>
</div>
</div>
</div>
<div id="outline-container-orgc2500ab" class="outline-4">
<h4 id="orgc2500ab"><span class="section-number-4">4.4.6</span> <code>Undo-tree</code> - visualize your undos and branches</h4>
<div class="outline-text-4" id="text-4-4-6">
<p>
<a href="http://www.dr-qubit.org/undo-tree/undo-tree.el">Undo-tree-mode</a> lets you use <code>C-x u</code> (<code>undo-tree-visualize</code>) to visually walk
through the changes you've made, undo back to a certain point (or redo), and go
down different branches.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #78c5d6;">(</span><span style="color: #F0DFAF; font-weight: bold;">use-package</span> <span style="color: #BFEBBF;">undo-tree</span>
  <span style="color: #DCDCCC; font-weight: bold;">:ensure</span> t
  <span style="color: #DCDCCC; font-weight: bold;">:diminish</span> undo-tree-mode
  <span style="color: #DCDCCC; font-weight: bold;">:init</span> <span style="color: #bf62a6;">(</span>global-undo-tree-mode<span style="color: #bf62a6;">)</span>
  <span style="color: #DCDCCC; font-weight: bold;">:config</span>
  <span style="color: #bf62a6;">(</span><span style="color: #F0DFAF; font-weight: bold;">progn</span>
    <span style="color: #459ba8;">(</span><span style="color: #F0DFAF; font-weight: bold;">setq</span> undo-tree-visualizer-timestamps t<span style="color: #459ba8;">)</span>
    <span style="color: #459ba8;">(</span><span style="color: #F0DFAF; font-weight: bold;">setq</span> undo-tree-visualizer-diff t<span style="color: #459ba8;">)</span><span style="color: #bf62a6;">)</span><span style="color: #78c5d6;">)</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-org7b7cc7d" class="outline-4">
<h4 id="org7b7cc7d"><span class="section-number-4">4.4.7</span> <code>Auto-fill</code> - warp long lines</h4>
<div class="outline-text-4" id="text-4-4-7">
<p>
Turn on <a href="https://www.emacswiki.org/emacs/AutoFillMode">auto-fill-mode</a> to warp long lines automatically, instead of <code>M-q</code>
altogether. Sometimes, <code>toggle-truncate-lines</code> would be useful.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #78c5d6;">(</span><span style="color: #F0DFAF; font-weight: bold;">setq-default</span> fill-column 79<span style="color: #78c5d6;">)</span>
<span style="color: #78c5d6;">(</span>add-hook 'text-mode-hook 'turn-on-auto-fill<span style="color: #78c5d6;">)</span>
<span style="color: #78c5d6;">(</span>add-hook 'prog-mode-hook 'turn-on-auto-fill<span style="color: #78c5d6;">)</span>

<span style="color: #78c5d6;">(</span>global-set-key <span style="color: #bf62a6;">(</span>kbd <span style="color: #CC9393;">"C-x t f"</span><span style="color: #bf62a6;">)</span> 'auto-fill-mode<span style="color: #78c5d6;">)</span>
<span style="color: #78c5d6;">(</span>global-set-key <span style="color: #bf62a6;">(</span>kbd <span style="color: #CC9393;">"C-x t t"</span><span style="color: #bf62a6;">)</span> 'toggle-truncate-lines<span style="color: #78c5d6;">)</span>
</pre>
</div>

<p>
Sometimes, l want to join all the lines in a paragraph into a single line,
Emacs does not have a <code>unfill</code> command to do the inverse of <code>fill</code>. Luckly, <a href="http://ergoemacs.org/emacs/emacs_unfill-paragraph.html">Xah
Lee wrote unfill functions</a> for us.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #78c5d6;">(</span><span style="color: #F0DFAF; font-weight: bold;">defun</span> <span style="color: #93E0E3;">xah-unfill-paragraph</span> <span style="color: #bf62a6;">()</span>
  <span style="color: #9FC59F;">"Replace newline chars in current paragraph by single spaces.</span>
<span style="color: #9FC59F;">This command does the inverse of `</span><span style="color: #BFEBBF;">fill-paragraph</span><span style="color: #9FC59F;">'."</span>
  <span style="color: #bf62a6;">(</span><span style="color: #F0DFAF; font-weight: bold;">interactive</span><span style="color: #bf62a6;">)</span>
  <span style="color: #bf62a6;">(</span><span style="color: #F0DFAF; font-weight: bold;">let</span> <span style="color: #459ba8;">(</span><span style="color: #e868a2;">(</span>fill-column most-positive-fixnum<span style="color: #e868a2;">)</span><span style="color: #459ba8;">)</span>
    <span style="color: #459ba8;">(</span>fill-paragraph<span style="color: #459ba8;">)</span><span style="color: #bf62a6;">)</span><span style="color: #78c5d6;">)</span>

<span style="color: #78c5d6;">(</span>define-key global-map <span style="color: #CC9393;">"\M-Q"</span> 'unfill-paragraph<span style="color: #78c5d6;">)</span>
</pre>
</div>
</div>
</div>
