init.org
*** =Hippie-expand= - Text Expansion

=Hippie-expand= looks at the word before point and tries to expand it in
various ways including expanding from a fixed list (like =`expand-abbrev’=),
expanding from matching text found in a buffer (like =`dabbrev-expand’=) or
expanding in ways defined by your own functions. Which of these it tries and in
what order is controlled by a configurable list of functions.

#+BEGIN_SRC emacs-lisp :tangle yes
  (setq hippie-expand-try-functions-list
   '(try-expand-dabbrev
     try-expand-dabbrev-all-buffers
     try-expand-dabbrev-from-kill
     try-complete-file-name-partially
     try-complete-file-name
     try-expand-all-abbrevs
     try-expand-list
     try-expand-line
     try-complete-lisp-symbol-partially
     try-complete-lisp-symbol))

  (global-set-key (kbd "M-/") 'hippie-expand)
#+END_SRC
*** =Company= - Completion for Anything

[[http://company-mode.github.io][Company]] is a text completion framework for Emacs. The name stands for /complete
anything/. I use =company-mode= for all my auto completion needs.

Completion will start automatically after you type a few letters. Use =M-n= and
=M-p= to select, =<RET>= to complete or =<TAB>= to complete the common part.
Press =M-(digit)= to quickly complete with one of the first =10= candidates.

#+BEGIN_SRC emacs-lisp :tangle yes
  (use-package company
    :ensure t
    :diminish company-mode
    :bind ("C-:" . company-complete)  ; In case I don't want to wait
    :init
    (add-hook 'after-init-hook 'global-company-mode)
    :config
    (setq company-idle-delay 0.5)
    (setq company-show-numbers t)
    (setq company-tooltip-limit 10)
    (setq company-minimum-prefix-length 2)
    (setq company-tooltip-align-annotations t)
    ;; invert the navigation direction if the the completion popup-isearch-match
    ;; is displayed on top (happens near the bottom of windows)
    (setq company-tooltip-flip-when-above t))
#+END_SRC

Take advantage of idle time by displaying some documentation using
[[https://www.github.com/expez/company-quickhelp][company-quickhelp]] project.

#+BEGIN_SRC emacs-lisp :tangle yes
  (use-package company-quickhelp
    :ensure t
    :config
    (company-quickhelp-mode 1))
#+END_SRC

This also requires [[https://github.com/pitkali/pos-tip/blob/master/pos-tip.el][pos-tip]].

*** =Yasnippet= - Code Templates

[[https://github.com/joaotavora/yasnippet][YASnippet]] is a template system for Emacs. It allows you to type an abbreviation
and automatically expand it into function templates, based on the languages.
You can view a bunch of predefined snippet from the [[https://github.com/AndreaCrotti/yasnippet-snippets][yasnippet snippets project]].

#+BEGIN_SRC emacs-lisp :tangle yes
  (use-package yasnippet
    :ensure
    :diminish t
    :init 
    (yas-global-mode 1)
    :config
    (add-to-list 'yas-snippet-dirs (expand-file-name "snippets" user-emacs-directory)))
#+END_SRC

*** =Flyspell= - Spelling Checking

I like spell checking with [[https://www.emacswiki.org/emacs/FlySpell][Flyspell]] which does spell-checking on the fly as you
type using the build-in spell-check settings of ispell.

The ASpell program is better supported than ispell. It automatically configures
a personal dictionary at =~/.aspell.en.pws=, so no need to configure that.
Install ASpell with homebrew first:

#+BEGIN_SRC sh
  brew install aspell
#+END_SRC

#+BEGIN_SRC emacs-lisp :tangle yes
  (use-package flyspell
    :defer t
    :diminish ""
    :init
    (add-hook 'prog-mode-hook 'flyspell-prog-mode)

    (dolist (hook '(text-mode-hook org-mode-hook))
      (add-hook hook (lambda () (flyspell-mode 1))))

    (dolist (hook '(change-log-mode-hook log-edit-mode-hook org-agenda-mode-hook))
      (add-hook hook (lambda () (flyspell-mode -1))))

    :config
    (setq ispell-program-name "/usr/local/bin/aspell" ; use aspell instead of ispell
          ispell-dictionary "american"
          ispell-extra-args '("--sug-mode=ultra"
                              "--lang=en_US"
                              "--ignore=3")
          ispell-list-command "--list"))

  (global-set-key (kbd "C-x t s") 'flyspell-mode)
#+END_SRC
