init.html
<div id="outline-container-org83349b1" class="outline-4">
<h4 id="org83349b1"><span class="section-number-4">4.4.8</span> <code>Hippie-expand</code> - Text Expansion</h4>
<div class="outline-text-4" id="text-4-4-8">
<p>
<code>Hippie-expand</code> looks at the word before point and tries to expand it in
various ways including expanding from a fixed list (like <code>`expand-abbrev’</code>),
expanding from matching text found in a buffer (like <code>`dabbrev-expand’</code>) or
expanding in ways defined by your own functions. Which of these it tries and in
what order is controlled by a configurable list of functions.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #78c5d6;">(</span><span style="color: #F0DFAF; font-weight: bold;">setq</span> hippie-expand-try-functions-list
 '<span style="color: #bf62a6;">(</span>try-expand-dabbrev
   try-expand-dabbrev-all-buffers
   try-expand-dabbrev-from-kill
   try-complete-file-name-partially
   try-complete-file-name
   try-expand-all-abbrevs
   try-expand-list
   try-expand-line
   try-complete-lisp-symbol-partially
   try-complete-lisp-symbol<span style="color: #bf62a6;">)</span><span style="color: #78c5d6;">)</span>

<span style="color: #78c5d6;">(</span>global-set-key <span style="color: #bf62a6;">(</span>kbd <span style="color: #CC9393;">"M-/"</span><span style="color: #bf62a6;">)</span> 'hippie-expand<span style="color: #78c5d6;">)</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-org326bef5" class="outline-4">
<h4 id="org326bef5"><span class="section-number-4">4.4.9</span> <code>Company</code> - Completion for Anything</h4>
<div class="outline-text-4" id="text-4-4-9">
<p>
<a href="http://company-mode.github.io">Company</a> is a text completion framework for Emacs. The name stands for <i>complete
anything</i>. I use <code>company-mode</code> for all my auto completion needs.
</p>

<p>
Completion will start automatically after you type a few letters. Use <code>M-n</code> and
<code>M-p</code> to select, <code>&lt;RET&gt;</code> to complete or <code>&lt;TAB&gt;</code> to complete the common part.
Press <code>M-(digit)</code> to quickly complete with one of the first <code>10</code> candidates.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #78c5d6;">(</span><span style="color: #F0DFAF; font-weight: bold;">use-package</span> <span style="color: #BFEBBF;">company</span>
  <span style="color: #DCDCCC; font-weight: bold;">:ensure</span> t
  <span style="color: #DCDCCC; font-weight: bold;">:diminish</span> company-mode
  <span style="color: #DCDCCC; font-weight: bold;">:bind</span> <span style="color: #bf62a6;">(</span><span style="color: #CC9393;">"C-:"</span> . company-complete<span style="color: #bf62a6;">)</span>  <span style="color: #5F7F5F;">; </span><span style="color: #7F9F7F;">In case I don't want to wait</span>
  <span style="color: #DCDCCC; font-weight: bold;">:init</span>
  <span style="color: #bf62a6;">(</span>add-hook 'after-init-hook 'global-company-mode<span style="color: #bf62a6;">)</span>
  <span style="color: #DCDCCC; font-weight: bold;">:config</span>
  <span style="color: #bf62a6;">(</span><span style="color: #F0DFAF; font-weight: bold;">setq</span> company-idle-delay 0.5<span style="color: #bf62a6;">)</span>
  <span style="color: #bf62a6;">(</span><span style="color: #F0DFAF; font-weight: bold;">setq</span> company-show-numbers t<span style="color: #bf62a6;">)</span>
  <span style="color: #bf62a6;">(</span><span style="color: #F0DFAF; font-weight: bold;">setq</span> company-tooltip-limit 10<span style="color: #bf62a6;">)</span>
  <span style="color: #bf62a6;">(</span><span style="color: #F0DFAF; font-weight: bold;">setq</span> company-minimum-prefix-length 2<span style="color: #bf62a6;">)</span>
  <span style="color: #bf62a6;">(</span><span style="color: #F0DFAF; font-weight: bold;">setq</span> company-tooltip-align-annotations t<span style="color: #bf62a6;">)</span>
  <span style="color: #5F7F5F;">;; </span><span style="color: #7F9F7F;">invert the navigation direction if the the completion popup-isearch-match</span>
  <span style="color: #5F7F5F;">;; </span><span style="color: #7F9F7F;">is displayed on top (happens near the bottom of windows)</span>
  <span style="color: #bf62a6;">(</span><span style="color: #F0DFAF; font-weight: bold;">setq</span> company-tooltip-flip-when-above t<span style="color: #bf62a6;">)</span><span style="color: #78c5d6;">)</span>
</pre>
</div>

<p>
Take advantage of idle time by displaying some documentation using
<a href="https://www.github.com/expez/company-quickhelp">company-quickhelp</a> project.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #78c5d6;">(</span><span style="color: #F0DFAF; font-weight: bold;">use-package</span> <span style="color: #BFEBBF;">company-quickhelp</span>
  <span style="color: #DCDCCC; font-weight: bold;">:ensure</span> t
  <span style="color: #DCDCCC; font-weight: bold;">:config</span>
  <span style="color: #bf62a6;">(</span>company-quickhelp-mode 1<span style="color: #bf62a6;">)</span><span style="color: #78c5d6;">)</span>
</pre>
</div>

<p>
This also requires <a href="https://github.com/pitkali/pos-tip/blob/master/pos-tip.el">pos-tip</a>.
</p>
</div>
</div>

<div id="outline-container-org5ef5f99" class="outline-4">
<h4 id="org5ef5f99"><span class="section-number-4">4.4.10</span> <code>Yasnippet</code> - Code Templates</h4>
<div class="outline-text-4" id="text-4-4-10">
<p>
<a href="https://github.com/joaotavora/yasnippet">YASnippet</a> is a template system for Emacs. It allows you to type an abbreviation
and automatically expand it into function templates, based on the languages.
You can view a bunch of predefined snippet from the <a href="https://github.com/AndreaCrotti/yasnippet-snippets">yasnippet snippets project</a>.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #78c5d6;">(</span><span style="color: #F0DFAF; font-weight: bold;">use-package</span> <span style="color: #BFEBBF;">yasnippet</span>
  <span style="color: #DCDCCC; font-weight: bold;">:ensure</span>
  <span style="color: #DCDCCC; font-weight: bold;">:diminish</span> t
  <span style="color: #DCDCCC; font-weight: bold;">:init</span> 
  <span style="color: #bf62a6;">(</span>yas-global-mode 1<span style="color: #bf62a6;">)</span>
  <span style="color: #DCDCCC; font-weight: bold;">:config</span>
  <span style="color: #bf62a6;">(</span>add-to-list 'yas-snippet-dirs <span style="color: #459ba8;">(</span>expand-file-name <span style="color: #CC9393;">"snippets"</span> user-emacs-directory<span style="color: #459ba8;">)</span><span style="color: #bf62a6;">)</span><span style="color: #78c5d6;">)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org3ee95e6" class="outline-4">
<h4 id="org3ee95e6"><span class="section-number-4">4.4.11</span> <code>Flyspell</code> - Spelling Checking</h4>
<div class="outline-text-4" id="text-4-4-11">
<p>
I like spell checking with <a href="https://www.emacswiki.org/emacs/FlySpell">Flyspell</a> which does spell-checking on the fly as you
type using the build-in spell-check settings of ispell.
</p>

<p>
The ASpell program is better supported than ispell. It automatically configures
a personal dictionary at <code>~/.aspell.en.pws</code>, so no need to configure that.
Install ASpell with homebrew first:
</p>

<div class="org-src-container">
<pre class="src src-sh">brew install aspell
</pre>
</div>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #78c5d6;">(</span><span style="color: #F0DFAF; font-weight: bold;">use-package</span> <span style="color: #BFEBBF;">flyspell</span>
  <span style="color: #DCDCCC; font-weight: bold;">:defer</span> t
  <span style="color: #DCDCCC; font-weight: bold;">:diminish</span> <span style="color: #CC9393;">""</span>
  <span style="color: #DCDCCC; font-weight: bold;">:init</span>
  <span style="color: #bf62a6;">(</span>add-hook 'prog-mode-hook 'flyspell-prog-mode<span style="color: #bf62a6;">)</span>

  <span style="color: #bf62a6;">(</span><span style="color: #F0DFAF; font-weight: bold;">dolist</span> <span style="color: #459ba8;">(</span>hook '<span style="color: #e868a2;">(</span>text-mode-hook org-mode-hook<span style="color: #e868a2;">)</span><span style="color: #459ba8;">)</span>
    <span style="color: #459ba8;">(</span>add-hook hook <span style="color: #e868a2;">(</span><span style="color: #F0DFAF; font-weight: bold;">lambda</span> <span style="color: #79c267;">()</span> <span style="color: #79c267;">(</span>flyspell-mode 1<span style="color: #79c267;">)</span><span style="color: #e868a2;">)</span><span style="color: #459ba8;">)</span><span style="color: #bf62a6;">)</span>

  <span style="color: #bf62a6;">(</span><span style="color: #F0DFAF; font-weight: bold;">dolist</span> <span style="color: #459ba8;">(</span>hook '<span style="color: #e868a2;">(</span>change-log-mode-hook log-edit-mode-hook org-agenda-mode-hook<span style="color: #e868a2;">)</span><span style="color: #459ba8;">)</span>
    <span style="color: #459ba8;">(</span>add-hook hook <span style="color: #e868a2;">(</span><span style="color: #F0DFAF; font-weight: bold;">lambda</span> <span style="color: #79c267;">()</span> <span style="color: #79c267;">(</span>flyspell-mode -1<span style="color: #79c267;">)</span><span style="color: #e868a2;">)</span><span style="color: #459ba8;">)</span><span style="color: #bf62a6;">)</span>

  <span style="color: #DCDCCC; font-weight: bold;">:config</span>
  <span style="color: #bf62a6;">(</span><span style="color: #F0DFAF; font-weight: bold;">setq</span> ispell-program-name <span style="color: #CC9393;">"/usr/local/bin/aspell"</span> <span style="color: #5F7F5F;">; </span><span style="color: #7F9F7F;">use aspell instead of ispell</span>
        ispell-dictionary <span style="color: #CC9393;">"american"</span>
        ispell-extra-args '<span style="color: #459ba8;">(</span><span style="color: #CC9393;">"--sug-mode=ultra"</span>
                            <span style="color: #CC9393;">"--lang=en_US"</span>
                            <span style="color: #CC9393;">"--ignore=3"</span><span style="color: #459ba8;">)</span>
        ispell-list-command <span style="color: #CC9393;">"--list"</span><span style="color: #bf62a6;">)</span><span style="color: #78c5d6;">)</span>

<span style="color: #78c5d6;">(</span>global-set-key <span style="color: #bf62a6;">(</span>kbd <span style="color: #CC9393;">"C-x t s"</span><span style="color: #bf62a6;">)</span> 'flyspell-mode<span style="color: #78c5d6;">)</span>
</pre>
</div>
</div>
</div>
