init.org
*** =Multiple Cursors= - edit with multiple cursors

[[https://github.com/emacsmirror/multiple-cursors][Multiple-cursors]] is an advanced package enable editing with multiple cursors
simultaneously. *Multiple-cursors is crazy!* It doesn't have any default
keybindings, so I set up these:

#+BEGIN_SRC emacs-lisp :tangle yes
  (use-package multiple-cursors
    :ensure t
    :bind (("C-c C-. ."   . mc/mark-all-dwim)
           ("C-c C-. C-." . mc/mark-all-like-this-dwim)
           ("C-c C-. n"   . mc/mark-next-like-this)
           ("C-c C-. C-n" . mc/mark-next-like-this)
           ("C-c C-. p"   . mc/mark-previous-like-this)
           ("C-c C-. C-p" . mc/mark-previous-like-this)
           ("C-c C-. a"   . mc/mark-all-like-this)
           ("C-c C-. C-a" . mc/mark-all-like-this)
           ("C-c C-. N"   . mc/mark-next-symbol-like-this)
           ("C-c C-. C-N" . mc/mark-next-symbol-like-this)
           ("C-c C-. P"   . mc/mark-previous-symbol-like-this)
           ("C-c C-. C-P" . mc/mark-previous-symbol-like-this)
           ("C-c C-. A"   . mc/mark-all-symbols-like-this)
           ("C-c C-. C-A" . mc/mark-all-symbols-like-this)
           ("C-c C-. f"   . mc/mark-all-like-this-in-defun)
           ("C-c C-. C-f" . mc/mark-all-like-this-in-defun)
           ("C-c C-. l"   . mc/edit-lines)
           ("C-c C-. C-l" . mc/edit-lines)
           ("C-c C-. e"   . mc/edit-ends-of-lines)
           ("C-c C-. C-e" . mc/edit-ends-of-lines)
           ("C-M-<mouse-1>" . mc/add-cursor-on-click)))
#+END_SRC
** Helm - interactive completion and selection
