init.html
<div id="outline-container-org0282cbd" class="outline-4">
<h4 id="org0282cbd"><span class="section-number-4">4.4.12</span> <code>Multiple Cursors</code> - edit with multiple cursors</h4>
<div class="outline-text-4" id="text-4-4-12">
<p>
<a href="https://github.com/emacsmirror/multiple-cursors">Multiple-cursors</a> is an advanced package enable editing with multiple cursors
simultaneously. <b>Multiple-cursors is crazy!</b> It doesn't have any default
keybindings, so I set up these:
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #78c5d6;">(</span><span style="color: #F0DFAF; font-weight: bold;">use-package</span> <span style="color: #BFEBBF;">multiple-cursors</span>
  <span style="color: #DCDCCC; font-weight: bold;">:ensure</span> t
  <span style="color: #DCDCCC; font-weight: bold;">:bind</span> <span style="color: #bf62a6;">(</span><span style="color: #459ba8;">(</span><span style="color: #CC9393;">"C-c C-. ."</span>   . mc/mark-all-dwim<span style="color: #459ba8;">)</span>
         <span style="color: #459ba8;">(</span><span style="color: #CC9393;">"C-c C-. C-."</span> . mc/mark-all-like-this-dwim<span style="color: #459ba8;">)</span>
         <span style="color: #459ba8;">(</span><span style="color: #CC9393;">"C-c C-. n"</span>   . mc/mark-next-like-this<span style="color: #459ba8;">)</span>
         <span style="color: #459ba8;">(</span><span style="color: #CC9393;">"C-c C-. C-n"</span> . mc/mark-next-like-this<span style="color: #459ba8;">)</span>
         <span style="color: #459ba8;">(</span><span style="color: #CC9393;">"C-c C-. p"</span>   . mc/mark-previous-like-this<span style="color: #459ba8;">)</span>
         <span style="color: #459ba8;">(</span><span style="color: #CC9393;">"C-c C-. C-p"</span> . mc/mark-previous-like-this<span style="color: #459ba8;">)</span>
         <span style="color: #459ba8;">(</span><span style="color: #CC9393;">"C-c C-. a"</span>   . mc/mark-all-like-this<span style="color: #459ba8;">)</span>
         <span style="color: #459ba8;">(</span><span style="color: #CC9393;">"C-c C-. C-a"</span> . mc/mark-all-like-this<span style="color: #459ba8;">)</span>
         <span style="color: #459ba8;">(</span><span style="color: #CC9393;">"C-c C-. N"</span>   . mc/mark-next-symbol-like-this<span style="color: #459ba8;">)</span>
         <span style="color: #459ba8;">(</span><span style="color: #CC9393;">"C-c C-. C-N"</span> . mc/mark-next-symbol-like-this<span style="color: #459ba8;">)</span>
         <span style="color: #459ba8;">(</span><span style="color: #CC9393;">"C-c C-. P"</span>   . mc/mark-previous-symbol-like-this<span style="color: #459ba8;">)</span>
         <span style="color: #459ba8;">(</span><span style="color: #CC9393;">"C-c C-. C-P"</span> . mc/mark-previous-symbol-like-this<span style="color: #459ba8;">)</span>
         <span style="color: #459ba8;">(</span><span style="color: #CC9393;">"C-c C-. A"</span>   . mc/mark-all-symbols-like-this<span style="color: #459ba8;">)</span>
         <span style="color: #459ba8;">(</span><span style="color: #CC9393;">"C-c C-. C-A"</span> . mc/mark-all-symbols-like-this<span style="color: #459ba8;">)</span>
         <span style="color: #459ba8;">(</span><span style="color: #CC9393;">"C-c C-. f"</span>   . mc/mark-all-like-this-in-defun<span style="color: #459ba8;">)</span>
         <span style="color: #459ba8;">(</span><span style="color: #CC9393;">"C-c C-. C-f"</span> . mc/mark-all-like-this-in-defun<span style="color: #459ba8;">)</span>
         <span style="color: #459ba8;">(</span><span style="color: #CC9393;">"C-c C-. l"</span>   . mc/edit-lines<span style="color: #459ba8;">)</span>
         <span style="color: #459ba8;">(</span><span style="color: #CC9393;">"C-c C-. C-l"</span> . mc/edit-lines<span style="color: #459ba8;">)</span>
         <span style="color: #459ba8;">(</span><span style="color: #CC9393;">"C-c C-. e"</span>   . mc/edit-ends-of-lines<span style="color: #459ba8;">)</span>
         <span style="color: #459ba8;">(</span><span style="color: #CC9393;">"C-c C-. C-e"</span> . mc/edit-ends-of-lines<span style="color: #459ba8;">)</span>
         <span style="color: #459ba8;">(</span><span style="color: #CC9393;">"C-M-&lt;mouse-1&gt;"</span> . mc/add-cursor-on-click<span style="color: #459ba8;">)</span><span style="color: #bf62a6;">)</span><span style="color: #78c5d6;">)</span>
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-orgcc09406" class="outline-3">
<h3 id="orgcc09406"><span class="section-number-3">4.5</span> Helm - interactive completion and selection</h3>
<div class="outline-text-3" id="text-4-5">
</div>
