init.html
<div id="outline-container-org53da2a4" class="outline-4">
<h4 id="org53da2a4"><span class="section-number-4">4.5.1</span> Helm core - amazing utils used everywhere</h4>
<div class="outline-text-4" id="text-4-5-1">
<p>
<a href="https://github.com/emacs-helm/helm">Helm</a> makes it easy to complete various things. I find it to be easier to
configure than <code>ido</code> in order to get completion in as many places as possible,
although I prefer ido's way of switching buffers.
</p>

<p>
This article: <a href="http://tuhdo.github.io/helm-intro.html">A Package in a league of its own: Helm</a> is worth reading. <b>Helm is
amazing!</b>
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #78c5d6;">(</span><span style="color: #F0DFAF; font-weight: bold;">use-package</span> <span style="color: #BFEBBF;">helm</span>
  <span style="color: #DCDCCC; font-weight: bold;">:ensure</span> t
  <span style="color: #DCDCCC; font-weight: bold;">:diminish</span> <span style="color: #CC9393;">""</span>
  <span style="color: #DCDCCC; font-weight: bold;">:init</span>
  <span style="color: #bf62a6;">(</span><span style="color: #F0DFAF; font-weight: bold;">require</span> '<span style="color: #BFEBBF;">helm</span><span style="color: #bf62a6;">)</span>
  <span style="color: #bf62a6;">(</span><span style="color: #F0DFAF; font-weight: bold;">require</span> '<span style="color: #BFEBBF;">helm-config</span><span style="color: #bf62a6;">)</span>

  <span style="color: #5F7F5F;">;; </span><span style="color: #7F9F7F;">The default "C-x c" is quite close to "C-x C-c", which quits Emacs.</span>
  <span style="color: #5F7F5F;">;; </span><span style="color: #7F9F7F;">Changed to "C-c h". Note: We must set "C-c h" globally, because we</span>
  <span style="color: #5F7F5F;">;; </span><span style="color: #7F9F7F;">cannot change `</span><span style="color: #BFEBBF;">helm-command-prefix-key</span><span style="color: #7F9F7F;">' once `</span><span style="color: #BFEBBF;">helm-config</span><span style="color: #7F9F7F;">' is loaded.</span>
  <span style="color: #bf62a6;">(</span>global-set-key <span style="color: #459ba8;">(</span>kbd <span style="color: #CC9393;">"C-c h"</span><span style="color: #459ba8;">)</span> 'helm-command-prefix<span style="color: #bf62a6;">)</span>
  <span style="color: #bf62a6;">(</span>global-unset-key <span style="color: #459ba8;">(</span>kbd <span style="color: #CC9393;">"C-x c"</span><span style="color: #459ba8;">)</span><span style="color: #bf62a6;">)</span>

  <span style="color: #5F7F5F;">;; </span><span style="color: #7F9F7F;">rebind tab to run persistent action</span>
  <span style="color: #bf62a6;">(</span>define-key helm-map <span style="color: #459ba8;">(</span>kbd <span style="color: #CC9393;">"&lt;tab&gt;"</span><span style="color: #459ba8;">)</span> 'helm-execute-persistent-action<span style="color: #bf62a6;">)</span>
  <span style="color: #5F7F5F;">;; </span><span style="color: #7F9F7F;">make TAB works in terminal</span>
  <span style="color: #bf62a6;">(</span>define-key helm-map <span style="color: #459ba8;">(</span>kbd <span style="color: #CC9393;">"C-i"</span><span style="color: #459ba8;">)</span> 'helm-execute-persistent-action<span style="color: #bf62a6;">)</span>
  <span style="color: #5F7F5F;">;; </span><span style="color: #7F9F7F;">list actions using C-z</span>
  <span style="color: #bf62a6;">(</span>define-key helm-map <span style="color: #459ba8;">(</span>kbd <span style="color: #CC9393;">"C-z"</span><span style="color: #459ba8;">)</span>  'helm-select-action<span style="color: #bf62a6;">)</span>

  <span style="color: #bf62a6;">(</span><span style="color: #F0DFAF; font-weight: bold;">when</span> <span style="color: #459ba8;">(</span>executable-find <span style="color: #CC9393;">"curl"</span><span style="color: #459ba8;">)</span>
    <span style="color: #459ba8;">(</span><span style="color: #F0DFAF; font-weight: bold;">setq</span> helm-google-suggest-use-curl-p t<span style="color: #459ba8;">)</span><span style="color: #bf62a6;">)</span>

  <span style="color: #bf62a6;">(</span><span style="color: #F0DFAF; font-weight: bold;">setq</span> helm-split-window-in-side-p           t
        helm-move-to-line-cycle-in-source     t
        helm-ff-search-library-in-sexp        t
        helm-scroll-amount                    8
        helm-ff-file-name-history-use-recentf t<span style="color: #bf62a6;">)</span>

  <span style="color: #bf62a6;">(</span>helm-mode 1<span style="color: #bf62a6;">)</span>

  <span style="color: #DCDCCC; font-weight: bold;">:config</span>
  <span style="color: #5F7F5F;">;; </span><span style="color: #7F9F7F;">fuzzy matching</span>
  <span style="color: #bf62a6;">(</span><span style="color: #F0DFAF; font-weight: bold;">setq</span> helm-recentf-fuzzy-match t
        helm-locate-fuzzy-match nil <span style="color: #5F7F5F;">;; </span><span style="color: #7F9F7F;">locate fuzzy is worthless</span>
        helm-M-x-fuzzy-match t
        helm-buffers-fuzzy-matching t
        helm-semantic-fuzzy-match t
        helm-apropos-fuzzy-match t
        helm-imenu-fuzzy-match t
        helm-lisp-fuzzy-completion t
        helm-completion-in-region-fuzzy-match t<span style="color: #bf62a6;">)</span>

  <span style="color: #DCDCCC; font-weight: bold;">:bind</span> <span style="color: #bf62a6;">(</span><span style="color: #459ba8;">(</span><span style="color: #CC9393;">"M-x"</span> . helm-M-x<span style="color: #459ba8;">)</span>
         <span style="color: #459ba8;">(</span><span style="color: #CC9393;">"M-y"</span> . helm-show-kill-ring<span style="color: #459ba8;">)</span>

         <span style="color: #459ba8;">(</span><span style="color: #CC9393;">"C-x b"</span> . helm-mini<span style="color: #459ba8;">)</span>
         <span style="color: #459ba8;">(</span><span style="color: #CC9393;">"C-x C-b"</span> . helm-buffers-list<span style="color: #459ba8;">)</span>
         <span style="color: #459ba8;">(</span><span style="color: #CC9393;">"C-x C-f"</span> . helm-find-files<span style="color: #459ba8;">)</span>
         <span style="color: #459ba8;">(</span><span style="color: #CC9393;">"C-x C-r"</span> . helm-recentf<span style="color: #459ba8;">)</span>

         <span style="color: #459ba8;">(</span><span style="color: #CC9393;">"C-c s"</span> . helm-swoop<span style="color: #459ba8;">)</span>
         <span style="color: #459ba8;">(</span><span style="color: #CC9393;">"C-c o"</span> . helm-occur<span style="color: #459ba8;">)</span>

         <span style="color: #459ba8;">(</span><span style="color: #CC9393;">"C-c h a"</span> . helm-apropos<span style="color: #459ba8;">)</span>
         <span style="color: #459ba8;">(</span><span style="color: #CC9393;">"C-c h y"</span> . helm-yas-complete<span style="color: #459ba8;">)</span>
         <span style="color: #459ba8;">(</span><span style="color: #CC9393;">"C-c h SPC"</span> . helm-all-mark-rings<span style="color: #459ba8;">)</span>
         <span style="color: #459ba8;">(</span><span style="color: #CC9393;">"C-c h i"</span> . helm-semantic-or-imenu<span style="color: #459ba8;">)</span>
         <span style="color: #459ba8;">(</span><span style="color: #CC9393;">"C-c h m"</span> . helm-man-woman<span style="color: #459ba8;">)</span>
         <span style="color: #bf62a6;">)</span><span style="color: #78c5d6;">)</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-org9eae549" class="outline-4">
<h4 id="org9eae549"><span class="section-number-4">4.5.2</span> Helm-projectile - project maintaining</h4>
<div class="outline-text-4" id="text-4-5-2">
<p>
Read this article <a href="http://tuhdo.github.io/helm-projectile.html">Exploring large projects with Projectile and Helm Projectile</a>
(or <a href="https://docs.projectile.mx/en/latest/">the official Projectile Manual</a>) See some demos and master the usage. First
of all, you should keep the command <code>helm-projectile</code> (<code>C-x p h</code>) in mind. Then
master the command on directories and files.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">  <span style="color: #78c5d6;">(</span><span style="color: #F0DFAF; font-weight: bold;">use-package</span> <span style="color: #BFEBBF;">helm-projectile</span>
    <span style="color: #DCDCCC; font-weight: bold;">:bind</span> <span style="color: #bf62a6;">(</span><span style="color: #CC9393;">"C-x p h"</span> . helm-projectile<span style="color: #bf62a6;">)</span>
    <span style="color: #DCDCCC; font-weight: bold;">:init</span> <span style="color: #bf62a6;">(</span>projectile-global-mode<span style="color: #bf62a6;">)</span>
    <span style="color: #DCDCCC; font-weight: bold;">:config</span>
    <span style="color: #bf62a6;">(</span>helm-projectile-on<span style="color: #bf62a6;">)</span>
    <span style="color: #bf62a6;">(</span><span style="color: #F0DFAF; font-weight: bold;">setq</span> projectile-completion-system 'helm<span style="color: #bf62a6;">)</span>
    <span style="color: #5F7F5F;">;</span><span style="color: #7F9F7F;">(setq projectile-switch-project-action 'helm-projectile-find-file)</span>
<span style="color: #78c5d6;">)</span>
</pre>
</div>
</div>
</div>
