init.org
*** Helm-swoop - searching tool

This promises to be a fast way to find things.

#+BEGIN_SRC emacs-lisp :tangle yes
  (use-package helm-swoop
    :bind (("M-i" . helm-swoop)
           ("M-I" . helm-swoop-back-to-last-point)
           ("C-c M-i" . helm-multi-swoop))
    :config
    ;; When doing isearch, hand the word over to helm-swoop
    (define-key isearch-mode-map (kbd "M-i") 'helm-swoop-from-isearch)
    ;; From helm-swoop to helm-multi-swoop-all
    (define-key helm-swoop-map (kbd "M-i") 'helm-multi-swoop-all-from-helm-swoop)
    ;; Save buffer when helm-multi-swoop-edit complete
    (setq helm-multi-swoop-edit-save t
          ;; If this value is t, split window inside the current window
          helm-swoop-split-with-multiple-windows t
          ;; Split direcion. 'split-window-vertically or 'split-window-horizontally
          helm-swoop-split-direction 'split-window-vertically
          ;; If nil, you can slightly boost invoke speed in exchange for text color
          helm-swoop-speed-or-color nil))
#+END_SRC
*** Helm-describe - keybings describe

Helm Descbinds provides an interface to emacs’ describe-bindings making the
currently active key bindings interactively searchable with helm. 

#+BEGIN_SRC emacs-lisp :tangle yes
  (use-package helm-descbinds
    :bind ("C-h b" . helm-descbinds)
    :init (fset 'describe-bindings 'helm-descbinds)
    :config (require 'helm-config))
#+END_SRC
*** Helm-flyspell - flyspell correct

#+BEGIN_SRC emacs-lisp :tangle yes
  (use-package helm-flyspell
    :defer t
    :config
    (define-key flyspell-mode-map (kbd "M-S") 'helm-flyspell-correct))
#+END_SRC
** Backup and autosave

Backup is one of the things people usually want to [[http://ergoemacs.org/emacs/emacs_set_backup_into_a_directory.html][change right away]]. By
default, Emacs saves backup files in the current directory. These are the files
ending in =~= that are cluttering up your directory lists. The following code
stashes them all in =$HOME/.emacs.d/backup=, where I can find them with =C-x
C-f= if I really need to.

#+BEGIN_SRC emacs-lisp :tangle yes
  ;; backup in one place. flat, no tree structure
  (setq backup-directory-alist `((".*" . ,user-emacs-backup-dir)))
  (setq make-backup-files t)

  ;; store the undo-tree history in one place
  (setq undo-tree-history-directory-alist `((".*" . ,user-emacs-backup-dir)))      
  (setq undo-tree-auto-save-history t)

  ;; backup misc settings
  (setq backup-by-copying t)
  (setq delete-old-versions t)
  (setq version-control t)
  (setq vc-make-backup-files t)
  (setq kept-new-versions 6
        kept-old-versions 2)
#+END_SRC

#+BEGIN_SRC emacs-lisp :tangle yes
  (setq auto-save-file-name-transforms `((".*" ,user-emacs-autosave-dir t)))
  (setq auto-save-default t)
#+END_SRC
** Persistence and history
*** Recentf - recent files

=Recentf= is a minor mode that builds a list of recently opened files. Turn it
on, then call =recentf-open-files= to open recently opened files fast.

#+BEGIN_SRC emacs-lisp :tangle yes
  (require 'recentf)
  (recentf-mode 1) ; keep a list of recently opened files, for future sessions
  (setq recentf-save-file (expand-file-name "recentf" user-emacs-savefile-dir))

  (setq recentf-max-saved-items 500
        recentf-max-menu-items 25
        ;; disable recentf-cleanup on Emacs start, because it can cause
        ;; problems with remote files
        recentf-auto-cleanup 'never)

  (global-set-key (kbd "C-c f r") 'recentf-open-files)
#+END_SRC
*** Saveplace - save file position

You can save the cursor position for every file you opened. So, next time you
open the file, the cursor will be at the position you last opened it.

#+BEGIN_SRC emacs-lisp :tangle yes
  (require 'saveplace)
  (save-place-mode 1)
  (setq save-place-file (expand-file-name "saveplace" user-emacs-savefile-dir))
#+END_SRC
