init.html
<div id="outline-container-org182d2bf" class="outline-4">
<h4 id="org182d2bf"><span class="section-number-4">4.5.3</span> Helm-swoop - searching tool</h4>
<div class="outline-text-4" id="text-4-5-3">
<p>
This promises to be a fast way to find things.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #78c5d6;">(</span><span style="color: #F0DFAF; font-weight: bold;">use-package</span> <span style="color: #BFEBBF;">helm-swoop</span>
  <span style="color: #DCDCCC; font-weight: bold;">:bind</span> <span style="color: #bf62a6;">(</span><span style="color: #459ba8;">(</span><span style="color: #CC9393;">"M-i"</span> . helm-swoop<span style="color: #459ba8;">)</span>
         <span style="color: #459ba8;">(</span><span style="color: #CC9393;">"M-I"</span> . helm-swoop-back-to-last-point<span style="color: #459ba8;">)</span>
         <span style="color: #459ba8;">(</span><span style="color: #CC9393;">"C-c M-i"</span> . helm-multi-swoop<span style="color: #459ba8;">)</span><span style="color: #bf62a6;">)</span>
  <span style="color: #DCDCCC; font-weight: bold;">:config</span>
  <span style="color: #5F7F5F;">;; </span><span style="color: #7F9F7F;">When doing isearch, hand the word over to helm-swoop</span>
  <span style="color: #bf62a6;">(</span>define-key isearch-mode-map <span style="color: #459ba8;">(</span>kbd <span style="color: #CC9393;">"M-i"</span><span style="color: #459ba8;">)</span> 'helm-swoop-from-isearch<span style="color: #bf62a6;">)</span>
  <span style="color: #5F7F5F;">;; </span><span style="color: #7F9F7F;">From helm-swoop to helm-multi-swoop-all</span>
  <span style="color: #bf62a6;">(</span>define-key helm-swoop-map <span style="color: #459ba8;">(</span>kbd <span style="color: #CC9393;">"M-i"</span><span style="color: #459ba8;">)</span> 'helm-multi-swoop-all-from-helm-swoop<span style="color: #bf62a6;">)</span>
  <span style="color: #5F7F5F;">;; </span><span style="color: #7F9F7F;">Save buffer when helm-multi-swoop-edit complete</span>
  <span style="color: #bf62a6;">(</span><span style="color: #F0DFAF; font-weight: bold;">setq</span> helm-multi-swoop-edit-save t
        <span style="color: #5F7F5F;">;; </span><span style="color: #7F9F7F;">If this value is t, split window inside the current window</span>
        helm-swoop-split-with-multiple-windows t
        <span style="color: #5F7F5F;">;; </span><span style="color: #7F9F7F;">Split direcion. 'split-window-vertically or 'split-window-horizontally</span>
        helm-swoop-split-direction 'split-window-vertically
        <span style="color: #5F7F5F;">;; </span><span style="color: #7F9F7F;">If nil, you can slightly boost invoke speed in exchange for text color</span>
        helm-swoop-speed-or-color nil<span style="color: #bf62a6;">)</span><span style="color: #78c5d6;">)</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-org438c6ae" class="outline-4">
<h4 id="org438c6ae"><span class="section-number-4">4.5.4</span> Helm-describe - keybings describe</h4>
<div class="outline-text-4" id="text-4-5-4">
<p>
Helm Descbinds provides an interface to emacs’ describe-bindings making the
currently active key bindings interactively searchable with helm. 
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #78c5d6;">(</span><span style="color: #F0DFAF; font-weight: bold;">use-package</span> <span style="color: #BFEBBF;">helm-descbinds</span>
  <span style="color: #DCDCCC; font-weight: bold;">:bind</span> <span style="color: #bf62a6;">(</span><span style="color: #CC9393;">"C-h b"</span> . helm-descbinds<span style="color: #bf62a6;">)</span>
  <span style="color: #DCDCCC; font-weight: bold;">:init</span> <span style="color: #bf62a6;">(</span>fset 'describe-bindings 'helm-descbinds<span style="color: #bf62a6;">)</span>
  <span style="color: #DCDCCC; font-weight: bold;">:config</span> <span style="color: #bf62a6;">(</span><span style="color: #F0DFAF; font-weight: bold;">require</span> '<span style="color: #BFEBBF;">helm-config</span><span style="color: #bf62a6;">)</span><span style="color: #78c5d6;">)</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-org3bf20ef" class="outline-4">
<h4 id="org3bf20ef"><span class="section-number-4">4.5.5</span> Helm-flyspell - flyspell correct</h4>
<div class="outline-text-4" id="text-4-5-5">
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #78c5d6;">(</span><span style="color: #F0DFAF; font-weight: bold;">use-package</span> <span style="color: #BFEBBF;">helm-flyspell</span>
  <span style="color: #DCDCCC; font-weight: bold;">:defer</span> t
  <span style="color: #DCDCCC; font-weight: bold;">:config</span>
  <span style="color: #bf62a6;">(</span>define-key flyspell-mode-map <span style="color: #459ba8;">(</span>kbd <span style="color: #CC9393;">"M-S"</span><span style="color: #459ba8;">)</span> 'helm-flyspell-correct<span style="color: #bf62a6;">)</span><span style="color: #78c5d6;">)</span>
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-orgcfa53fb" class="outline-3">
<h3 id="orgcfa53fb"><span class="section-number-3">4.6</span> Backup and autosave</h3>
<div class="outline-text-3" id="text-4-6">
<p>
Backup is one of the things people usually want to <a href="http://ergoemacs.org/emacs/emacs_set_backup_into_a_directory.html">change right away</a>. By
default, Emacs saves backup files in the current directory. These are the files
ending in <code>~</code> that are cluttering up your directory lists. The following code
stashes them all in <code>$HOME/.emacs.d/backup</code>, where I can find them with <code>C-x
C-f</code> if I really need to.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #5F7F5F;">;; </span><span style="color: #7F9F7F;">backup in one place. flat, no tree structure</span>
<span style="color: #78c5d6;">(</span><span style="color: #F0DFAF; font-weight: bold;">setq</span> backup-directory-alist `<span style="color: #bf62a6;">(</span><span style="color: #459ba8;">(</span><span style="color: #CC9393;">".*"</span> . ,user-emacs-backup-dir<span style="color: #459ba8;">)</span><span style="color: #bf62a6;">)</span><span style="color: #78c5d6;">)</span>
<span style="color: #78c5d6;">(</span><span style="color: #F0DFAF; font-weight: bold;">setq</span> make-backup-files t<span style="color: #78c5d6;">)</span>

<span style="color: #5F7F5F;">;; </span><span style="color: #7F9F7F;">store the undo-tree history in one place</span>
<span style="color: #78c5d6;">(</span><span style="color: #F0DFAF; font-weight: bold;">setq</span> undo-tree-history-directory-alist `<span style="color: #bf62a6;">(</span><span style="color: #459ba8;">(</span><span style="color: #CC9393;">".*"</span> . ,user-emacs-backup-dir<span style="color: #459ba8;">)</span><span style="color: #bf62a6;">)</span><span style="color: #78c5d6;">)</span>      
<span style="color: #78c5d6;">(</span><span style="color: #F0DFAF; font-weight: bold;">setq</span> undo-tree-auto-save-history t<span style="color: #78c5d6;">)</span>

<span style="color: #5F7F5F;">;; </span><span style="color: #7F9F7F;">backup misc settings</span>
<span style="color: #78c5d6;">(</span><span style="color: #F0DFAF; font-weight: bold;">setq</span> backup-by-copying t<span style="color: #78c5d6;">)</span>
<span style="color: #78c5d6;">(</span><span style="color: #F0DFAF; font-weight: bold;">setq</span> delete-old-versions t<span style="color: #78c5d6;">)</span>
<span style="color: #78c5d6;">(</span><span style="color: #F0DFAF; font-weight: bold;">setq</span> version-control t<span style="color: #78c5d6;">)</span>
<span style="color: #78c5d6;">(</span><span style="color: #F0DFAF; font-weight: bold;">setq</span> vc-make-backup-files t<span style="color: #78c5d6;">)</span>
<span style="color: #78c5d6;">(</span><span style="color: #F0DFAF; font-weight: bold;">setq</span> kept-new-versions 6
      kept-old-versions 2<span style="color: #78c5d6;">)</span>
</pre>
</div>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #78c5d6;">(</span><span style="color: #F0DFAF; font-weight: bold;">setq</span> auto-save-file-name-transforms `<span style="color: #bf62a6;">(</span><span style="color: #459ba8;">(</span><span style="color: #CC9393;">".*"</span> ,user-emacs-autosave-dir t<span style="color: #459ba8;">)</span><span style="color: #bf62a6;">)</span><span style="color: #78c5d6;">)</span>
<span style="color: #78c5d6;">(</span><span style="color: #F0DFAF; font-weight: bold;">setq</span> auto-save-default t<span style="color: #78c5d6;">)</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-org550bef9" class="outline-3">
<h3 id="org550bef9"><span class="section-number-3">4.7</span> Persistence and history</h3>
<div class="outline-text-3" id="text-4-7">
</div>
<div id="outline-container-orge820de4" class="outline-4">
<h4 id="orge820de4"><span class="section-number-4">4.7.1</span> Recentf - recent files</h4>
<div class="outline-text-4" id="text-4-7-1">
<p>
<code>Recentf</code> is a minor mode that builds a list of recently opened files. Turn it
on, then call <code>recentf-open-files</code> to open recently opened files fast.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #78c5d6;">(</span><span style="color: #F0DFAF; font-weight: bold;">require</span> '<span style="color: #BFEBBF;">recentf</span><span style="color: #78c5d6;">)</span>
<span style="color: #78c5d6;">(</span>recentf-mode 1<span style="color: #78c5d6;">)</span> <span style="color: #5F7F5F;">; </span><span style="color: #7F9F7F;">keep a list of recently opened files, for future sessions</span>
<span style="color: #78c5d6;">(</span><span style="color: #F0DFAF; font-weight: bold;">setq</span> recentf-save-file <span style="color: #bf62a6;">(</span>expand-file-name <span style="color: #CC9393;">"recentf"</span> user-emacs-savefile-dir<span style="color: #bf62a6;">)</span><span style="color: #78c5d6;">)</span>

<span style="color: #78c5d6;">(</span><span style="color: #F0DFAF; font-weight: bold;">setq</span> recentf-max-saved-items 500
      recentf-max-menu-items 25
      <span style="color: #5F7F5F;">;; </span><span style="color: #7F9F7F;">disable recentf-cleanup on Emacs start, because it can cause</span>
      <span style="color: #5F7F5F;">;; </span><span style="color: #7F9F7F;">problems with remote files</span>
      recentf-auto-cleanup 'never<span style="color: #78c5d6;">)</span>

<span style="color: #78c5d6;">(</span>global-set-key <span style="color: #bf62a6;">(</span>kbd <span style="color: #CC9393;">"C-c f r"</span><span style="color: #bf62a6;">)</span> 'recentf-open-files<span style="color: #78c5d6;">)</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-org0583cee" class="outline-4">
<h4 id="org0583cee"><span class="section-number-4">4.7.2</span> Saveplace - save file position</h4>
<div class="outline-text-4" id="text-4-7-2">
<p>
You can save the cursor position for every file you opened. So, next time you
open the file, the cursor will be at the position you last opened it.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #78c5d6;">(</span><span style="color: #F0DFAF; font-weight: bold;">require</span> '<span style="color: #BFEBBF;">saveplace</span><span style="color: #78c5d6;">)</span>
<span style="color: #78c5d6;">(</span>save-place-mode 1<span style="color: #78c5d6;">)</span>
<span style="color: #78c5d6;">(</span><span style="color: #F0DFAF; font-weight: bold;">setq</span> save-place-file <span style="color: #bf62a6;">(</span>expand-file-name <span style="color: #CC9393;">"saveplace"</span> user-emacs-savefile-dir<span style="color: #bf62a6;">)</span><span style="color: #78c5d6;">)</span>
</pre>
</div>
</div>
</div>
