init.org
*** Savehist - save history

By default, =Savehist= saves only your minibuffer histories, but you can
optionally save other histories and other variables as well.

#+BEGIN_SRC emacs-lisp :tangle yes
  (require 'savehist)
  (savehist-mode 1)
  (setq savehist-file (expand-file-name "savehist" user-emacs-savefile-dir))

  (setq history-length t)
  (setq history-delete-duplicates t)
  (setq savehist-save-minibuffer-history 1)
  (setq savehist-additional-variables
        '(kill-ring
          search-ring
          regexp-search-ring))
#+END_SRC
*** Desktop - save and restore opened files and windows config

=Desktop= can save and restore all previously opened files in last Emacs
session, and also previous windows configuration.

#+BEGIN_SRC emacs-lisp :tangle no
  (require 'desktop)
  (desktop-save-mode 1)
  (setq desktop-base-file-name (expand-file-name "desktop" user-emacs-savefile-dir))
  (setq desktop-base-lock-name (expand-file-name "desktop.lock" user-emacs-savefile-dir))

  (setq desktop-save 'ask)
  (setq desktop-auto-save-timeout nil)
#+END_SRC

I don't tangle this block anymore because it slow down the startup speed
obviously.

*** Bookmark - emacs bookmark

=Bookmarks= lets you easily open frequently needed files. It is similar to
browser's bookmark. Read this [[http://ergoemacs.org/emacs/bookmark.html][article]] about the usage.

#+BEGIN_SRC emacs-lisp :tangle yes
  (require 'bookmark)
  (setq bookmark-default-file (expand-file-name "bookmark" user-emacs-savefile-dir))
  (setq bookmark-save-flag 1) ; everytime bookmark is changed, auto save it
#+END_SRC
*** Eshell - emacs shell

#+BEGIN_SRC emacs-lisp :tangle yes
  (require 'eshell)
  (setq eshell-directory-name (expand-file-name "eshell" user-emacs-savefile-dir))
#+END_SRC
** Global Key Bindings
*** Function keys

#+BEGIN_SRC emacs-lisp :tangle yes
  (global-set-key [f8] 'other-frame)
  (global-set-key [f9] 'enlarge-window)
  (global-set-key [f10] 'enlarge-window-horizontally)
  (global-set-key [f11] 'toggle-frame-fullscreen)
#+END_SRC
*** Easy keys for frequently used commands

Split and unsplit window panes are some of the most frequently used commands,
because Emacs often generates output in a splits window. So set easy keys for
them:

#+BEGIN_SRC emacs-lisp :tangle yes
  (global-set-key (kbd "s-0") 'delete-window)
  (global-set-key (kbd "s-1") 'delete-other-windows)
  (global-set-key (kbd "s-2") 'split-window-below)
  (global-set-key (kbd "s-3") 'split-window-right)
#+END_SRC

Change font size:

#+BEGIN_SRC emacs-lisp :tangle yes
  (global-set-key (kbd "C-s-=") 'text-scale-increase)
  (global-set-key (kbd "C-s--") 'text-scale-decrease)
#+END_SRC
*** Toggles

Bind shortcuts to some mode /toggle/ functions. Inspired by [[http://endlessparentheses.com/the-toggle-map-and-wizardry.html][this article]], I am
a wizard now.

#+BEGIN_SRC emacs-lisp :tangle yes
  (define-prefix-command 'endless/toggle-map)
  ;; The manual recommends C-c for user keys, but C-x t is
  ;; always free, whereas C-c t is used by some modes.
  (define-key ctl-x-map "t" 'endless/toggle-map)
  ;; build-in packages
  (define-key endless/toggle-map "d" #'toggle-debug-on-error)
  (define-key endless/toggle-map "q" #'toggle-debug-on-quit)
  (define-key endless/toggle-map "f" #'auto-fill-mode)
  (define-key endless/toggle-map "t" #'toggle-truncate-lines)
  (define-key endless/toggle-map "l" #'display-line-numbers-mode)
  ;; packages installed by `use-packages'
  (define-key endless/toggle-map "w" #'whitespace-mode)
  (define-key endless/toggle-map "s" #'flyspell-mode)
  (define-key endless/toggle-map "c" #'flycheck-mode)
  (define-key endless/toggle-map "g" #'git-timemachine)
#+END_SRC
