init.html
<div id="outline-container-org19fedd5" class="outline-4">
<h4 id="org19fedd5"><span class="section-number-4">4.7.3</span> Savehist - save history</h4>
<div class="outline-text-4" id="text-4-7-3">
<p>
By default, <code>Savehist</code> saves only your minibuffer histories, but you can
optionally save other histories and other variables as well.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #78c5d6;">(</span><span style="color: #F0DFAF; font-weight: bold;">require</span> '<span style="color: #BFEBBF;">savehist</span><span style="color: #78c5d6;">)</span>
<span style="color: #78c5d6;">(</span>savehist-mode 1<span style="color: #78c5d6;">)</span>
<span style="color: #78c5d6;">(</span><span style="color: #F0DFAF; font-weight: bold;">setq</span> savehist-file <span style="color: #bf62a6;">(</span>expand-file-name <span style="color: #CC9393;">"savehist"</span> user-emacs-savefile-dir<span style="color: #bf62a6;">)</span><span style="color: #78c5d6;">)</span>

<span style="color: #78c5d6;">(</span><span style="color: #F0DFAF; font-weight: bold;">setq</span> history-length t<span style="color: #78c5d6;">)</span>
<span style="color: #78c5d6;">(</span><span style="color: #F0DFAF; font-weight: bold;">setq</span> history-delete-duplicates t<span style="color: #78c5d6;">)</span>
<span style="color: #78c5d6;">(</span><span style="color: #F0DFAF; font-weight: bold;">setq</span> savehist-save-minibuffer-history 1<span style="color: #78c5d6;">)</span>
<span style="color: #78c5d6;">(</span><span style="color: #F0DFAF; font-weight: bold;">setq</span> savehist-additional-variables
      '<span style="color: #bf62a6;">(</span>kill-ring
        search-ring
        regexp-search-ring<span style="color: #bf62a6;">)</span><span style="color: #78c5d6;">)</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-orgdf00bf0" class="outline-4">
<h4 id="orgdf00bf0"><span class="section-number-4">4.7.4</span> Desktop - save and restore opened files and windows config</h4>
<div class="outline-text-4" id="text-4-7-4">
<p>
<code>Desktop</code> can save and restore all previously opened files in last Emacs
session, and also previous windows configuration.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #78c5d6;">(</span><span style="color: #F0DFAF; font-weight: bold;">require</span> '<span style="color: #BFEBBF;">desktop</span><span style="color: #78c5d6;">)</span>
<span style="color: #78c5d6;">(</span>desktop-save-mode 1<span style="color: #78c5d6;">)</span>
<span style="color: #78c5d6;">(</span><span style="color: #F0DFAF; font-weight: bold;">setq</span> desktop-base-file-name <span style="color: #bf62a6;">(</span>expand-file-name <span style="color: #CC9393;">"desktop"</span> user-emacs-savefile-dir<span style="color: #bf62a6;">)</span><span style="color: #78c5d6;">)</span>
<span style="color: #78c5d6;">(</span><span style="color: #F0DFAF; font-weight: bold;">setq</span> desktop-base-lock-name <span style="color: #bf62a6;">(</span>expand-file-name <span style="color: #CC9393;">"desktop.lock"</span> user-emacs-savefile-dir<span style="color: #bf62a6;">)</span><span style="color: #78c5d6;">)</span>

<span style="color: #78c5d6;">(</span><span style="color: #F0DFAF; font-weight: bold;">setq</span> desktop-save 'ask<span style="color: #78c5d6;">)</span>
<span style="color: #78c5d6;">(</span><span style="color: #F0DFAF; font-weight: bold;">setq</span> desktop-auto-save-timeout nil<span style="color: #78c5d6;">)</span>
</pre>
</div>

<p>
I don't tangle this block anymore because it slow down the startup speed
obviously.
</p>
</div>
</div>

<div id="outline-container-orge73dee1" class="outline-4">
<h4 id="orge73dee1"><span class="section-number-4">4.7.5</span> Bookmark - emacs bookmark</h4>
<div class="outline-text-4" id="text-4-7-5">
<p>
<code>Bookmarks</code> lets you easily open frequently needed files. It is similar to
browser's bookmark. Read this <a href="http://ergoemacs.org/emacs/bookmark.html">article</a> about the usage.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #78c5d6;">(</span><span style="color: #F0DFAF; font-weight: bold;">require</span> '<span style="color: #BFEBBF;">bookmark</span><span style="color: #78c5d6;">)</span>
<span style="color: #78c5d6;">(</span><span style="color: #F0DFAF; font-weight: bold;">setq</span> bookmark-default-file <span style="color: #bf62a6;">(</span>expand-file-name <span style="color: #CC9393;">"bookmark"</span> user-emacs-savefile-dir<span style="color: #bf62a6;">)</span><span style="color: #78c5d6;">)</span>
<span style="color: #78c5d6;">(</span><span style="color: #F0DFAF; font-weight: bold;">setq</span> bookmark-save-flag 1<span style="color: #78c5d6;">)</span> <span style="color: #5F7F5F;">; </span><span style="color: #7F9F7F;">everytime bookmark is changed, auto save it</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-org9776cf4" class="outline-4">
<h4 id="org9776cf4"><span class="section-number-4">4.7.6</span> Eshell - emacs shell</h4>
<div class="outline-text-4" id="text-4-7-6">
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #78c5d6;">(</span><span style="color: #F0DFAF; font-weight: bold;">require</span> '<span style="color: #BFEBBF;">eshell</span><span style="color: #78c5d6;">)</span>
<span style="color: #78c5d6;">(</span><span style="color: #F0DFAF; font-weight: bold;">setq</span> eshell-directory-name <span style="color: #bf62a6;">(</span>expand-file-name <span style="color: #CC9393;">"eshell"</span> user-emacs-savefile-dir<span style="color: #bf62a6;">)</span><span style="color: #78c5d6;">)</span>
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-orge5721e4" class="outline-3">
<h3 id="orge5721e4"><span class="section-number-3">4.8</span> Global Key Bindings</h3>
<div class="outline-text-3" id="text-4-8">
</div>
<div id="outline-container-org3822179" class="outline-4">
<h4 id="org3822179"><span class="section-number-4">4.8.1</span> Function keys</h4>
<div class="outline-text-4" id="text-4-8-1">
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #78c5d6;">(</span>global-set-key <span style="color: #bf62a6;">[</span>f8<span style="color: #bf62a6;">]</span> 'other-frame<span style="color: #78c5d6;">)</span>
<span style="color: #78c5d6;">(</span>global-set-key <span style="color: #bf62a6;">[</span>f9<span style="color: #bf62a6;">]</span> 'enlarge-window<span style="color: #78c5d6;">)</span>
<span style="color: #78c5d6;">(</span>global-set-key <span style="color: #bf62a6;">[</span>f10<span style="color: #bf62a6;">]</span> 'enlarge-window-horizontally<span style="color: #78c5d6;">)</span>
<span style="color: #78c5d6;">(</span>global-set-key <span style="color: #bf62a6;">[</span>f11<span style="color: #bf62a6;">]</span> 'toggle-frame-fullscreen<span style="color: #78c5d6;">)</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-org7d2b14d" class="outline-4">
<h4 id="org7d2b14d"><span class="section-number-4">4.8.2</span> Easy keys for frequently used commands</h4>
<div class="outline-text-4" id="text-4-8-2">
<p>
Split and unsplit window panes are some of the most frequently used commands,
because Emacs often generates output in a splits window. So set easy keys for
them:
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #78c5d6;">(</span>global-set-key <span style="color: #bf62a6;">(</span>kbd <span style="color: #CC9393;">"s-0"</span><span style="color: #bf62a6;">)</span> 'delete-window<span style="color: #78c5d6;">)</span>
<span style="color: #78c5d6;">(</span>global-set-key <span style="color: #bf62a6;">(</span>kbd <span style="color: #CC9393;">"s-1"</span><span style="color: #bf62a6;">)</span> 'delete-other-windows<span style="color: #78c5d6;">)</span>
<span style="color: #78c5d6;">(</span>global-set-key <span style="color: #bf62a6;">(</span>kbd <span style="color: #CC9393;">"s-2"</span><span style="color: #bf62a6;">)</span> 'split-window-below<span style="color: #78c5d6;">)</span>
<span style="color: #78c5d6;">(</span>global-set-key <span style="color: #bf62a6;">(</span>kbd <span style="color: #CC9393;">"s-3"</span><span style="color: #bf62a6;">)</span> 'split-window-right<span style="color: #78c5d6;">)</span>
</pre>
</div>

<p>
Change font size:
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #78c5d6;">(</span>global-set-key <span style="color: #bf62a6;">(</span>kbd <span style="color: #CC9393;">"C-s-="</span><span style="color: #bf62a6;">)</span> 'text-scale-increase<span style="color: #78c5d6;">)</span>
<span style="color: #78c5d6;">(</span>global-set-key <span style="color: #bf62a6;">(</span>kbd <span style="color: #CC9393;">"C-s--"</span><span style="color: #bf62a6;">)</span> 'text-scale-decrease<span style="color: #78c5d6;">)</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-org62b05f7" class="outline-4">
<h4 id="org62b05f7"><span class="section-number-4">4.8.3</span> Toggles</h4>
<div class="outline-text-4" id="text-4-8-3">
<p>
Bind shortcuts to some mode <i>toggle</i> functions. Inspired by <a href="http://endlessparentheses.com/the-toggle-map-and-wizardry.html">this article</a>, I am
a wizard now.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #78c5d6;">(</span>define-prefix-command 'endless/toggle-map<span style="color: #78c5d6;">)</span>
<span style="color: #5F7F5F;">;; </span><span style="color: #7F9F7F;">The manual recommends C-c for user keys, but C-x t is</span>
<span style="color: #5F7F5F;">;; </span><span style="color: #7F9F7F;">always free, whereas C-c t is used by some modes.</span>
<span style="color: #78c5d6;">(</span>define-key ctl-x-map <span style="color: #CC9393;">"t"</span> 'endless/toggle-map<span style="color: #78c5d6;">)</span>
<span style="color: #5F7F5F;">;; </span><span style="color: #7F9F7F;">build-in packages</span>
<span style="color: #78c5d6;">(</span>define-key endless/toggle-map <span style="color: #CC9393;">"d"</span> #'toggle-debug-on-error<span style="color: #78c5d6;">)</span>
<span style="color: #78c5d6;">(</span>define-key endless/toggle-map <span style="color: #CC9393;">"q"</span> #'toggle-debug-on-quit<span style="color: #78c5d6;">)</span>
<span style="color: #78c5d6;">(</span>define-key endless/toggle-map <span style="color: #CC9393;">"f"</span> #'auto-fill-mode<span style="color: #78c5d6;">)</span>
<span style="color: #78c5d6;">(</span>define-key endless/toggle-map <span style="color: #CC9393;">"t"</span> #'toggle-truncate-lines<span style="color: #78c5d6;">)</span>
<span style="color: #78c5d6;">(</span>define-key endless/toggle-map <span style="color: #CC9393;">"l"</span> #'display-line-numbers-mode<span style="color: #78c5d6;">)</span>
<span style="color: #5F7F5F;">;; </span><span style="color: #7F9F7F;">packages installed by `</span><span style="color: #BFEBBF;">use-packages</span><span style="color: #7F9F7F;">'</span>
<span style="color: #78c5d6;">(</span>define-key endless/toggle-map <span style="color: #CC9393;">"w"</span> #'whitespace-mode<span style="color: #78c5d6;">)</span>
<span style="color: #78c5d6;">(</span>define-key endless/toggle-map <span style="color: #CC9393;">"s"</span> #'flyspell-mode<span style="color: #78c5d6;">)</span>
<span style="color: #78c5d6;">(</span>define-key endless/toggle-map <span style="color: #CC9393;">"c"</span> #'flycheck-mode<span style="color: #78c5d6;">)</span>
<span style="color: #78c5d6;">(</span>define-key endless/toggle-map <span style="color: #CC9393;">"g"</span> #'git-timemachine<span style="color: #78c5d6;">)</span>
</pre>
</div>
</div>
</div>
