init.org
*** Miscellaneous

Here are some useful global key bindings.

#+BEGIN_SRC emacs-lisp :tangle yes
  ;; Align your code in a pretty way.
  (global-set-key (kbd "C-x \\") 'align-regexp)

  ;; Start eshell or switch to it if it's active.
  (global-set-key (kbd "C-x m") 'eshell)

  ;; Start a new eshell even if one is active.
  (global-set-key (kbd "C-x M") (lambda () (interactive) (eshell t)))

  ;; Start a regular shell if you prefer that.
  (global-set-key (kbd "C-x M-m") 'shell)

  ;; use hippie-expand instead of dabbrev
  (global-set-key (kbd "M-/") 'hippie-expand)

  ;; replace buffer-menu with ibuffer
  (global-set-key (kbd "C-x C-b") 'ibuffer)
#+END_SRC
*** =Which-key= - keys cheat sheet

Many command sequences may be logical, but who can remember them all? Don't
worry. [[https://github.com/justbur/emacs-which-key][Which-key]] can display the key bindings following your currently entered
incomplete command (a prefix) in a popup.

#+BEGIN_SRC emacs-lisp :tangle yes
  (use-package which-key
    :ensure t
    :config (which-key-mode))
#+END_SRC
* Aesthetics
** Color Themes

[[http://ethanschoonover.com/solarized][Solarized Theme]] and [[https://github.com/nashamri/spacemacs-theme][Spacemacs Theme]] are my favorite color themes. And the
[[https://github.com/bbatsov/zenburn-emacs][Zenburn Theme]] is also really nice. I used these as my default color themes.

According to this [[http://stackoverflow.com/questions/23793288/cycle-custom-themes-w-emacs-24/23794179#23794179][Stackoverflow discuss]] , I can use =f12= to switch color
themes.

#+BEGIN_SRC emacs-lisp :tangle yes
  (use-package zenburn-theme :defer t)
  (use-package solarized-theme :defer t)
  (use-package spacemacs-theme :defer t)

  ;; color theme cycle list
  (setq my-themes (list
                   'zenburn
                   'spacemacs-light
                   'spacemacs-dark
                   ;; 'solarized-light
                   ;; 'solarized-dark
                   ))

  (defun my-theme-cycle ()
    (interactive)
    (disable-theme (car curr-theme)) ;;Nee flickeringded to stop even worse
    (setq curr-theme (cdr curr-theme))
    (if (null curr-theme) (setq curr-theme my-themes))
    (load-theme (car curr-theme) t)
    (message "%s" (car curr-theme)))

  (global-set-key [f12] 'my-theme-cycle)
  (setq curr-theme my-themes)
  (load-theme (car curr-theme) t)
#+END_SRC
** Modeline Theme

#+BEGIN_SRC emacs-lisp :tangle yes
  (use-package powerline
    :ensure t
    :init
    (setq powerline-default-separator 'curve
          powerline-default-separator-dir (quote (left . right))
          powerline-height 28
          powerline-display-buffer-size nil
          powerline-display-hud nil
          powerline-display-mule-info nil
          powerline-gui-use-vcs-glyph t
          powerline-inactive1 '((t (:background "grey11" :foreground "#c5c8c6")))
          powerline-inactive2 '((t (:background "grey20" :foreground "#c5c8c6")))))
#+END_SRC
