init.html
<div id="outline-container-org2a1b9c9" class="outline-4">
<h4 id="org2a1b9c9"><span class="section-number-4">4.8.4</span> Miscellaneous</h4>
<div class="outline-text-4" id="text-4-8-4">
<p>
Here are some useful global key bindings.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #5F7F5F;">;; </span><span style="color: #7F9F7F;">Align your code in a pretty way.</span>
<span style="color: #78c5d6;">(</span>global-set-key <span style="color: #bf62a6;">(</span>kbd <span style="color: #CC9393;">"C-x \\"</span><span style="color: #bf62a6;">)</span> 'align-regexp<span style="color: #78c5d6;">)</span>

<span style="color: #5F7F5F;">;; </span><span style="color: #7F9F7F;">Start eshell or switch to it if it's active.</span>
<span style="color: #78c5d6;">(</span>global-set-key <span style="color: #bf62a6;">(</span>kbd <span style="color: #CC9393;">"C-x m"</span><span style="color: #bf62a6;">)</span> 'eshell<span style="color: #78c5d6;">)</span>

<span style="color: #5F7F5F;">;; </span><span style="color: #7F9F7F;">Start a new eshell even if one is active.</span>
<span style="color: #78c5d6;">(</span>global-set-key <span style="color: #bf62a6;">(</span>kbd <span style="color: #CC9393;">"C-x M"</span><span style="color: #bf62a6;">)</span> <span style="color: #bf62a6;">(</span><span style="color: #F0DFAF; font-weight: bold;">lambda</span> <span style="color: #459ba8;">()</span> <span style="color: #459ba8;">(</span><span style="color: #F0DFAF; font-weight: bold;">interactive</span><span style="color: #459ba8;">)</span> <span style="color: #459ba8;">(</span>eshell t<span style="color: #459ba8;">)</span><span style="color: #bf62a6;">)</span><span style="color: #78c5d6;">)</span>

<span style="color: #5F7F5F;">;; </span><span style="color: #7F9F7F;">Start a regular shell if you prefer that.</span>
<span style="color: #78c5d6;">(</span>global-set-key <span style="color: #bf62a6;">(</span>kbd <span style="color: #CC9393;">"C-x M-m"</span><span style="color: #bf62a6;">)</span> 'shell<span style="color: #78c5d6;">)</span>

<span style="color: #5F7F5F;">;; </span><span style="color: #7F9F7F;">use hippie-expand instead of dabbrev</span>
<span style="color: #78c5d6;">(</span>global-set-key <span style="color: #bf62a6;">(</span>kbd <span style="color: #CC9393;">"M-/"</span><span style="color: #bf62a6;">)</span> 'hippie-expand<span style="color: #78c5d6;">)</span>

<span style="color: #5F7F5F;">;; </span><span style="color: #7F9F7F;">replace buffer-menu with ibuffer</span>
<span style="color: #78c5d6;">(</span>global-set-key <span style="color: #bf62a6;">(</span>kbd <span style="color: #CC9393;">"C-x C-b"</span><span style="color: #bf62a6;">)</span> 'ibuffer<span style="color: #78c5d6;">)</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-org515152b" class="outline-4">
<h4 id="org515152b"><span class="section-number-4">4.8.5</span> <code>Which-key</code> - keys cheat sheet</h4>
<div class="outline-text-4" id="text-4-8-5">
<p>
Many command sequences may be logical, but who can remember them all? Don't
worry. <a href="https://github.com/justbur/emacs-which-key">Which-key</a> can display the key bindings following your currently entered
incomplete command (a prefix) in a popup.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #78c5d6;">(</span><span style="color: #F0DFAF; font-weight: bold;">use-package</span> <span style="color: #BFEBBF;">which-key</span>
  <span style="color: #DCDCCC; font-weight: bold;">:ensure</span> t
  <span style="color: #DCDCCC; font-weight: bold;">:config</span> <span style="color: #bf62a6;">(</span>which-key-mode<span style="color: #bf62a6;">)</span><span style="color: #78c5d6;">)</span>
</pre>
</div>
</div>
</div>
</div>
</div>
<div id="outline-container-org95ee843" class="outline-2">
<h2 id="org95ee843"><span class="section-number-2">5</span> Aesthetics</h2>
<div class="outline-text-2" id="text-5">
</div>
<div id="outline-container-org7b2d953" class="outline-3">
<h3 id="org7b2d953"><span class="section-number-3">5.1</span> Color Themes</h3>
<div class="outline-text-3" id="text-5-1">
<p>
<a href="http://ethanschoonover.com/solarized">Solarized Theme</a> and <a href="https://github.com/nashamri/spacemacs-theme">Spacemacs Theme</a> are my favorite color themes. And the
<a href="https://github.com/bbatsov/zenburn-emacs">Zenburn Theme</a> is also really nice. I used these as my default color themes.
</p>

<p>
According to this <a href="http://stackoverflow.com/questions/23793288/cycle-custom-themes-w-emacs-24/23794179#23794179">Stackoverflow discuss</a> , I can use <code>f12</code> to switch color
themes.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #78c5d6;">(</span><span style="color: #F0DFAF; font-weight: bold;">use-package</span> <span style="color: #BFEBBF;">zenburn-theme</span> <span style="color: #DCDCCC; font-weight: bold;">:defer</span> t<span style="color: #78c5d6;">)</span>
<span style="color: #78c5d6;">(</span><span style="color: #F0DFAF; font-weight: bold;">use-package</span> <span style="color: #BFEBBF;">solarized-theme</span> <span style="color: #DCDCCC; font-weight: bold;">:defer</span> t<span style="color: #78c5d6;">)</span>
<span style="color: #78c5d6;">(</span><span style="color: #F0DFAF; font-weight: bold;">use-package</span> <span style="color: #BFEBBF;">spacemacs-theme</span> <span style="color: #DCDCCC; font-weight: bold;">:defer</span> t<span style="color: #78c5d6;">)</span>

<span style="color: #5F7F5F;">;; </span><span style="color: #7F9F7F;">color theme cycle list</span>
<span style="color: #78c5d6;">(</span><span style="color: #F0DFAF; font-weight: bold;">setq</span> my-themes <span style="color: #bf62a6;">(</span>list
                 'zenburn
                 'spacemacs-light
                 'spacemacs-dark
                 <span style="color: #5F7F5F;">;; </span><span style="color: #7F9F7F;">'solarized-light</span>
                 <span style="color: #5F7F5F;">;; </span><span style="color: #7F9F7F;">'solarized-dark</span>
                 <span style="color: #bf62a6;">)</span><span style="color: #78c5d6;">)</span>

<span style="color: #78c5d6;">(</span><span style="color: #F0DFAF; font-weight: bold;">defun</span> <span style="color: #93E0E3;">my-theme-cycle</span> <span style="color: #bf62a6;">()</span>
  <span style="color: #bf62a6;">(</span><span style="color: #F0DFAF; font-weight: bold;">interactive</span><span style="color: #bf62a6;">)</span>
  <span style="color: #bf62a6;">(</span>disable-theme <span style="color: #459ba8;">(</span>car curr-theme<span style="color: #459ba8;">)</span><span style="color: #bf62a6;">)</span> <span style="color: #5F7F5F;">;;</span><span style="color: #7F9F7F;">Nee flickeringded to stop even worse</span>
  <span style="color: #bf62a6;">(</span><span style="color: #F0DFAF; font-weight: bold;">setq</span> curr-theme <span style="color: #459ba8;">(</span>cdr curr-theme<span style="color: #459ba8;">)</span><span style="color: #bf62a6;">)</span>
  <span style="color: #bf62a6;">(</span><span style="color: #F0DFAF; font-weight: bold;">if</span> <span style="color: #459ba8;">(</span>null curr-theme<span style="color: #459ba8;">)</span> <span style="color: #459ba8;">(</span><span style="color: #F0DFAF; font-weight: bold;">setq</span> curr-theme my-themes<span style="color: #459ba8;">)</span><span style="color: #bf62a6;">)</span>
  <span style="color: #bf62a6;">(</span>load-theme <span style="color: #459ba8;">(</span>car curr-theme<span style="color: #459ba8;">)</span> t<span style="color: #bf62a6;">)</span>
  <span style="color: #bf62a6;">(</span>message <span style="color: #CC9393;">"%s"</span> <span style="color: #459ba8;">(</span>car curr-theme<span style="color: #459ba8;">)</span><span style="color: #bf62a6;">)</span><span style="color: #78c5d6;">)</span>

<span style="color: #78c5d6;">(</span>global-set-key <span style="color: #bf62a6;">[</span>f12<span style="color: #bf62a6;">]</span> 'my-theme-cycle<span style="color: #78c5d6;">)</span>
<span style="color: #78c5d6;">(</span><span style="color: #F0DFAF; font-weight: bold;">setq</span> curr-theme my-themes<span style="color: #78c5d6;">)</span>
<span style="color: #78c5d6;">(</span>load-theme <span style="color: #bf62a6;">(</span>car curr-theme<span style="color: #bf62a6;">)</span> t<span style="color: #78c5d6;">)</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-orgb3cea75" class="outline-3">
<h3 id="orgb3cea75"><span class="section-number-3">5.2</span> Modeline Theme</h3>
<div class="outline-text-3" id="text-5-2">
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #78c5d6;">(</span><span style="color: #F0DFAF; font-weight: bold;">use-package</span> <span style="color: #BFEBBF;">powerline</span>
  <span style="color: #DCDCCC; font-weight: bold;">:ensure</span> t
  <span style="color: #DCDCCC; font-weight: bold;">:init</span>
  <span style="color: #bf62a6;">(</span><span style="color: #F0DFAF; font-weight: bold;">setq</span> powerline-default-separator 'curve
        powerline-default-separator-dir <span style="color: #459ba8;">(</span><span style="color: #F0DFAF; font-weight: bold;">quote</span> <span style="color: #e868a2;">(</span>left . right<span style="color: #e868a2;">)</span><span style="color: #459ba8;">)</span>
        powerline-height 28
        powerline-display-buffer-size nil
        powerline-display-hud nil
        powerline-display-mule-info nil
        powerline-gui-use-vcs-glyph t
        powerline-inactive1 '<span style="color: #459ba8;">(</span><span style="color: #e868a2;">(</span>t <span style="color: #79c267;">(</span><span style="color: #DCDCCC; font-weight: bold;">:background</span> <span style="color: #CC9393;">"</span><span style="color: #ffffff; background-color: #1c1c1c;">grey11</span><span style="color: #CC9393;">"</span> <span style="color: #DCDCCC; font-weight: bold;">:foreground</span> <span style="color: #CC9393;">"</span><span style="color: #000000; background-color: #c5c8c6;">#c5c8c6</span><span style="color: #CC9393;">"</span><span style="color: #79c267;">)</span><span style="color: #e868a2;">)</span><span style="color: #459ba8;">)</span>
        powerline-inactive2 '<span style="color: #459ba8;">(</span><span style="color: #e868a2;">(</span>t <span style="color: #79c267;">(</span><span style="color: #DCDCCC; font-weight: bold;">:background</span> <span style="color: #CC9393;">"</span><span style="color: #ffffff; background-color: #333333;">grey20</span><span style="color: #CC9393;">"</span> <span style="color: #DCDCCC; font-weight: bold;">:foreground</span> <span style="color: #CC9393;">"</span><span style="color: #000000; background-color: #c5c8c6;">#c5c8c6</span><span style="color: #CC9393;">"</span><span style="color: #79c267;">)</span><span style="color: #e868a2;">)</span><span style="color: #459ba8;">)</span><span style="color: #bf62a6;">)</span><span style="color: #78c5d6;">)</span>
</pre>
</div>
</div>
</div>
