init.html
<div id="outline-container-org1fec352" class="outline-3">
<h3 id="org1fec352"><span class="section-number-3">5.3</span> Icons</h3>
<div class="outline-text-3" id="text-5-3">
<p>
According to <a href="https://github.com/jaypei/emacs-neotree">this</a>, install <a href="https://github.com/domtronn/all-the-icons.el">all-the-icon</a> package for neotree's color theme:
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #78c5d6;">(</span><span style="color: #F0DFAF; font-weight: bold;">use-package</span> <span style="color: #BFEBBF;">all-the-icons</span><span style="color: #78c5d6;">)</span>
</pre>
</div>

<p>
In order for the icons to work it is very important that you install the
<i>Resource Fonts</i> included in this package. Call the following command:
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">M-x all-the-icons-install-fonts
</pre>
</div>

<p>
Then use <code>all-the-icons</code> for <code>neotree</code>:
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #78c5d6;">(</span><span style="color: #F0DFAF; font-weight: bold;">setq</span> inhibit-compacting-font-caches t<span style="color: #78c5d6;">)</span>
<span style="color: #78c5d6;">(</span><span style="color: #F0DFAF; font-weight: bold;">setq</span> neo-theme 'icons<span style="color: #78c5d6;">)</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-orgd0174c6" class="outline-3">
<h3 id="orgd0174c6"><span class="section-number-3">5.4</span> Fonts</h3>
<div class="outline-text-3" id="text-5-4">
<p>
Choosing a nice and comfortable font is quite important in your whole coding
life.
</p>

<p>
I prefer <i>Monaco</i>. And, as a Chinese, l choose <i>WenQuanYi</i> for Chinese charset.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #78c5d6;">(</span><span style="color: #F0DFAF; font-weight: bold;">when</span> <span style="color: #bf62a6;">(</span>eq system-type 'darwin<span style="color: #bf62a6;">)</span>

  <span style="color: #5F7F5F;">;; </span><span style="color: #7F9F7F;">default Latin font (e.g. Consolas)</span>
  <span style="color: #bf62a6;">(</span>set-face-attribute 'default nil <span style="color: #DCDCCC; font-weight: bold;">:family</span> <span style="color: #CC9393;">"Monaco"</span><span style="color: #bf62a6;">)</span>

  <span style="color: #5F7F5F;">;; </span><span style="color: #7F9F7F;">default font size (point * 10)</span>
  <span style="color: #5F7F5F;">;;</span>
  <span style="color: #5F7F5F;">;; </span><span style="color: #7F9F7F;">WARNING!  Depending on the default font,</span>
  <span style="color: #5F7F5F;">;; </span><span style="color: #7F9F7F;">if the size is not supported very well, the frame will be clipped</span>
  <span style="color: #5F7F5F;">;; </span><span style="color: #7F9F7F;">so that the beginning of the buffer may not be visible correctly.</span>
  <span style="color: #bf62a6;">(</span>set-face-attribute 'default nil <span style="color: #DCDCCC; font-weight: bold;">:height</span> 150<span style="color: #bf62a6;">)</span>

  <span style="color: #5F7F5F;">;; </span><span style="color: #7F9F7F;">use specific font for Chinese charset.</span>
  <span style="color: #5F7F5F;">;; </span><span style="color: #7F9F7F;">if you want to use different font size for specific charset,</span>
  <span style="color: #5F7F5F;">;; </span><span style="color: #7F9F7F;">add :size POINT-SIZE in the font-spec.</span>
  <span style="color: #bf62a6;">(</span>set-fontset-font t 'han <span style="color: #459ba8;">(</span>font-spec <span style="color: #DCDCCC; font-weight: bold;">:name</span> <span style="color: #CC9393;">"WenQuanYi Micro Hei Mono"</span><span style="color: #459ba8;">)</span><span style="color: #bf62a6;">)</span>
  <span style="color: #78c5d6;">)</span>
</pre>
</div>

<p>
<code>M-x eshell</code>, then run the command <code>(print (font-family-list))</code>. You will see a
list of fonts can be used in Emacs.
</p>
</div>
</div>

<div id="outline-container-org3aa3f60" class="outline-3">
<h3 id="org3aa3f60"><span class="section-number-3">5.5</span> <code>Nyan-mode</code> - Nyan cat in modeline</h3>
<div class="outline-text-3" id="text-5-5">
<p>
Let <a href="https://en.wikipedia.org/wiki/Nyan_Cat">Nyan Cat</a> show you your buffer position in mode line. You can scroll the
buffer by clicking on the Nyan Cat’s rainbow and the space in front of it.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #78c5d6;">(</span><span style="color: #F0DFAF; font-weight: bold;">use-package</span> <span style="color: #BFEBBF;">nyan-mode</span>
  <span style="color: #DCDCCC; font-weight: bold;">:init</span> <span style="color: #bf62a6;">(</span>nyan-mode<span style="color: #bf62a6;">)</span><span style="color: #78c5d6;">)</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-org7879fca" class="outline-3">
<h3 id="org7879fca"><span class="section-number-3">5.6</span> <code>Rainbow-delimiters</code> - color delimiters for LISP</h3>
<div class="outline-text-3" id="text-5-6">
<p>
For lisp like languages, I want to witness the full power of colorful
<a href="https://github.com/Fanael/rainbow-delimiters">rainbow-delimiters</a>! I will even set them to pastel versions of the rainbow
colors.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #78c5d6;">(</span><span style="color: #F0DFAF; font-weight: bold;">use-package</span> <span style="color: #BFEBBF;">rainbow-delimiters</span>
  <span style="color: #DCDCCC; font-weight: bold;">:init</span> <span style="color: #bf62a6;">(</span>rainbow-delimiters-mode 1<span style="color: #bf62a6;">)</span><span style="color: #78c5d6;">)</span>

<span style="color: #78c5d6;">(</span>set-face-attribute 'rainbow-delimiters-depth-1-face nil
                    <span style="color: #DCDCCC; font-weight: bold;">:foreground</span> <span style="color: #CC9393;">"</span><span style="color: #000000; background-color: #78c5d6;">#78c5d6</span><span style="color: #CC9393;">"</span><span style="color: #78c5d6;">)</span>
<span style="color: #78c5d6;">(</span>set-face-attribute 'rainbow-delimiters-depth-2-face nil
                    <span style="color: #DCDCCC; font-weight: bold;">:foreground</span> <span style="color: #CC9393;">"</span><span style="color: #ffffff; background-color: #bf62a6;">#bf62a6</span><span style="color: #CC9393;">"</span><span style="color: #78c5d6;">)</span>
<span style="color: #78c5d6;">(</span>set-face-attribute 'rainbow-delimiters-depth-3-face nil
                    <span style="color: #DCDCCC; font-weight: bold;">:foreground</span> <span style="color: #CC9393;">"</span><span style="color: #000000; background-color: #459ba8;">#459ba8</span><span style="color: #CC9393;">"</span><span style="color: #78c5d6;">)</span>
<span style="color: #78c5d6;">(</span>set-face-attribute 'rainbow-delimiters-depth-4-face nil
                    <span style="color: #DCDCCC; font-weight: bold;">:foreground</span> <span style="color: #CC9393;">"</span><span style="color: #000000; background-color: #e868a2;">#e868a2</span><span style="color: #CC9393;">"</span><span style="color: #78c5d6;">)</span>
<span style="color: #78c5d6;">(</span>set-face-attribute 'rainbow-delimiters-depth-5-face nil
                    <span style="color: #DCDCCC; font-weight: bold;">:foreground</span> <span style="color: #CC9393;">"</span><span style="color: #000000; background-color: #79c267;">#79c267</span><span style="color: #CC9393;">"</span><span style="color: #78c5d6;">)</span>
<span style="color: #78c5d6;">(</span>set-face-attribute 'rainbow-delimiters-depth-6-face nil
                    <span style="color: #DCDCCC; font-weight: bold;">:foreground</span> <span style="color: #CC9393;">"</span><span style="color: #000000; background-color: #f28c33;">#f28c33</span><span style="color: #CC9393;">"</span><span style="color: #78c5d6;">)</span>
<span style="color: #78c5d6;">(</span>set-face-attribute 'rainbow-delimiters-depth-7-face nil
                    <span style="color: #DCDCCC; font-weight: bold;">:foreground</span> <span style="color: #CC9393;">"</span><span style="color: #000000; background-color: #c5d647;">#c5d647</span><span style="color: #CC9393;">"</span><span style="color: #78c5d6;">)</span>
<span style="color: #78c5d6;">(</span>set-face-attribute 'rainbow-delimiters-depth-8-face nil
                    <span style="color: #DCDCCC; font-weight: bold;">:foreground</span> <span style="color: #CC9393;">"</span><span style="color: #000000; background-color: #f5d63d;">#f5d63d</span><span style="color: #CC9393;">"</span><span style="color: #78c5d6;">)</span>
<span style="color: #78c5d6;">(</span>set-face-attribute 'rainbow-delimiters-depth-9-face nil
                    <span style="color: #DCDCCC; font-weight: bold;">:foreground</span> <span style="color: #CC9393;">"</span><span style="color: #000000; background-color: #78c5d6;">#78c5d6</span><span style="color: #CC9393;">"</span><span style="color: #78c5d6;">)</span>
</pre>
</div>

<p>
We also want to make unmatched parens stand out more:
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #78c5d6;">(</span>set-face-attribute 'rainbow-delimiters-unmatched-face nil
                    <span style="color: #DCDCCC; font-weight: bold;">:foreground</span> 'unspecified
                    <span style="color: #DCDCCC; font-weight: bold;">:inherit</span> 'show-paren-mismatch
                    <span style="color: #DCDCCC; font-weight: bold;">:strike-through</span> t<span style="color: #78c5d6;">)</span>
</pre>
</div>

<p>
Now we just need to adjust the hook for lisp-like languages. Possibly have to
add clojure, if I ever want to mess with that.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #78c5d6;">(</span>add-hook 'emacs-lisp-mode-hook 'rainbow-delimiters-mode<span style="color: #78c5d6;">)</span>
<span style="color: #78c5d6;">(</span>add-hook 'lisp-mode-hook 'rainbow-delimiters-mode<span style="color: #78c5d6;">)</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-org5023f55" class="outline-3">
<h3 id="org5023f55"><span class="section-number-3">5.7</span> <code>Rainbow-mode</code> - color words for CSS</h3>
<div class="outline-text-3" id="text-5-7">
<p>
<code>Rainbow-mode</code> makes "color words" in my programs appear in the colours they
describe. Particularly good for CSS and the like.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #78c5d6;">(</span><span style="color: #F0DFAF; font-weight: bold;">use-package</span> <span style="color: #BFEBBF;">rainbow-mode</span>
  <span style="color: #DCDCCC; font-weight: bold;">:diminish</span> rainbow-mode
  <span style="color: #DCDCCC; font-weight: bold;">:config</span>
  <span style="color: #bf62a6;">(</span>add-hook 'emacs-lisp-mode-hook 'rainbow-mode<span style="color: #bf62a6;">)</span>
  <span style="color: #bf62a6;">(</span>add-hook 'css-mode-hook 'rainbow-mode<span style="color: #bf62a6;">)</span>
  <span style="color: #bf62a6;">(</span>add-hook 'html-mode-hook 'rainbow-mode<span style="color: #bf62a6;">)</span>
  <span style="color: #bf62a6;">(</span>add-hook 'js2-mode-hook 'rainbow-mode<span style="color: #bf62a6;">)</span><span style="color: #78c5d6;">)</span>
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-org2d45e76" class="outline-2">
<h2 id="org2d45e76"><span class="section-number-2">6</span> Programming Environment</h2>
<div class="outline-text-2" id="text-6">
</div>
