init.org
** Editing Support
*** Aggressive Indent

Automatically indent without use of the tab found in [[http://endlessparentheses.com/permanent-auto-indentation.html][this article]], and seems to
be quite helpful for many types of programming languages.

#+BEGIN_SRC emacs-lisp :tangle yes
  (use-package aggressive-indent
    :init (global-aggressive-indent-mode 1))
#+END_SRC
*** Indent Guide

[[https://github.com/zk-phi/indent-guide][Indent Guide]] project shows vertical lines to guide indentation.

#+BEGIN_SRC emacs-lisp :tangle yes
  (use-package indent-guide
    :init (indent-guide-global-mode))
#+END_SRC
*** Code Folding

The [[https://www.emacswiki.org/emacs/HideShow][Hide Show]] minor mode allows us to /fold/ all functions (hidden), showing
only the header lines. We need to turn on the mode, so wrappers are in order:

#+BEGIN_SRC emacs-lisp :tangle yes
  (defun ha/hs-show-all ()
    (interactive)
    (hs-minor-mode 1)
    (hs-show-all))

  (defun ha/hs-hide-all ()
    (interactive)
    (hs-minor-mode 1)
    (hs-hide-all))

  (defun ha/hs-toggle-hiding ()
    (interactive)
    (hs-minor-mode 1)
    (hs-toggle-hiding))
 #+END_SRC

 Seems that =C-c @= is too obnoxious to use, so I'll put my favorite on the
 =C-c h= prefix:

 #+BEGIN_SRC emacs-lisp :tangle yes
   (global-set-key (kbd "C-x t h") 'hs-minor-mode)
   (global-set-key (kbd "C-c t h") 'ha/hs-hide-all)
   (global-set-key (kbd "C-c t s") 'ha/hs-show-all)
   (global-set-key (kbd "C-c t c") 'ha/hs-toggle-hiding)
 #+END_SRC
** Document

I like [[https://www.emacswiki.org/emacs/ElDoc][ElDoc]] support (when I can get it), but not needed in the mode line.

#+BEGIN_SRC emacs-lisp :tangle yes
  (use-package eldoc
    :diminish eldoc-mode
    :init (setq eldoc-idle-delay 0.1))
#+END_SRC
** Error checking

[[https://github.com/flycheck/flycheck][Flycheck]] seems to be quite superior to =Flymake=.

#+BEGIN_SRC emacs-lisp :tangle yes
  (use-package flycheck
    :bind ("C-x t c" . flycheck-mode)
    :ensure t
    :diminish flycheck-mode
    :init
    (add-hook 'after-init-hook 'global-flycheck-mode)
    :config
    (setq-default flycheck-disabled-checkers '(emacs-lisp-checkdoc)))
#+END_SRC
* Programming Languages
** Shell

Make a shell script executable automatically on save.

#+BEGIN_SRC emacs-lisp :tangle yes
  (add-hook 'after-save-hook
            'executable-make-buffer-file-executable-if-script-p)
#+END_SRC

Files with =.zsh= extension is shell script too.

#+BEGIN_SRC emacs-lisp :tangle yes
  (add-to-list 'auto-mode-alist '("\\.zsh\\'" . sh-mode))
#+END_SRC
* Typesetting Languages
** Markdown

[[https://github.com/defunkt/markdown-mode][Markdown-mode]] is a major mode for editing Markdown-formatted text.

#+BEGIN_SRC emacs-lisp :tangle yes
  (use-package markdown-mode
    :ensure t
    :commands (markdown-mode gfm-mode)
    :mode (("README\\.md\\'" . gfm-mode)
           ("\\.md\\'" . markdown-mode)
           ("\\.markdown\\'" . markdown-mode))
    :init (setq markdown-command "multimarkdown"))
#+END_SRC
** LaTeX
* Git and Magit
