init.html
<div id="outline-container-orgbbdbc3c" class="outline-3">
<h3 id="orgbbdbc3c"><span class="section-number-3">6.1</span> Editing Support</h3>
<div class="outline-text-3" id="text-6-1">
</div>
<div id="outline-container-orga4e314f" class="outline-4">
<h4 id="orga4e314f"><span class="section-number-4">6.1.1</span> Aggressive Indent</h4>
<div class="outline-text-4" id="text-6-1-1">
<p>
Automatically indent without use of the tab found in <a href="http://endlessparentheses.com/permanent-auto-indentation.html">this article</a>, and seems to
be quite helpful for many types of programming languages.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #78c5d6;">(</span><span style="color: #F0DFAF; font-weight: bold;">use-package</span> <span style="color: #BFEBBF;">aggressive-indent</span>
  <span style="color: #DCDCCC; font-weight: bold;">:init</span> <span style="color: #bf62a6;">(</span>global-aggressive-indent-mode 1<span style="color: #bf62a6;">)</span><span style="color: #78c5d6;">)</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-org84a6db2" class="outline-4">
<h4 id="org84a6db2"><span class="section-number-4">6.1.2</span> Indent Guide</h4>
<div class="outline-text-4" id="text-6-1-2">
<p>
<a href="https://github.com/zk-phi/indent-guide">Indent Guide</a> project shows vertical lines to guide indentation.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #78c5d6;">(</span><span style="color: #F0DFAF; font-weight: bold;">use-package</span> <span style="color: #BFEBBF;">indent-guide</span>
  <span style="color: #DCDCCC; font-weight: bold;">:init</span> <span style="color: #bf62a6;">(</span>indent-guide-global-mode<span style="color: #bf62a6;">)</span><span style="color: #78c5d6;">)</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-org51c57ee" class="outline-4">
<h4 id="org51c57ee"><span class="section-number-4">6.1.3</span> Code Folding</h4>
<div class="outline-text-4" id="text-6-1-3">
<p>
The <a href="https://www.emacswiki.org/emacs/HideShow">Hide Show</a> minor mode allows us to <i>fold</i> all functions (hidden), showing
only the header lines. We need to turn on the mode, so wrappers are in order:
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #78c5d6;">(</span><span style="color: #F0DFAF; font-weight: bold;">defun</span> <span style="color: #93E0E3;">ha/hs-show-all</span> <span style="color: #bf62a6;">()</span>
  <span style="color: #bf62a6;">(</span><span style="color: #F0DFAF; font-weight: bold;">interactive</span><span style="color: #bf62a6;">)</span>
  <span style="color: #bf62a6;">(</span>hs-minor-mode 1<span style="color: #bf62a6;">)</span>
  <span style="color: #bf62a6;">(</span>hs-show-all<span style="color: #bf62a6;">)</span><span style="color: #78c5d6;">)</span>

<span style="color: #78c5d6;">(</span><span style="color: #F0DFAF; font-weight: bold;">defun</span> <span style="color: #93E0E3;">ha/hs-hide-all</span> <span style="color: #bf62a6;">()</span>
  <span style="color: #bf62a6;">(</span><span style="color: #F0DFAF; font-weight: bold;">interactive</span><span style="color: #bf62a6;">)</span>
  <span style="color: #bf62a6;">(</span>hs-minor-mode 1<span style="color: #bf62a6;">)</span>
  <span style="color: #bf62a6;">(</span>hs-hide-all<span style="color: #bf62a6;">)</span><span style="color: #78c5d6;">)</span>

<span style="color: #78c5d6;">(</span><span style="color: #F0DFAF; font-weight: bold;">defun</span> <span style="color: #93E0E3;">ha/hs-toggle-hiding</span> <span style="color: #bf62a6;">()</span>
  <span style="color: #bf62a6;">(</span><span style="color: #F0DFAF; font-weight: bold;">interactive</span><span style="color: #bf62a6;">)</span>
  <span style="color: #bf62a6;">(</span>hs-minor-mode 1<span style="color: #bf62a6;">)</span>
  <span style="color: #bf62a6;">(</span>hs-toggle-hiding<span style="color: #bf62a6;">)</span><span style="color: #78c5d6;">)</span>
</pre>
</div>

<p>
Seems that <code>C-c @</code> is too obnoxious to use, so I'll put my favorite on the
<code>C-c h</code> prefix:
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #78c5d6;">(</span>global-set-key <span style="color: #bf62a6;">(</span>kbd <span style="color: #CC9393;">"C-x t h"</span><span style="color: #bf62a6;">)</span> 'hs-minor-mode<span style="color: #78c5d6;">)</span>
<span style="color: #78c5d6;">(</span>global-set-key <span style="color: #bf62a6;">(</span>kbd <span style="color: #CC9393;">"C-c t h"</span><span style="color: #bf62a6;">)</span> 'ha/hs-hide-all<span style="color: #78c5d6;">)</span>
<span style="color: #78c5d6;">(</span>global-set-key <span style="color: #bf62a6;">(</span>kbd <span style="color: #CC9393;">"C-c t s"</span><span style="color: #bf62a6;">)</span> 'ha/hs-show-all<span style="color: #78c5d6;">)</span>
<span style="color: #78c5d6;">(</span>global-set-key <span style="color: #bf62a6;">(</span>kbd <span style="color: #CC9393;">"C-c t c"</span><span style="color: #bf62a6;">)</span> 'ha/hs-toggle-hiding<span style="color: #78c5d6;">)</span>
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-org60a6ee2" class="outline-3">
<h3 id="org60a6ee2"><span class="section-number-3">6.2</span> Document</h3>
<div class="outline-text-3" id="text-6-2">
<p>
I like <a href="https://www.emacswiki.org/emacs/ElDoc">ElDoc</a> support (when I can get it), but not needed in the mode line.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #78c5d6;">(</span><span style="color: #F0DFAF; font-weight: bold;">use-package</span> <span style="color: #BFEBBF;">eldoc</span>
  <span style="color: #DCDCCC; font-weight: bold;">:diminish</span> eldoc-mode
  <span style="color: #DCDCCC; font-weight: bold;">:init</span> <span style="color: #bf62a6;">(</span><span style="color: #F0DFAF; font-weight: bold;">setq</span> eldoc-idle-delay 0.1<span style="color: #bf62a6;">)</span><span style="color: #78c5d6;">)</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-org454e553" class="outline-3">
<h3 id="org454e553"><span class="section-number-3">6.3</span> Error checking</h3>
<div class="outline-text-3" id="text-6-3">
<p>
<a href="https://github.com/flycheck/flycheck">Flycheck</a> seems to be quite superior to <code>Flymake</code>.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #78c5d6;">(</span><span style="color: #F0DFAF; font-weight: bold;">use-package</span> <span style="color: #BFEBBF;">flycheck</span>
  <span style="color: #DCDCCC; font-weight: bold;">:bind</span> <span style="color: #bf62a6;">(</span><span style="color: #CC9393;">"C-x t c"</span> . flycheck-mode<span style="color: #bf62a6;">)</span>
  <span style="color: #DCDCCC; font-weight: bold;">:ensure</span> t
  <span style="color: #DCDCCC; font-weight: bold;">:diminish</span> flycheck-mode
  <span style="color: #DCDCCC; font-weight: bold;">:init</span>
  <span style="color: #bf62a6;">(</span>add-hook 'after-init-hook 'global-flycheck-mode<span style="color: #bf62a6;">)</span>
  <span style="color: #DCDCCC; font-weight: bold;">:config</span>
  <span style="color: #bf62a6;">(</span><span style="color: #F0DFAF; font-weight: bold;">setq-default</span> flycheck-disabled-checkers '<span style="color: #459ba8;">(</span>emacs-lisp-checkdoc<span style="color: #459ba8;">)</span><span style="color: #bf62a6;">)</span><span style="color: #78c5d6;">)</span>
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-orgbaf193b" class="outline-2">
<h2 id="orgbaf193b"><span class="section-number-2">7</span> Programming Languages</h2>
<div class="outline-text-2" id="text-7">
</div>
<div id="outline-container-org6bcb334" class="outline-3">
<h3 id="org6bcb334"><span class="section-number-3">7.1</span> Shell</h3>
<div class="outline-text-3" id="text-7-1">
<p>
Make a shell script executable automatically on save.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #78c5d6;">(</span>add-hook 'after-save-hook
          'executable-make-buffer-file-executable-if-script-p<span style="color: #78c5d6;">)</span>
</pre>
</div>

<p>
Files with <code>.zsh</code> extension is shell script too.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #78c5d6;">(</span>add-to-list 'auto-mode-alist '<span style="color: #bf62a6;">(</span><span style="color: #CC9393;">"\\.zsh\\'"</span> . sh-mode<span style="color: #bf62a6;">)</span><span style="color: #78c5d6;">)</span>
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-orgaaeb5c0" class="outline-2">
<h2 id="orgaaeb5c0"><span class="section-number-2">8</span> Typesetting Languages</h2>
<div class="outline-text-2" id="text-8">
</div>
<div id="outline-container-org41d9938" class="outline-3">
<h3 id="org41d9938"><span class="section-number-3">8.1</span> Markdown</h3>
<div class="outline-text-3" id="text-8-1">
<p>
<a href="https://github.com/defunkt/markdown-mode">Markdown-mode</a> is a major mode for editing Markdown-formatted text.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #78c5d6;">(</span><span style="color: #F0DFAF; font-weight: bold;">use-package</span> <span style="color: #BFEBBF;">markdown-mode</span>
  <span style="color: #DCDCCC; font-weight: bold;">:ensure</span> t
  <span style="color: #DCDCCC; font-weight: bold;">:commands</span> <span style="color: #bf62a6;">(</span>markdown-mode gfm-mode<span style="color: #bf62a6;">)</span>
  <span style="color: #DCDCCC; font-weight: bold;">:mode</span> <span style="color: #bf62a6;">(</span><span style="color: #459ba8;">(</span><span style="color: #CC9393;">"README\\.md\\'"</span> . gfm-mode<span style="color: #459ba8;">)</span>
         <span style="color: #459ba8;">(</span><span style="color: #CC9393;">"\\.md\\'"</span> . markdown-mode<span style="color: #459ba8;">)</span>
         <span style="color: #459ba8;">(</span><span style="color: #CC9393;">"\\.markdown\\'"</span> . markdown-mode<span style="color: #459ba8;">)</span><span style="color: #bf62a6;">)</span>
  <span style="color: #DCDCCC; font-weight: bold;">:init</span> <span style="color: #bf62a6;">(</span><span style="color: #F0DFAF; font-weight: bold;">setq</span> markdown-command <span style="color: #CC9393;">"multimarkdown"</span><span style="color: #bf62a6;">)</span><span style="color: #78c5d6;">)</span>
</pre>
</div>
</div>
</div>
