init.org
** Git basic settings

I like [[https://github.com/dgutov/diff-hl][diff-hl]]. This mode can highlight uncommitted changes on the left side of
the window, allows you to jump between and revert them selectively.

#+BEGIN_SRC emacs-lisp :tangle yes
  (use-package diff-hl
    :ensure t
    :init (global-diff-hl-mode)
    :config
    (add-hook 'dired-mode-hook 'diff-hl-dired-mode)
    (add-hook 'magit-post-refresh-hook 'diff-hl-magit-post-refresh))
#+END_SRC

I want to have special mode for Git's =gitconfig= and =gitignore= file:

#+BEGIN_SRC emacs-lisp :tangle yes
  (use-package gitconfig-mode
    :ensure t)

  (use-package gitignore-mode
    :ensure t)
#+END_SRC

Play with [[https://gitlab.com/pidu/git-timemachine/blob/master/README.md][Git Time Machine]] project for viewing the different version history of
a file with =p= and =n=.

#+BEGIN_SRC emacs-lisp :tangle yes
  (use-package git-timemachine
    :bind ("C-x t g" . git-timemachine))
#+END_SRC

[[https://github.com/syohex/emacs-git-messenger][Git Messenger]] can popup commit message at current line.

#+begin_src emacs-lisp :tangle yes
  (use-package git-messenger
    :bind (("C-x v m" . git-messenger:popup-message)))
#+end_src
** Magit - git interface

Git is [[http://emacswiki.org/emacs/Git][already part of Emacs]]. However, *[[https://magit.vc][Magit]] is sweet!*

#+BEGIN_SRC emacs-lisp :tangle yes
  (use-package magit
    :ensure t
    :commands magit-status magit-blame
    :init
    (defadvice magit-status (around magit-fullscreen activate)
      (window-configuration-to-register :magit-fullscreen)
      ad-do-it
      (delete-other-windows))
    :config
    (setq magit-branch-arguments nil
          ;; use ido to look for branches
          magit-completing-read-function 'magit-ido-completing-read
          ;; don't put "origin-" in front of new branch names by default
          magit-default-tracking-name-function 'magit-default-tracking-name-branch-only
          magit-push-always-verify nil
          ;; Get rid of the previous advice to go into fullscreen
          magit-restore-window-configuration t)

    :bind ("C-x g" . magit-status))
#+END_SRC
* Org-Mode
** Exporter Setup

I have the following setup for the exporters I use. Alphabetical listing
options need to be set before the exporters are loaded for filling to work
correctly.

#+BEGIN_SRC emacs-lisp :tangle yes
  (setq org-alphabetical-lists t)

  ;; Explicitly load required exporters
  (require 'ox-html)
  (require 'ox-latex)
  (require 'ox-ascii)
  (require 'ox-md)
#+END_SRC

The =ox-extra= package make it possible to export content of subtrees without
their headings.

#+BEGIN_SRC emacs-lisp :tangle yes
  (require 'ox-extra)
  (ox-extras-activate '(ignore-headlines))
#+END_SRC

* Acknowledges

+ Inspired by [[http://pages.sachachua.com/.emacs.d/Sacha.html][Sacha]] and [[http://doc.norang.ca/org-mode.html][Bernt]], I began to maintain my Emacs configuration using
  =org-babel= in literate style.

+ My configuration taken a lot from [[https://github.com/howardabrams/dot-files][Howard Abrams's Emacs initialization code]]
  which is well structured and documented with =org-mode=.

+ Benefit from the [[https://magit.vc][Magit]] project's Themes, I built the pretty nice Emacs Init
  File Project Page.
