init.html
<div id="outline-container-org5550191" class="outline-3">
<h3 id="org5550191"><span class="section-number-3">8.2</span> LaTeX</h3>
</div>
</div>
<div id="outline-container-org8a7daa7" class="outline-2">
<h2 id="org8a7daa7"><span class="section-number-2">9</span> Git and Magit</h2>
<div class="outline-text-2" id="text-9">
</div>
<div id="outline-container-org7c5bf1e" class="outline-3">
<h3 id="org7c5bf1e"><span class="section-number-3">9.1</span> Git basic settings</h3>
<div class="outline-text-3" id="text-9-1">
<p>
I like <a href="https://github.com/dgutov/diff-hl">diff-hl</a>. This mode can highlight uncommitted changes on the left side of
the window, allows you to jump between and revert them selectively.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #78c5d6;">(</span><span style="color: #F0DFAF; font-weight: bold;">use-package</span> <span style="color: #BFEBBF;">diff-hl</span>
  <span style="color: #DCDCCC; font-weight: bold;">:ensure</span> t
  <span style="color: #DCDCCC; font-weight: bold;">:init</span> <span style="color: #bf62a6;">(</span>global-diff-hl-mode<span style="color: #bf62a6;">)</span>
  <span style="color: #DCDCCC; font-weight: bold;">:config</span>
  <span style="color: #bf62a6;">(</span>add-hook 'dired-mode-hook 'diff-hl-dired-mode<span style="color: #bf62a6;">)</span>
  <span style="color: #bf62a6;">(</span>add-hook 'magit-post-refresh-hook 'diff-hl-magit-post-refresh<span style="color: #bf62a6;">)</span><span style="color: #78c5d6;">)</span>
</pre>
</div>

<p>
I want to have special mode for Git's <code>gitconfig</code> and <code>gitignore</code> file:
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #78c5d6;">(</span><span style="color: #F0DFAF; font-weight: bold;">use-package</span> <span style="color: #BFEBBF;">gitconfig-mode</span>
  <span style="color: #DCDCCC; font-weight: bold;">:ensure</span> t<span style="color: #78c5d6;">)</span>

<span style="color: #78c5d6;">(</span><span style="color: #F0DFAF; font-weight: bold;">use-package</span> <span style="color: #BFEBBF;">gitignore-mode</span>
  <span style="color: #DCDCCC; font-weight: bold;">:ensure</span> t<span style="color: #78c5d6;">)</span>
</pre>
</div>

<p>
Play with <a href="https://gitlab.com/pidu/git-timemachine/blob/master/README.md">Git Time Machine</a> project for viewing the different version history of
a file with <code>p</code> and <code>n</code>.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #78c5d6;">(</span><span style="color: #F0DFAF; font-weight: bold;">use-package</span> <span style="color: #BFEBBF;">git-timemachine</span>
  <span style="color: #DCDCCC; font-weight: bold;">:bind</span> <span style="color: #bf62a6;">(</span><span style="color: #CC9393;">"C-x t g"</span> . git-timemachine<span style="color: #bf62a6;">)</span><span style="color: #78c5d6;">)</span>
</pre>
</div>

<p>
<a href="https://github.com/syohex/emacs-git-messenger">Git Messenger</a> can popup commit message at current line.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #78c5d6;">(</span><span style="color: #F0DFAF; font-weight: bold;">use-package</span> <span style="color: #BFEBBF;">git-messenger</span>
  <span style="color: #DCDCCC; font-weight: bold;">:bind</span> <span style="color: #bf62a6;">(</span><span style="color: #459ba8;">(</span><span style="color: #CC9393;">"C-x v m"</span> . git-messenger:popup-message<span style="color: #459ba8;">)</span><span style="color: #bf62a6;">)</span><span style="color: #78c5d6;">)</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-org3dde1b7" class="outline-3">
<h3 id="org3dde1b7"><span class="section-number-3">9.2</span> Magit - git interface</h3>
<div class="outline-text-3" id="text-9-2">
<p>
Git is <a href="http://emacswiki.org/emacs/Git">already part of Emacs</a>. However, <b><a href="https://magit.vc">Magit</a> is sweet!</b>
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #78c5d6;">(</span><span style="color: #F0DFAF; font-weight: bold;">use-package</span> <span style="color: #BFEBBF;">magit</span>
  <span style="color: #DCDCCC; font-weight: bold;">:ensure</span> t
  <span style="color: #DCDCCC; font-weight: bold;">:commands</span> magit-status magit-blame
  <span style="color: #DCDCCC; font-weight: bold;">:init</span>
  <span style="color: #bf62a6;">(</span><span style="color: #F0DFAF; font-weight: bold;">defadvice</span> <span style="color: #93E0E3;">magit-status</span> <span style="color: #459ba8;">(</span>around magit-fullscreen activate<span style="color: #459ba8;">)</span>
    <span style="color: #459ba8;">(</span>window-configuration-to-register <span style="color: #DCDCCC; font-weight: bold;">:magit-fullscreen</span><span style="color: #459ba8;">)</span>
    ad-do-it
    <span style="color: #459ba8;">(</span>delete-other-windows<span style="color: #459ba8;">)</span><span style="color: #bf62a6;">)</span>
  <span style="color: #DCDCCC; font-weight: bold;">:config</span>
  <span style="color: #bf62a6;">(</span><span style="color: #F0DFAF; font-weight: bold;">setq</span> magit-branch-arguments nil
        <span style="color: #5F7F5F;">;; </span><span style="color: #7F9F7F;">use ido to look for branches</span>
        magit-completing-read-function 'magit-ido-completing-read
        <span style="color: #5F7F5F;">;; </span><span style="color: #7F9F7F;">don't put "origin-" in front of new branch names by default</span>
        magit-default-tracking-name-function 'magit-default-tracking-name-branch-only
        magit-push-always-verify nil
        <span style="color: #5F7F5F;">;; </span><span style="color: #7F9F7F;">Get rid of the previous advice to go into fullscreen</span>
        magit-restore-window-configuration t<span style="color: #bf62a6;">)</span>

  <span style="color: #DCDCCC; font-weight: bold;">:bind</span> <span style="color: #bf62a6;">(</span><span style="color: #CC9393;">"C-x g"</span> . magit-status<span style="color: #bf62a6;">)</span><span style="color: #78c5d6;">)</span>
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-orgd9cb109" class="outline-2">
<h2 id="orgd9cb109"><span class="section-number-2">10</span> Org-Mode</h2>
<div class="outline-text-2" id="text-10">
</div>
<div id="outline-container-org48f0163" class="outline-3">
<h3 id="org48f0163"><span class="section-number-3">10.1</span> Exporter Setup</h3>
<div class="outline-text-3" id="text-10-1">
<p>
I have the following setup for the exporters I use. Alphabetical listing
options need to be set before the exporters are loaded for filling to work
correctly.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #78c5d6;">(</span><span style="color: #F0DFAF; font-weight: bold;">setq</span> org-alphabetical-lists t<span style="color: #78c5d6;">)</span>

<span style="color: #5F7F5F;">;; </span><span style="color: #7F9F7F;">Explicitly load required exporters</span>
<span style="color: #78c5d6;">(</span><span style="color: #F0DFAF; font-weight: bold;">require</span> '<span style="color: #BFEBBF;">ox-html</span><span style="color: #78c5d6;">)</span>
<span style="color: #78c5d6;">(</span><span style="color: #F0DFAF; font-weight: bold;">require</span> '<span style="color: #BFEBBF;">ox-latex</span><span style="color: #78c5d6;">)</span>
<span style="color: #78c5d6;">(</span><span style="color: #F0DFAF; font-weight: bold;">require</span> '<span style="color: #BFEBBF;">ox-ascii</span><span style="color: #78c5d6;">)</span>
<span style="color: #78c5d6;">(</span><span style="color: #F0DFAF; font-weight: bold;">require</span> '<span style="color: #BFEBBF;">ox-md</span><span style="color: #78c5d6;">)</span>
</pre>
</div>

<p>
The <code>ox-extra</code> package make it possible to export content of subtrees without
their headings.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #78c5d6;">(</span><span style="color: #F0DFAF; font-weight: bold;">require</span> '<span style="color: #BFEBBF;">ox-extra</span><span style="color: #78c5d6;">)</span>
<span style="color: #78c5d6;">(</span>ox-extras-activate '<span style="color: #bf62a6;">(</span>ignore-headlines<span style="color: #bf62a6;">)</span><span style="color: #78c5d6;">)</span>
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-orgffdc68a" class="outline-2">
<h2 id="orgffdc68a"><span class="section-number-2">11</span> Acknowledges</h2>
<div class="outline-text-2" id="text-11">
<ul class="org-ul">
<li>Inspired by <a href="http://pages.sachachua.com/.emacs.d/Sacha.html">Sacha</a> and <a href="http://doc.norang.ca/org-mode.html">Bernt</a>, I began to maintain my Emacs configuration using
<code>org-babel</code> in literate style.</li>

<li>My configuration taken a lot from <a href="https://github.com/howardabrams/dot-files">Howard Abrams's Emacs initialization code</a>
which is well structured and documented with <code>org-mode</code>.</li>

<li>Benefit from the <a href="https://magit.vc">Magit</a> project's Themes, I built the pretty nice Emacs Init
File Project Page.</li>
</ul>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Date: 2016-2019</p>
<p class="author">Author: Xiaojie Feng</p>
<p class="email">Email: <a href="mailto:fengxiaojie1997@gmail.com">fengxiaojie1997@gmail.com</a></p>
<p class="date">Created: 2019-09-01 Sun 22:47</p>
<p class="creator"><a href="https://www.gnu.org/software/emacs/">Emacs</a> 26.1 (<a href="https://orgmode.org">Org</a> mode 9.2.5)</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
